Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32U5G9/Includes/Registers/stm32U5Gx_gtzc1_mpcbb6.h
#define	GTZC1_MPCBB6_CFGLOCK2_SPLCK51	(0x1u<<19)
#define	GTZC1_MPCBB6_CFGLOCK2_SPLCK50	(0x1u<<18)
#define	GTZC1_MPCBB6_CFGLOCK2_SPLCK49	(0x1u<<17)
#define	GTZC1_MPCBB6_CFGLOCK2_SPLCK48	(0x1u<<16)
#define	GTZC1_MPCBB6_CFGLOCK2_SPLCK47	(0x1u<<15)
#define	GTZC1_MPCBB6_CFGLOCK2_SPLCK46	(0x1u<<14)
#define	GTZC1_MPCBB6_CFGLOCK2_SPLCK45	(0x1u<<13)
#define	GTZC1_MPCBB6_CFGLOCK2_SPLCK44	(0x1u<<12)
#define	GTZC1_MPCBB6_CFGLOCK2_SPLCK43	(0x1u<<11)
#define	GTZC1_MPCBB6_CFGLOCK2_SPLCK42	(0x1u<<10)
#define	GTZC1_MPCBB6_CFGLOCK2_SPLCK41	(0x1u<<9)
#define	GTZC1_MPCBB6_CFGLOCK2_SPLCK40	(0x1u<<8)
#define	GTZC1_MPCBB6_CFGLOCK2_SPLCK39	(0x1u<<7)
#define	GTZC1_MPCBB6_CFGLOCK2_SPLCK38	(0x1u<<6)
#define	GTZC1_MPCBB6_CFGLOCK2_SPLCK37	(0x1u<<5)
#define	GTZC1_MPCBB6_CFGLOCK2_SPLCK36	(0x1u<<4)
#define	GTZC1_MPCBB6_CFGLOCK2_SPLCK35	(0x1u<<3)
#define	GTZC1_MPCBB6_CFGLOCK2_SPLCK34	(0x1u<<2)
#define	GTZC1_MPCBB6_CFGLOCK2_SPLCK33	(0x1u<<1)
#define	GTZC1_MPCBB6_CFGLOCK2_SPLCK32	(0x1u<<0)

// SECCFGR0 Configuration

#define	GTZC1_MPCBB6_SECCFGR0_SEC31		(0x1u<<31)
#define	GTZC1_MPCBB6_SECCFGR0_SEC30		(0x1u<<30)
#define	GTZC1_MPCBB6_SECCFGR0_SEC29		(0x1u<<29)
#define	GTZC1_MPCBB6_SECCFGR0_SEC28		(0x1u<<28)
#define	GTZC1_MPCBB6_SECCFGR0_SEC27		(0x1u<<27)
#define	GTZC1_MPCBB6_SECCFGR0_SEC26		(0x1u<<26)
#define	GTZC1_MPCBB6_SECCFGR0_SEC25		(0x1u<<25)
#define	GTZC1_MPCBB6_SECCFGR0_SEC24		(0x1u<<24)
#define	GTZC1_MPCBB6_SECCFGR0_SEC23		(0x1u<<23)
#define	GTZC1_MPCBB6_SECCFGR0_SEC22		(0x1u<<22)
#define	GTZC1_MPCBB6_SECCFGR0_SEC21		(0x1u<<21)
#define	GTZC1_MPCBB6_SECCFGR0_SEC20		(0x1u<<20)
#define	GTZC1_MPCBB6_SECCFGR0_SEC19		(0x1u<<19)
#define	GTZC1_MPCBB6_SECCFGR0_SEC18		(0x1u<<18)
#define	GTZC1_MPCBB6_SECCFGR0_SEC17		(0x1u<<17)
#define	GTZC1_MPCBB6_SECCFGR0_SEC16		(0x1u<<16)
#define	GTZC1_MPCBB6_SECCFGR0_SEC15		(0x1u<<15)
#define	GTZC1_MPCBB6_SECCFGR0_SEC14		(0x1u<<14)
#define	GTZC1_MPCBB6_SECCFGR0_SEC13		(0x1u<<13)
#define	GTZC1_MPCBB6_SECCFGR0_SEC12		(0x1u<<12)
#define	GTZC1_MPCBB6_SECCFGR0_SEC11		(0x1u<<11)
#define	GTZC1_MPCBB6_SECCFGR0_SEC10		(0x1u<<10)
#define	GTZC1_MPCBB6_SECCFGR0_SEC9		(0x1u<<9)
#define	GTZC1_MPCBB6_SECCFGR0_SEC8		(0x1u<<8)
#define	GTZC1_MPCBB6_SECCFGR0_SEC7		(0x1u<<7)
#define	GTZC1_MPCBB6_SECCFGR0_SEC6		(0x1u<<6)
#define	GTZC1_MPCBB6_SECCFGR0_SEC5		(0x1u<<5)
#define	GTZC1_MPCBB6_SECCFGR0_SEC4		(0x1u<<4)
#define	GTZC1_MPCBB6_SECCFGR0_SEC3		(0x1u<<3)
#define	GTZC1_MPCBB6_SECCFGR0_SEC2		(0x1u<<2)
#define	GTZC1_MPCBB6_SECCFGR0_SEC1		(0x1u<<1)
#define	GTZC1_MPCBB6_SECCFGR0_SEC0		(0x1u<<0)

// SECCFGR1 Configuration

#define	GTZC1_MPCBB6_SECCFGR1_SEC31		(0x1u<<31)
#define	GTZC1_MPCBB6_SECCFGR1_SEC30		(0x1u<<30)
#define	GTZC1_MPCBB6_SECCFGR1_SEC29		(0x1u<<29)
#define	GTZC1_MPCBB6_SECCFGR1_SEC28		(0x1u<<28)
#define	GTZC1_MPCBB6_SECCFGR1_SEC27		(0x1u<<27)
#define	GTZC1_MPCBB6_SECCFGR1_SEC26		(0x1u<<26)
#define	GTZC1_MPCBB6_SECCFGR1_SEC25		(0x1u<<25)
#define	GTZC1_MPCBB6_SECCFGR1_SEC24		(0x1u<<24)
#define	GTZC1_MPCBB6_SECCFGR1_SEC23		(0x1u<<23)
#define	GTZC1_MPCBB6_SECCFGR1_SEC22		(0x1u<<22)
#define	GTZC1_MPCBB6_SECCFGR1_SEC21		(0x1u<<21)
#define	GTZC1_MPCBB6_SECCFGR1_SEC20		(0x1u<<20)
#define	GTZC1_MPCBB6_SECCFGR1_SEC19		(0x1u<<19)
#define	GTZC1_MPCBB6_SECCFGR1_SEC18		(0x1u<<18)
#define	GTZC1_MPCBB6_SECCFGR1_SEC17		(0x1u<<17)
#define	GTZC1_MPCBB6_SECCFGR1_SEC16		(0x1u<<16)
#define	GTZC1_MPCBB6_SECCFGR1_SEC15		(0x1u<<15)
#define	GTZC1_MPCBB6_SECCFGR1_SEC14		(0x1u<<14)
#define	GTZC1_MPCBB6_SECCFGR1_SEC13		(0x1u<<13)
#define	GTZC1_MPCBB6_SECCFGR1_SEC12		(0x1u<<12)
#define	GTZC1_MPCBB6_SECCFGR1_SEC11		(0x1u<<11)
#define	GTZC1_MPCBB6_SECCFGR1_SEC10		(0x1u<<10)
#define	GTZC1_MPCBB6_SECCFGR1_SEC9		(0x1u<<9)
#define	GTZC1_MPCBB6_SECCFGR1_SEC8		(0x1u<<8)
#define	GTZC1_MPCBB6_SECCFGR1_SEC7		(0x1u<<7)
#define	GTZC1_MPCBB6_SECCFGR1_SEC6		(0x1u<<6)
#define	GTZC1_MPCBB6_SECCFGR1_SEC5		(0x1u<<5)
#define	GTZC1_MPCBB6_SECCFGR1_SEC4		(0x1u<<4)
#define	GTZC1_MPCBB6_SECCFGR1_SEC3		(0x1u<<3)
#define	GTZC1_MPCBB6_SECCFGR1_SEC2		(0x1u<<2)
#define	GTZC1_MPCBB6_SECCFGR1_SEC1		(0x1u<<1)
#define	GTZC1_MPCBB6_SECCFGR1_SEC0		(0x1u<<0)

// SECCFGR2 Configuration

#define	GTZC1_MPCBB6_SECCFGR2_SEC31		(0x1u<<31)
#define	GTZC1_MPCBB6_SECCFGR2_SEC30		(0x1u<<30)
#define	GTZC1_MPCBB6_SECCFGR2_SEC29		(0x1u<<29)
#define	GTZC1_MPCBB6_SECCFGR2_SEC28		(0x1u<<28)
#define	GTZC1_MPCBB6_SECCFGR2_SEC27		(0x1u<<27)
#define	GTZC1_MPCBB6_SECCFGR2_SEC26		(0x1u<<26)
#define	GTZC1_MPCBB6_SECCFGR2_SEC25		(0x1u<<25)
#define	GTZC1_MPCBB6_SECCFGR2_SEC24		(0x1u<<24)
#define	GTZC1_MPCBB6_SECCFGR2_SEC23		(0x1u<<23)
#define	GTZC1_MPCBB6_SECCFGR2_SEC22		(0x1u<<22)
#define	GTZC1_MPCBB6_SECCFGR2_SEC21		(0x1u<<21)
#define	GTZC1_MPCBB6_SECCFGR2_SEC20		(0x1u<<20)
#define	GTZC1_MPCBB6_SECCFGR2_SEC19		(0x1u<<19)
#define	GTZC1_MPCBB6_SECCFGR2_SEC18		(0x1u<<18)
#define	GTZC1_MPCBB6_SECCFGR2_SEC17		(0x1u<<17)
#define	GTZC1_MPCBB6_SECCFGR2_SEC16		(0x1u<<16)
#define	GTZC1_MPCBB6_SECCFGR2_SEC15		(0x1u<<15)
#define	GTZC1_MPCBB6_SECCFGR2_SEC14		(0x1u<<14)
#define	GTZC1_MPCBB6_SECCFGR2_SEC13		(0x1u<<13)
#define	GTZC1_MPCBB6_SECCFGR2_SEC12		(0x1u<<12)
#define	GTZC1_MPCBB6_SECCFGR2_SEC11		(0x1u<<11)
#define	GTZC1_MPCBB6_SECCFGR2_SEC10		(0x1u<<10)
#define	GTZC1_MPCBB6_SECCFGR2_SEC9		(0x1u<<9)
#define	GTZC1_MPCBB6_SECCFGR2_SEC8		(0x1u<<8)
#define	GTZC1_MPCBB6_SECCFGR2_SEC7		(0x1u<<7)
#define	GTZC1_MPCBB6_SECCFGR2_SEC6		(0x1u<<6)
#define	GTZC1_MPCBB6_SECCFGR2_SEC5		(0x1u<<5)
#define	GTZC1_MPCBB6_SECCFGR2_SEC4		(0x1u<<4)
#define	GTZC1_MPCBB6_SECCFGR2_SEC3		(0x1u<<3)
#define	GTZC1_MPCBB6_SECCFGR2_SEC2		(0x1u<<2)
#define	GTZC1_MPCBB6_SECCFGR2_SEC1		(0x1u<<1)
#define	GTZC1_MPCBB6_SECCFGR2_SEC0		(0x1u<<0)

// SECCFGR3 Configuration

#define	GTZC1_MPCBB6_SECCFGR3_SEC31		(0x1u<<31)
#define	GTZC1_MPCBB6_SECCFGR3_SEC30		(0x1u<<30)
#define	GTZC1_MPCBB6_SECCFGR3_SEC29		(0x1u<<29)
#define	GTZC1_MPCBB6_SECCFGR3_SEC28		(0x1u<<28)
#define	GTZC1_MPCBB6_SECCFGR3_SEC27		(0x1u<<27)
#define	GTZC1_MPCBB6_SECCFGR3_SEC26		(0x1u<<26)
#define	GTZC1_MPCBB6_SECCFGR3_SEC25		(0x1u<<25)
#define	GTZC1_MPCBB6_SECCFGR3_SEC24		(0x1u<<24)
#define	GTZC1_MPCBB6_SECCFGR3_SEC23		(0x1u<<23)
#define	GTZC1_MPCBB6_SECCFGR3_SEC22		(0x1u<<22)
#define	GTZC1_MPCBB6_SECCFGR3_SEC21		(0x1u<<21)
#define	GTZC1_MPCBB6_SECCFGR3_SEC20		(0x1u<<20)
#define	GTZC1_MPCBB6_SECCFGR3_SEC19		(0x1u<<19)
#define	GTZC1_MPCBB6_SECCFGR3_SEC18		(0x1u<<18)
#define	GTZC1_MPCBB6_SECCFGR3_SEC17		(0x1u<<17)
#define	GTZC1_MPCBB6_SECCFGR3_SEC16		(0x1u<<16)
#define	GTZC1_MPCBB6_SECCFGR3_SEC15		(0x1u<<15)
#define	GTZC1_MPCBB6_SECCFGR3_SEC14		(0x1u<<14)
#define	GTZC1_MPCBB6_SECCFGR3_SEC13		(0x1u<<13)
#define	GTZC1_MPCBB6_SECCFGR3_SEC12		(0x1u<<12)
#define	GTZC1_MPCBB6_SECCFGR3_SEC11		(0x1u<<11)
#define	GTZC1_MPCBB6_SECCFGR3_SEC10		(0x1u<<10)
#define	GTZC1_MPCBB6_SECCFGR3_SEC9		(0x1u<<9)
#define	GTZC1_MPCBB6_SECCFGR3_SEC8		(0x1u<<8)
#define	GTZC1_MPCBB6_SECCFGR3_SEC7		(0x1u<<7)
#define	GTZC1_MPCBB6_SECCFGR3_SEC6		(0x1u<<6)
#define	GTZC1_MPCBB6_SECCFGR3_SEC5		(0x1u<<5)
#define	GTZC1_MPCBB6_SECCFGR3_SEC4		(0x1u<<4)
#define	GTZC1_MPCBB6_SECCFGR3_SEC3		(0x1u<<3)
#define	GTZC1_MPCBB6_SECCFGR3_SEC2		(0x1u<<2)
#define	GTZC1_MPCBB6_SECCFGR3_SEC1		(0x1u<<1)
#define	GTZC1_MPCBB6_SECCFGR3_SEC0		(0x1u<<0)

// SECCFGR4 Configuration

#define	GTZC1_MPCBB6_SECCFGR4_SEC31		(0x1u<<31)
#define	GTZC1_MPCBB6_SECCFGR4_SEC30		(0x1u<<30)
#define	GTZC1_MPCBB6_SECCFGR4_SEC29		(0x1u<<29)
#define	GTZC1_MPCBB6_SECCFGR4_SEC28		(0x1u<<28)
#define	GTZC1_MPCBB6_SECCFGR4_SEC27		(0x1u<<27)
#define	GTZC1_MPCBB6_SECCFGR4_SEC26		(0x1u<<26)
#define	GTZC1_MPCBB6_SECCFGR4_SEC25		(0x1u<<25)
#define	GTZC1_MPCBB6_SECCFGR4_SEC24		(0x1u<<24)
#define	GTZC1_MPCBB6_SECCFGR4_SEC23		(0x1u<<23)
#define	GTZC1_MPCBB6_SECCFGR4_SEC22		(0x1u<<22)
#define	GTZC1_MPCBB6_SECCFGR4_SEC21		(0x1u<<21)
#define	GTZC1_MPCBB6_SECCFGR4_SEC20		(0x1u<<20)
#define	GTZC1_MPCBB6_SECCFGR4_SEC19		(0x1u<<19)
#define	GTZC1_MPCBB6_SECCFGR4_SEC18		(0x1u<<18)
#define	GTZC1_MPCBB6_SECCFGR4_SEC17		(0x1u<<17)
#define	GTZC1_MPCBB6_SECCFGR4_SEC16		(0x1u<<16)
#define	GTZC1_MPCBB6_SECCFGR4_SEC15		(0x1u<<15)
#define	GTZC1_MPCBB6_SECCFGR4_SEC14		(0x1u<<14)
#define	GTZC1_MPCBB6_SECCFGR4_SEC13		(0x1u<<13)
#define	GTZC1_MPCBB6_SECCFGR4_SEC12		(0x1u<<12)
#define	GTZC1_MPCBB6_SECCFGR4_SEC11		(0x1u<<11)
#define	GTZC1_MPCBB6_SECCFGR4_SEC10		(0x1u<<10)
#define	GTZC1_MPCBB6_SECCFGR4_SEC9		(0x1u<<9)
#define	GTZC1_MPCBB6_SECCFGR4_SEC8		(0x1u<<8)
#define	GTZC1_MPCBB6_SECCFGR4_SEC7		(0x1u<<7)
#define	GTZC1_MPCBB6_SECCFGR4_SEC6		(0x1u<<6)
#define	GTZC1_MPCBB6_SECCFGR4_SEC5		(0x1u<<5)
#define	GTZC1_MPCBB6_SECCFGR4_SEC4		(0x1u<<4)
#define	GTZC1_MPCBB6_SECCFGR4_SEC3		(0x1u<<3)
#define	GTZC1_MPCBB6_SECCFGR4_SEC2		(0x1u<<2)
#define	GTZC1_MPCBB6_SECCFGR4_SEC1		(0x1u<<1)
#define	GTZC1_MPCBB6_SECCFGR4_SEC0		(0x1u<<0)

// SECCFGR5 Configuration

#define	GTZC1_MPCBB6_SECCFGR5_SEC31		(0x1u<<31)
#define	GTZC1_MPCBB6_SECCFGR5_SEC30		(0x1u<<30)
#define	GTZC1_MPCBB6_SECCFGR5_SEC29		(0x1u<<29)
#define	GTZC1_MPCBB6_SECCFGR5_SEC28		(0x1u<<28)
#define	GTZC1_MPCBB6_SECCFGR5_SEC27		(0x1u<<27)
#define	GTZC1_MPCBB6_SECCFGR5_SEC26		(0x1u<<26)
#define	GTZC1_MPCBB6_SECCFGR5_SEC25		(0x1u<<25)
#define	GTZC1_MPCBB6_SECCFGR5_SEC24		(0x1u<<24)
#define	GTZC1_MPCBB6_SECCFGR5_SEC23		(0x1u<<23)
#define	GTZC1_MPCBB6_SECCFGR5_SEC22		(0x1u<<22)
#define	GTZC1_MPCBB6_SECCFGR5_SEC21		(0x1u<<21)
#define	GTZC1_MPCBB6_SECCFGR5_SEC20		(0x1u<<20)
#define	GTZC1_MPCBB6_SECCFGR5_SEC19		(0x1u<<19)
#define	GTZC1_MPCBB6_SECCFGR5_SEC18		(0x1u<<18)
#define	GTZC1_MPCBB6_SECCFGR5_SEC17		(0x1u<<17)
#define	GTZC1_MPCBB6_SECCFGR5_SEC16		(0x1u<<16)
#define	GTZC1_MPCBB6_SECCFGR5_SEC15		(0x1u<<15)
#define	GTZC1_MPCBB6_SECCFGR5_SEC14		(0x1u<<14)
#define	GTZC1_MPCBB6_SECCFGR5_SEC13		(0x1u<<13)
#define	GTZC1_MPCBB6_SECCFGR5_SEC12		(0x1u<<12)
#define	GTZC1_MPCBB6_SECCFGR5_SEC11		(0x1u<<11)
#define	GTZC1_MPCBB6_SECCFGR5_SEC10		(0x1u<<10)
#define	GTZC1_MPCBB6_SECCFGR5_SEC9		(0x1u<<9)
#define	GTZC1_MPCBB6_SECCFGR5_SEC8		(0x1u<<8)
#define	GTZC1_MPCBB6_SECCFGR5_SEC7		(0x1u<<7)
#define	GTZC1_MPCBB6_SECCFGR5_SEC6		(0x1u<<6)
#define	GTZC1_MPCBB6_SECCFGR5_SEC5		(0x1u<<5)
#define	GTZC1_MPCBB6_SECCFGR5_SEC4		(0x1u<<4)
#define	GTZC1_MPCBB6_SECCFGR5_SEC3		(0x1u<<3)
#define	GTZC1_MPCBB6_SECCFGR5_SEC2		(0x1u<<2)
#define	GTZC1_MPCBB6_SECCFGR5_SEC1		(0x1u<<1)
#define	GTZC1_MPCBB6_SECCFGR5_SEC0		(0x1u<<0)

// SECCFGR6 Configuration

#define	GTZC1_MPCBB6_SECCFGR6_SEC31		(0x1u<<31)
#define	GTZC1_MPCBB6_SECCFGR6_SEC30		(0x1u<<30)
#define	GTZC1_MPCBB6_SECCFGR6_SEC29		(0x1u<<29)
#define	GTZC1_MPCBB6_SECCFGR6_SEC28		(0x1u<<28)
#define	GTZC1_MPCBB6_SECCFGR6_SEC27		(0x1u<<27)
#define	GTZC1_MPCBB6_SECCFGR6_SEC26		(0x1u<<26)
#define	GTZC1_MPCBB6_SECCFGR6_SEC25		(0x1u<<25)
#define	GTZC1_MPCBB6_SECCFGR6_SEC24		(0x1u<<24)
#define	GTZC1_MPCBB6_SECCFGR6_SEC23		(0x1u<<23)
#define	GTZC1_MPCBB6_SECCFGR6_SEC22		(0x1u<<22)
#define	GTZC1_MPCBB6_SECCFGR6_SEC21		(0x1u<<21)
#define	GTZC1_MPCBB6_SECCFGR6_SEC20		(0x1u<<20)
#define	GTZC1_MPCBB6_SECCFGR6_SEC19		(0x1u<<19)
#define	GTZC1_MPCBB6_SECCFGR6_SEC18		(0x1u<<18)
#define	GTZC1_MPCBB6_SECCFGR6_SEC17		(0x1u<<17)
#define	GTZC1_MPCBB6_SECCFGR6_SEC16		(0x1u<<16)
#define	GTZC1_MPCBB6_SECCFGR6_SEC15		(0x1u<<15)
#define	GTZC1_MPCBB6_SECCFGR6_SEC14		(0x1u<<14)
#define	GTZC1_MPCBB6_SECCFGR6_SEC13		(0x1u<<13)
#define	GTZC1_MPCBB6_SECCFGR6_SEC12		(0x1u<<12)
#define	GTZC1_MPCBB6_SECCFGR6_SEC11		(0x1u<<11)
#define	GTZC1_MPCBB6_SECCFGR6_SEC10		(0x1u<<10)
#define	GTZC1_MPCBB6_SECCFGR6_SEC9		(0x1u<<9)
#define	GTZC1_MPCBB6_SECCFGR6_SEC8		(0x1u<<8)
#define	GTZC1_MPCBB6_SECCFGR6_SEC7		(0x1u<<7)
#define	GTZC1_MPCBB6_SECCFGR6_SEC6		(0x1u<<6)
#define	GTZC1_MPCBB6_SECCFGR6_SEC5		(0x1u<<5)
#define	GTZC1_MPCBB6_SECCFGR6_SEC4		(0x1u<<4)
#define	GTZC1_MPCBB6_SECCFGR6_SEC3		(0x1u<<3)
#define	GTZC1_MPCBB6_SECCFGR6_SEC2		(0x1u<<2)
#define	GTZC1_MPCBB6_SECCFGR6_SEC1		(0x1u<<1)
#define	GTZC1_MPCBB6_SECCFGR6_SEC0		(0x1u<<0)

// SECCFGR7 Configuration

#define	GTZC1_MPCBB6_SECCFGR7_SEC31		(0x1u<<31)
#define	GTZC1_MPCBB6_SECCFGR7_SEC30		(0x1u<<30)
#define	GTZC1_MPCBB6_SECCFGR7_SEC29		(0x1u<<29)
#define	GTZC1_MPCBB6_SECCFGR7_SEC28		(0x1u<<28)
#define	GTZC1_MPCBB6_SECCFGR7_SEC27		(0x1u<<27)
#define	GTZC1_MPCBB6_SECCFGR7_SEC26		(0x1u<<26)
#define	GTZC1_MPCBB6_SECCFGR7_SEC25		(0x1u<<25)
#define	GTZC1_MPCBB6_SECCFGR7_SEC24		(0x1u<<24)
#define	GTZC1_MPCBB6_SECCFGR7_SEC23		(0x1u<<23)
#define	GTZC1_MPCBB6_SECCFGR7_SEC22		(0x1u<<22)
#define	GTZC1_MPCBB6_SECCFGR7_SEC21		(0x1u<<21)
#define	GTZC1_MPCBB6_SECCFGR7_SEC20		(0x1u<<20)
#define	GTZC1_MPCBB6_SECCFGR7_SEC19		(0x1u<<19)
#define	GTZC1_MPCBB6_SECCFGR7_SEC18		(0x1u<<18)
#define	GTZC1_MPCBB6_SECCFGR7_SEC17		(0x1u<<17)
#define	GTZC1_MPCBB6_SECCFGR7_SEC16		(0x1u<<16)
#define	GTZC1_MPCBB6_SECCFGR7_SEC15		(0x1u<<15)
#define	GTZC1_MPCBB6_SECCFGR7_SEC14		(0x1u<<14)
#define	GTZC1_MPCBB6_SECCFGR7_SEC13		(0x1u<<13)
#define	GTZC1_MPCBB6_SECCFGR7_SEC12		(0x1u<<12)
#define	GTZC1_MPCBB6_SECCFGR7_SEC11		(0x1u<<11)
#define	GTZC1_MPCBB6_SECCFGR7_SEC10		(0x1u<<10)
#define	GTZC1_MPCBB6_SECCFGR7_SEC9		(0x1u<<9)
#define	GTZC1_MPCBB6_SECCFGR7_SEC8		(0x1u<<8)
#define	GTZC1_MPCBB6_SECCFGR7_SEC7		(0x1u<<7)
#define	GTZC1_MPCBB6_SECCFGR7_SEC6		(0x1u<<6)
#define	GTZC1_MPCBB6_SECCFGR7_SEC5		(0x1u<<5)
#define	GTZC1_MPCBB6_SECCFGR7_SEC4		(0x1u<<4)
#define	GTZC1_MPCBB6_SECCFGR7_SEC3		(0x1u<<3)
#define	GTZC1_MPCBB6_SECCFGR7_SEC2		(0x1u<<2)
#define	GTZC1_MPCBB6_SECCFGR7_SEC1		(0x1u<<1)
#define	GTZC1_MPCBB6_SECCFGR7_SEC0		(0x1u<<0)

// SECCFGR8 Configuration

