Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32U5G9/Includes/Registers/stm32U5Gx_gtzc1_mpcbb6.h
#define	GTZC1_MPCBB6_SECCFGR8_SEC31		(0x1u<<31)
#define	GTZC1_MPCBB6_SECCFGR8_SEC30		(0x1u<<30)
#define	GTZC1_MPCBB6_SECCFGR8_SEC29		(0x1u<<29)
#define	GTZC1_MPCBB6_SECCFGR8_SEC28		(0x1u<<28)
#define	GTZC1_MPCBB6_SECCFGR8_SEC27		(0x1u<<27)
#define	GTZC1_MPCBB6_SECCFGR8_SEC26		(0x1u<<26)
#define	GTZC1_MPCBB6_SECCFGR8_SEC25		(0x1u<<25)
#define	GTZC1_MPCBB6_SECCFGR8_SEC24		(0x1u<<24)
#define	GTZC1_MPCBB6_SECCFGR8_SEC23		(0x1u<<23)
#define	GTZC1_MPCBB6_SECCFGR8_SEC22		(0x1u<<22)
#define	GTZC1_MPCBB6_SECCFGR8_SEC21		(0x1u<<21)
#define	GTZC1_MPCBB6_SECCFGR8_SEC20		(0x1u<<20)
#define	GTZC1_MPCBB6_SECCFGR8_SEC19		(0x1u<<19)
#define	GTZC1_MPCBB6_SECCFGR8_SEC18		(0x1u<<18)
#define	GTZC1_MPCBB6_SECCFGR8_SEC17		(0x1u<<17)
#define	GTZC1_MPCBB6_SECCFGR8_SEC16		(0x1u<<16)
#define	GTZC1_MPCBB6_SECCFGR8_SEC15		(0x1u<<15)
#define	GTZC1_MPCBB6_SECCFGR8_SEC14		(0x1u<<14)
#define	GTZC1_MPCBB6_SECCFGR8_SEC13		(0x1u<<13)
#define	GTZC1_MPCBB6_SECCFGR8_SEC12		(0x1u<<12)
#define	GTZC1_MPCBB6_SECCFGR8_SEC11		(0x1u<<11)
#define	GTZC1_MPCBB6_SECCFGR8_SEC10		(0x1u<<10)
#define	GTZC1_MPCBB6_SECCFGR8_SEC9		(0x1u<<9)
#define	GTZC1_MPCBB6_SECCFGR8_SEC8		(0x1u<<8)
#define	GTZC1_MPCBB6_SECCFGR8_SEC7		(0x1u<<7)
#define	GTZC1_MPCBB6_SECCFGR8_SEC6		(0x1u<<6)
#define	GTZC1_MPCBB6_SECCFGR8_SEC5		(0x1u<<5)
#define	GTZC1_MPCBB6_SECCFGR8_SEC4		(0x1u<<4)
#define	GTZC1_MPCBB6_SECCFGR8_SEC3		(0x1u<<3)
#define	GTZC1_MPCBB6_SECCFGR8_SEC2		(0x1u<<2)
#define	GTZC1_MPCBB6_SECCFGR8_SEC1		(0x1u<<1)
#define	GTZC1_MPCBB6_SECCFGR8_SEC0		(0x1u<<0)

// SECCFGR9 Configuration

#define	GTZC1_MPCBB6_SECCFGR9_SEC31		(0x1u<<31)
#define	GTZC1_MPCBB6_SECCFGR9_SEC30		(0x1u<<30)
#define	GTZC1_MPCBB6_SECCFGR9_SEC29		(0x1u<<29)
#define	GTZC1_MPCBB6_SECCFGR9_SEC28		(0x1u<<28)
#define	GTZC1_MPCBB6_SECCFGR9_SEC27		(0x1u<<27)
#define	GTZC1_MPCBB6_SECCFGR9_SEC26		(0x1u<<26)
#define	GTZC1_MPCBB6_SECCFGR9_SEC25		(0x1u<<25)
#define	GTZC1_MPCBB6_SECCFGR9_SEC24		(0x1u<<24)
#define	GTZC1_MPCBB6_SECCFGR9_SEC23		(0x1u<<23)
#define	GTZC1_MPCBB6_SECCFGR9_SEC22		(0x1u<<22)
#define	GTZC1_MPCBB6_SECCFGR9_SEC21		(0x1u<<21)
#define	GTZC1_MPCBB6_SECCFGR9_SEC20		(0x1u<<20)
#define	GTZC1_MPCBB6_SECCFGR9_SEC19		(0x1u<<19)
#define	GTZC1_MPCBB6_SECCFGR9_SEC18		(0x1u<<18)
#define	GTZC1_MPCBB6_SECCFGR9_SEC17		(0x1u<<17)
#define	GTZC1_MPCBB6_SECCFGR9_SEC16		(0x1u<<16)
#define	GTZC1_MPCBB6_SECCFGR9_SEC15		(0x1u<<15)
#define	GTZC1_MPCBB6_SECCFGR9_SEC14		(0x1u<<14)
#define	GTZC1_MPCBB6_SECCFGR9_SEC13		(0x1u<<13)
#define	GTZC1_MPCBB6_SECCFGR9_SEC12		(0x1u<<12)
#define	GTZC1_MPCBB6_SECCFGR9_SEC11		(0x1u<<11)
#define	GTZC1_MPCBB6_SECCFGR9_SEC10		(0x1u<<10)
#define	GTZC1_MPCBB6_SECCFGR9_SEC9		(0x1u<<9)
#define	GTZC1_MPCBB6_SECCFGR9_SEC8		(0x1u<<8)
#define	GTZC1_MPCBB6_SECCFGR9_SEC7		(0x1u<<7)
#define	GTZC1_MPCBB6_SECCFGR9_SEC6		(0x1u<<6)
#define	GTZC1_MPCBB6_SECCFGR9_SEC5		(0x1u<<5)
#define	GTZC1_MPCBB6_SECCFGR9_SEC4		(0x1u<<4)
#define	GTZC1_MPCBB6_SECCFGR9_SEC3		(0x1u<<3)
#define	GTZC1_MPCBB6_SECCFGR9_SEC2		(0x1u<<2)
#define	GTZC1_MPCBB6_SECCFGR9_SEC1		(0x1u<<1)
#define	GTZC1_MPCBB6_SECCFGR9_SEC0		(0x1u<<0)

// SECCFGR10 Configuration

#define	GTZC1_MPCBB6_SECCFGR10_SEC31	(0x1u<<31)
#define	GTZC1_MPCBB6_SECCFGR10_SEC30	(0x1u<<30)
#define	GTZC1_MPCBB6_SECCFGR10_SEC29	(0x1u<<29)
#define	GTZC1_MPCBB6_SECCFGR10_SEC28	(0x1u<<28)
#define	GTZC1_MPCBB6_SECCFGR10_SEC27	(0x1u<<27)
#define	GTZC1_MPCBB6_SECCFGR10_SEC26	(0x1u<<26)
#define	GTZC1_MPCBB6_SECCFGR10_SEC25	(0x1u<<25)
#define	GTZC1_MPCBB6_SECCFGR10_SEC24	(0x1u<<24)
#define	GTZC1_MPCBB6_SECCFGR10_SEC23	(0x1u<<23)
#define	GTZC1_MPCBB6_SECCFGR10_SEC22	(0x1u<<22)
#define	GTZC1_MPCBB6_SECCFGR10_SEC21	(0x1u<<21)
#define	GTZC1_MPCBB6_SECCFGR10_SEC20	(0x1u<<20)
#define	GTZC1_MPCBB6_SECCFGR10_SEC19	(0x1u<<19)
#define	GTZC1_MPCBB6_SECCFGR10_SEC18	(0x1u<<18)
#define	GTZC1_MPCBB6_SECCFGR10_SEC17	(0x1u<<17)
#define	GTZC1_MPCBB6_SECCFGR10_SEC16	(0x1u<<16)
#define	GTZC1_MPCBB6_SECCFGR10_SEC15	(0x1u<<15)
#define	GTZC1_MPCBB6_SECCFGR10_SEC14	(0x1u<<14)
#define	GTZC1_MPCBB6_SECCFGR10_SEC13	(0x1u<<13)
#define	GTZC1_MPCBB6_SECCFGR10_SEC12	(0x1u<<12)
#define	GTZC1_MPCBB6_SECCFGR10_SEC11	(0x1u<<11)
#define	GTZC1_MPCBB6_SECCFGR10_SEC10	(0x1u<<10)
#define	GTZC1_MPCBB6_SECCFGR10_SEC9		(0x1u<<9)
#define	GTZC1_MPCBB6_SECCFGR10_SEC8		(0x1u<<8)
#define	GTZC1_MPCBB6_SECCFGR10_SEC7		(0x1u<<7)
#define	GTZC1_MPCBB6_SECCFGR10_SEC6		(0x1u<<6)
#define	GTZC1_MPCBB6_SECCFGR10_SEC5		(0x1u<<5)
#define	GTZC1_MPCBB6_SECCFGR10_SEC4		(0x1u<<4)
#define	GTZC1_MPCBB6_SECCFGR10_SEC3		(0x1u<<3)
#define	GTZC1_MPCBB6_SECCFGR10_SEC2		(0x1u<<2)
#define	GTZC1_MPCBB6_SECCFGR10_SEC1		(0x1u<<1)
#define	GTZC1_MPCBB6_SECCFGR10_SEC0		(0x1u<<0)

// SECCFGR11 Configuration

#define	GTZC1_MPCBB6_SECCFGR11_SEC31	(0x1u<<31)
#define	GTZC1_MPCBB6_SECCFGR11_SEC30	(0x1u<<30)
#define	GTZC1_MPCBB6_SECCFGR11_SEC29	(0x1u<<29)
#define	GTZC1_MPCBB6_SECCFGR11_SEC28	(0x1u<<28)
#define	GTZC1_MPCBB6_SECCFGR11_SEC27	(0x1u<<27)
#define	GTZC1_MPCBB6_SECCFGR11_SEC26	(0x1u<<26)
#define	GTZC1_MPCBB6_SECCFGR11_SEC25	(0x1u<<25)
#define	GTZC1_MPCBB6_SECCFGR11_SEC24	(0x1u<<24)
#define	GTZC1_MPCBB6_SECCFGR11_SEC23	(0x1u<<23)
#define	GTZC1_MPCBB6_SECCFGR11_SEC22	(0x1u<<22)
#define	GTZC1_MPCBB6_SECCFGR11_SEC21	(0x1u<<21)
#define	GTZC1_MPCBB6_SECCFGR11_SEC20	(0x1u<<20)
#define	GTZC1_MPCBB6_SECCFGR11_SEC19	(0x1u<<19)
#define	GTZC1_MPCBB6_SECCFGR11_SEC18	(0x1u<<18)
#define	GTZC1_MPCBB6_SECCFGR11_SEC17	(0x1u<<17)
#define	GTZC1_MPCBB6_SECCFGR11_SEC16	(0x1u<<16)
#define	GTZC1_MPCBB6_SECCFGR11_SEC15	(0x1u<<15)
#define	GTZC1_MPCBB6_SECCFGR11_SEC14	(0x1u<<14)
#define	GTZC1_MPCBB6_SECCFGR11_SEC13	(0x1u<<13)
#define	GTZC1_MPCBB6_SECCFGR11_SEC12	(0x1u<<12)
#define	GTZC1_MPCBB6_SECCFGR11_SEC11	(0x1u<<11)
#define	GTZC1_MPCBB6_SECCFGR11_SEC10	(0x1u<<10)
#define	GTZC1_MPCBB6_SECCFGR11_SEC9		(0x1u<<9)
#define	GTZC1_MPCBB6_SECCFGR11_SEC8		(0x1u<<8)
#define	GTZC1_MPCBB6_SECCFGR11_SEC7		(0x1u<<7)
#define	GTZC1_MPCBB6_SECCFGR11_SEC6		(0x1u<<6)
#define	GTZC1_MPCBB6_SECCFGR11_SEC5		(0x1u<<5)
#define	GTZC1_MPCBB6_SECCFGR11_SEC4		(0x1u<<4)
#define	GTZC1_MPCBB6_SECCFGR11_SEC3		(0x1u<<3)
#define	GTZC1_MPCBB6_SECCFGR11_SEC2		(0x1u<<2)
#define	GTZC1_MPCBB6_SECCFGR11_SEC1		(0x1u<<1)
#define	GTZC1_MPCBB6_SECCFGR11_SEC0		(0x1u<<0)

// SECCFGR12 Configuration

#define	GTZC1_MPCBB6_SECCFGR12_SEC31	(0x1u<<31)
#define	GTZC1_MPCBB6_SECCFGR12_SEC30	(0x1u<<30)
#define	GTZC1_MPCBB6_SECCFGR12_SEC29	(0x1u<<29)
#define	GTZC1_MPCBB6_SECCFGR12_SEC28	(0x1u<<28)
#define	GTZC1_MPCBB6_SECCFGR12_SEC27	(0x1u<<27)
#define	GTZC1_MPCBB6_SECCFGR12_SEC26	(0x1u<<26)
#define	GTZC1_MPCBB6_SECCFGR12_SEC25	(0x1u<<25)
#define	GTZC1_MPCBB6_SECCFGR12_SEC24	(0x1u<<24)
#define	GTZC1_MPCBB6_SECCFGR12_SEC23	(0x1u<<23)
#define	GTZC1_MPCBB6_SECCFGR12_SEC22	(0x1u<<22)
#define	GTZC1_MPCBB6_SECCFGR12_SEC21	(0x1u<<21)
#define	GTZC1_MPCBB6_SECCFGR12_SEC20	(0x1u<<20)
#define	GTZC1_MPCBB6_SECCFGR12_SEC19	(0x1u<<19)
#define	GTZC1_MPCBB6_SECCFGR12_SEC18	(0x1u<<18)
#define	GTZC1_MPCBB6_SECCFGR12_SEC17	(0x1u<<17)
#define	GTZC1_MPCBB6_SECCFGR12_SEC16	(0x1u<<16)
#define	GTZC1_MPCBB6_SECCFGR12_SEC15	(0x1u<<15)
#define	GTZC1_MPCBB6_SECCFGR12_SEC14	(0x1u<<14)
#define	GTZC1_MPCBB6_SECCFGR12_SEC13	(0x1u<<13)
#define	GTZC1_MPCBB6_SECCFGR12_SEC12	(0x1u<<12)
#define	GTZC1_MPCBB6_SECCFGR12_SEC11	(0x1u<<11)
#define	GTZC1_MPCBB6_SECCFGR12_SEC10	(0x1u<<10)
#define	GTZC1_MPCBB6_SECCFGR12_SEC9		(0x1u<<9)
#define	GTZC1_MPCBB6_SECCFGR12_SEC8		(0x1u<<8)
#define	GTZC1_MPCBB6_SECCFGR12_SEC7		(0x1u<<7)
#define	GTZC1_MPCBB6_SECCFGR12_SEC6		(0x1u<<6)
#define	GTZC1_MPCBB6_SECCFGR12_SEC5		(0x1u<<5)
#define	GTZC1_MPCBB6_SECCFGR12_SEC4		(0x1u<<4)
#define	GTZC1_MPCBB6_SECCFGR12_SEC3		(0x1u<<3)
#define	GTZC1_MPCBB6_SECCFGR12_SEC2		(0x1u<<2)
#define	GTZC1_MPCBB6_SECCFGR12_SEC1		(0x1u<<1)
#define	GTZC1_MPCBB6_SECCFGR12_SEC0		(0x1u<<0)

// SECCFGR13 Configuration

#define	GTZC1_MPCBB6_SECCFGR13_SEC31	(0x1u<<31)
#define	GTZC1_MPCBB6_SECCFGR13_SEC30	(0x1u<<30)
#define	GTZC1_MPCBB6_SECCFGR13_SEC29	(0x1u<<29)
#define	GTZC1_MPCBB6_SECCFGR13_SEC28	(0x1u<<28)
#define	GTZC1_MPCBB6_SECCFGR13_SEC27	(0x1u<<27)
#define	GTZC1_MPCBB6_SECCFGR13_SEC26	(0x1u<<26)
#define	GTZC1_MPCBB6_SECCFGR13_SEC25	(0x1u<<25)
#define	GTZC1_MPCBB6_SECCFGR13_SEC24	(0x1u<<24)
#define	GTZC1_MPCBB6_SECCFGR13_SEC23	(0x1u<<23)
#define	GTZC1_MPCBB6_SECCFGR13_SEC22	(0x1u<<22)
#define	GTZC1_MPCBB6_SECCFGR13_SEC21	(0x1u<<21)
#define	GTZC1_MPCBB6_SECCFGR13_SEC20	(0x1u<<20)
#define	GTZC1_MPCBB6_SECCFGR13_SEC19	(0x1u<<19)
#define	GTZC1_MPCBB6_SECCFGR13_SEC18	(0x1u<<18)
#define	GTZC1_MPCBB6_SECCFGR13_SEC17	(0x1u<<17)
#define	GTZC1_MPCBB6_SECCFGR13_SEC16	(0x1u<<16)
#define	GTZC1_MPCBB6_SECCFGR13_SEC15	(0x1u<<15)
#define	GTZC1_MPCBB6_SECCFGR13_SEC14	(0x1u<<14)
#define	GTZC1_MPCBB6_SECCFGR13_SEC13	(0x1u<<13)
#define	GTZC1_MPCBB6_SECCFGR13_SEC12	(0x1u<<12)
#define	GTZC1_MPCBB6_SECCFGR13_SEC11	(0x1u<<11)
#define	GTZC1_MPCBB6_SECCFGR13_SEC10	(0x1u<<10)
#define	GTZC1_MPCBB6_SECCFGR13_SEC9		(0x1u<<9)
#define	GTZC1_MPCBB6_SECCFGR13_SEC8		(0x1u<<8)
#define	GTZC1_MPCBB6_SECCFGR13_SEC7		(0x1u<<7)
#define	GTZC1_MPCBB6_SECCFGR13_SEC6		(0x1u<<6)
#define	GTZC1_MPCBB6_SECCFGR13_SEC5		(0x1u<<5)
#define	GTZC1_MPCBB6_SECCFGR13_SEC4		(0x1u<<4)
#define	GTZC1_MPCBB6_SECCFGR13_SEC3		(0x1u<<3)
#define	GTZC1_MPCBB6_SECCFGR13_SEC2		(0x1u<<2)
#define	GTZC1_MPCBB6_SECCFGR13_SEC1		(0x1u<<1)
#define	GTZC1_MPCBB6_SECCFGR13_SEC0		(0x1u<<0)

// SECCFGR14 Configuration

#define	GTZC1_MPCBB6_SECCFGR14_SEC31	(0x1u<<31)
#define	GTZC1_MPCBB6_SECCFGR14_SEC30	(0x1u<<30)
#define	GTZC1_MPCBB6_SECCFGR14_SEC29	(0x1u<<29)
#define	GTZC1_MPCBB6_SECCFGR14_SEC28	(0x1u<<28)
#define	GTZC1_MPCBB6_SECCFGR14_SEC27	(0x1u<<27)
#define	GTZC1_MPCBB6_SECCFGR14_SEC26	(0x1u<<26)
#define	GTZC1_MPCBB6_SECCFGR14_SEC25	(0x1u<<25)
#define	GTZC1_MPCBB6_SECCFGR14_SEC24	(0x1u<<24)
#define	GTZC1_MPCBB6_SECCFGR14_SEC23	(0x1u<<23)
#define	GTZC1_MPCBB6_SECCFGR14_SEC22	(0x1u<<22)
#define	GTZC1_MPCBB6_SECCFGR14_SEC21	(0x1u<<21)
#define	GTZC1_MPCBB6_SECCFGR14_SEC20	(0x1u<<20)
#define	GTZC1_MPCBB6_SECCFGR14_SEC19	(0x1u<<19)
#define	GTZC1_MPCBB6_SECCFGR14_SEC18	(0x1u<<18)
#define	GTZC1_MPCBB6_SECCFGR14_SEC17	(0x1u<<17)
#define	GTZC1_MPCBB6_SECCFGR14_SEC16	(0x1u<<16)
#define	GTZC1_MPCBB6_SECCFGR14_SEC15	(0x1u<<15)
#define	GTZC1_MPCBB6_SECCFGR14_SEC14	(0x1u<<14)
#define	GTZC1_MPCBB6_SECCFGR14_SEC13	(0x1u<<13)
#define	GTZC1_MPCBB6_SECCFGR14_SEC12	(0x1u<<12)
#define	GTZC1_MPCBB6_SECCFGR14_SEC11	(0x1u<<11)
#define	GTZC1_MPCBB6_SECCFGR14_SEC10	(0x1u<<10)
#define	GTZC1_MPCBB6_SECCFGR14_SEC9		(0x1u<<9)
#define	GTZC1_MPCBB6_SECCFGR14_SEC8		(0x1u<<8)
#define	GTZC1_MPCBB6_SECCFGR14_SEC7		(0x1u<<7)
#define	GTZC1_MPCBB6_SECCFGR14_SEC6		(0x1u<<6)
#define	GTZC1_MPCBB6_SECCFGR14_SEC5		(0x1u<<5)
#define	GTZC1_MPCBB6_SECCFGR14_SEC4		(0x1u<<4)
#define	GTZC1_MPCBB6_SECCFGR14_SEC3		(0x1u<<3)
#define	GTZC1_MPCBB6_SECCFGR14_SEC2		(0x1u<<2)
#define	GTZC1_MPCBB6_SECCFGR14_SEC1		(0x1u<<1)
#define	GTZC1_MPCBB6_SECCFGR14_SEC0		(0x1u<<0)

// SECCFGR15 Configuration

#define	GTZC1_MPCBB6_SECCFGR15_SEC31	(0x1u<<31)
#define	GTZC1_MPCBB6_SECCFGR15_SEC30	(0x1u<<30)
#define	GTZC1_MPCBB6_SECCFGR15_SEC29	(0x1u<<29)
#define	GTZC1_MPCBB6_SECCFGR15_SEC28	(0x1u<<28)
#define	GTZC1_MPCBB6_SECCFGR15_SEC27	(0x1u<<27)
#define	GTZC1_MPCBB6_SECCFGR15_SEC26	(0x1u<<26)
#define	GTZC1_MPCBB6_SECCFGR15_SEC25	(0x1u<<25)
#define	GTZC1_MPCBB6_SECCFGR15_SEC24	(0x1u<<24)
#define	GTZC1_MPCBB6_SECCFGR15_SEC23	(0x1u<<23)
#define	GTZC1_MPCBB6_SECCFGR15_SEC22	(0x1u<<22)
#define	GTZC1_MPCBB6_SECCFGR15_SEC21	(0x1u<<21)
#define	GTZC1_MPCBB6_SECCFGR15_SEC20	(0x1u<<20)
#define	GTZC1_MPCBB6_SECCFGR15_SEC19	(0x1u<<19)
#define	GTZC1_MPCBB6_SECCFGR15_SEC18	(0x1u<<18)
#define	GTZC1_MPCBB6_SECCFGR15_SEC17	(0x1u<<17)
#define	GTZC1_MPCBB6_SECCFGR15_SEC16	(0x1u<<16)
#define	GTZC1_MPCBB6_SECCFGR15_SEC15	(0x1u<<15)
#define	GTZC1_MPCBB6_SECCFGR15_SEC14	(0x1u<<14)
#define	GTZC1_MPCBB6_SECCFGR15_SEC13	(0x1u<<13)
#define	GTZC1_MPCBB6_SECCFGR15_SEC12	(0x1u<<12)
#define	GTZC1_MPCBB6_SECCFGR15_SEC11	(0x1u<<11)
#define	GTZC1_MPCBB6_SECCFGR15_SEC10	(0x1u<<10)
#define	GTZC1_MPCBB6_SECCFGR15_SEC9		(0x1u<<9)
#define	GTZC1_MPCBB6_SECCFGR15_SEC8		(0x1u<<8)
#define	GTZC1_MPCBB6_SECCFGR15_SEC7		(0x1u<<7)
#define	GTZC1_MPCBB6_SECCFGR15_SEC6		(0x1u<<6)
#define	GTZC1_MPCBB6_SECCFGR15_SEC5		(0x1u<<5)
#define	GTZC1_MPCBB6_SECCFGR15_SEC4		(0x1u<<4)
#define	GTZC1_MPCBB6_SECCFGR15_SEC3		(0x1u<<3)
#define	GTZC1_MPCBB6_SECCFGR15_SEC2		(0x1u<<2)
#define	GTZC1_MPCBB6_SECCFGR15_SEC1		(0x1u<<1)
#define	GTZC1_MPCBB6_SECCFGR15_SEC0		(0x1u<<0)

