Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32U5G9/Includes/Registers/stm32U5Gx_gtzc1_mpcbb6.h
#define	GTZC1_MPCBB6_SECCFGR26_SEC31	(0x1u<<31)
#define	GTZC1_MPCBB6_SECCFGR26_SEC30	(0x1u<<30)
#define	GTZC1_MPCBB6_SECCFGR26_SEC29	(0x1u<<29)
#define	GTZC1_MPCBB6_SECCFGR26_SEC28	(0x1u<<28)
#define	GTZC1_MPCBB6_SECCFGR26_SEC27	(0x1u<<27)
#define	GTZC1_MPCBB6_SECCFGR26_SEC26	(0x1u<<26)
#define	GTZC1_MPCBB6_SECCFGR26_SEC25	(0x1u<<25)
#define	GTZC1_MPCBB6_SECCFGR26_SEC24	(0x1u<<24)
#define	GTZC1_MPCBB6_SECCFGR26_SEC23	(0x1u<<23)
#define	GTZC1_MPCBB6_SECCFGR26_SEC22	(0x1u<<22)
#define	GTZC1_MPCBB6_SECCFGR26_SEC21	(0x1u<<21)
#define	GTZC1_MPCBB6_SECCFGR26_SEC20	(0x1u<<20)
#define	GTZC1_MPCBB6_SECCFGR26_SEC19	(0x1u<<19)
#define	GTZC1_MPCBB6_SECCFGR26_SEC18	(0x1u<<18)
#define	GTZC1_MPCBB6_SECCFGR26_SEC17	(0x1u<<17)
#define	GTZC1_MPCBB6_SECCFGR26_SEC16	(0x1u<<16)
#define	GTZC1_MPCBB6_SECCFGR26_SEC15	(0x1u<<15)
#define	GTZC1_MPCBB6_SECCFGR26_SEC14	(0x1u<<14)
#define	GTZC1_MPCBB6_SECCFGR26_SEC13	(0x1u<<13)
#define	GTZC1_MPCBB6_SECCFGR26_SEC12	(0x1u<<12)
#define	GTZC1_MPCBB6_SECCFGR26_SEC11	(0x1u<<11)
#define	GTZC1_MPCBB6_SECCFGR26_SEC10	(0x1u<<10)
#define	GTZC1_MPCBB6_SECCFGR26_SEC9		(0x1u<<9)
#define	GTZC1_MPCBB6_SECCFGR26_SEC8		(0x1u<<8)
#define	GTZC1_MPCBB6_SECCFGR26_SEC7		(0x1u<<7)
#define	GTZC1_MPCBB6_SECCFGR26_SEC6		(0x1u<<6)
#define	GTZC1_MPCBB6_SECCFGR26_SEC5		(0x1u<<5)
#define	GTZC1_MPCBB6_SECCFGR26_SEC4		(0x1u<<4)
#define	GTZC1_MPCBB6_SECCFGR26_SEC3		(0x1u<<3)
#define	GTZC1_MPCBB6_SECCFGR26_SEC2		(0x1u<<2)
#define	GTZC1_MPCBB6_SECCFGR26_SEC1		(0x1u<<1)
#define	GTZC1_MPCBB6_SECCFGR26_SEC0		(0x1u<<0)

// SECCFGR27 Configuration

#define	GTZC1_MPCBB6_SECCFGR27_SEC31	(0x1u<<31)
#define	GTZC1_MPCBB6_SECCFGR27_SEC30	(0x1u<<30)
#define	GTZC1_MPCBB6_SECCFGR27_SEC29	(0x1u<<29)
#define	GTZC1_MPCBB6_SECCFGR27_SEC28	(0x1u<<28)
#define	GTZC1_MPCBB6_SECCFGR27_SEC27	(0x1u<<27)
#define	GTZC1_MPCBB6_SECCFGR27_SEC26	(0x1u<<26)
#define	GTZC1_MPCBB6_SECCFGR27_SEC25	(0x1u<<25)
#define	GTZC1_MPCBB6_SECCFGR27_SEC24	(0x1u<<24)
#define	GTZC1_MPCBB6_SECCFGR27_SEC23	(0x1u<<23)
#define	GTZC1_MPCBB6_SECCFGR27_SEC22	(0x1u<<22)
#define	GTZC1_MPCBB6_SECCFGR27_SEC21	(0x1u<<21)
#define	GTZC1_MPCBB6_SECCFGR27_SEC20	(0x1u<<20)
#define	GTZC1_MPCBB6_SECCFGR27_SEC19	(0x1u<<19)
#define	GTZC1_MPCBB6_SECCFGR27_SEC18	(0x1u<<18)
#define	GTZC1_MPCBB6_SECCFGR27_SEC17	(0x1u<<17)
#define	GTZC1_MPCBB6_SECCFGR27_SEC16	(0x1u<<16)
#define	GTZC1_MPCBB6_SECCFGR27_SEC15	(0x1u<<15)
#define	GTZC1_MPCBB6_SECCFGR27_SEC14	(0x1u<<14)
#define	GTZC1_MPCBB6_SECCFGR27_SEC13	(0x1u<<13)
#define	GTZC1_MPCBB6_SECCFGR27_SEC12	(0x1u<<12)
#define	GTZC1_MPCBB6_SECCFGR27_SEC11	(0x1u<<11)
#define	GTZC1_MPCBB6_SECCFGR27_SEC10	(0x1u<<10)
#define	GTZC1_MPCBB6_SECCFGR27_SEC9		(0x1u<<9)
#define	GTZC1_MPCBB6_SECCFGR27_SEC8		(0x1u<<8)
#define	GTZC1_MPCBB6_SECCFGR27_SEC7		(0x1u<<7)
#define	GTZC1_MPCBB6_SECCFGR27_SEC6		(0x1u<<6)
#define	GTZC1_MPCBB6_SECCFGR27_SEC5		(0x1u<<5)
#define	GTZC1_MPCBB6_SECCFGR27_SEC4		(0x1u<<4)
#define	GTZC1_MPCBB6_SECCFGR27_SEC3		(0x1u<<3)
#define	GTZC1_MPCBB6_SECCFGR27_SEC2		(0x1u<<2)
#define	GTZC1_MPCBB6_SECCFGR27_SEC1		(0x1u<<1)
#define	GTZC1_MPCBB6_SECCFGR27_SEC0		(0x1u<<0)

// SECCFGR28 Configuration

#define	GTZC1_MPCBB6_SECCFGR28_SEC31	(0x1u<<31)
#define	GTZC1_MPCBB6_SECCFGR28_SEC30	(0x1u<<30)
#define	GTZC1_MPCBB6_SECCFGR28_SEC29	(0x1u<<29)
#define	GTZC1_MPCBB6_SECCFGR28_SEC28	(0x1u<<28)
#define	GTZC1_MPCBB6_SECCFGR28_SEC27	(0x1u<<27)
#define	GTZC1_MPCBB6_SECCFGR28_SEC26	(0x1u<<26)
#define	GTZC1_MPCBB6_SECCFGR28_SEC25	(0x1u<<25)
#define	GTZC1_MPCBB6_SECCFGR28_SEC24	(0x1u<<24)
#define	GTZC1_MPCBB6_SECCFGR28_SEC23	(0x1u<<23)
#define	GTZC1_MPCBB6_SECCFGR28_SEC22	(0x1u<<22)
#define	GTZC1_MPCBB6_SECCFGR28_SEC21	(0x1u<<21)
#define	GTZC1_MPCBB6_SECCFGR28_SEC20	(0x1u<<20)
#define	GTZC1_MPCBB6_SECCFGR28_SEC19	(0x1u<<19)
#define	GTZC1_MPCBB6_SECCFGR28_SEC18	(0x1u<<18)
#define	GTZC1_MPCBB6_SECCFGR28_SEC17	(0x1u<<17)
#define	GTZC1_MPCBB6_SECCFGR28_SEC16	(0x1u<<16)
#define	GTZC1_MPCBB6_SECCFGR28_SEC15	(0x1u<<15)
#define	GTZC1_MPCBB6_SECCFGR28_SEC14	(0x1u<<14)
#define	GTZC1_MPCBB6_SECCFGR28_SEC13	(0x1u<<13)
#define	GTZC1_MPCBB6_SECCFGR28_SEC12	(0x1u<<12)
#define	GTZC1_MPCBB6_SECCFGR28_SEC11	(0x1u<<11)
#define	GTZC1_MPCBB6_SECCFGR28_SEC10	(0x1u<<10)
#define	GTZC1_MPCBB6_SECCFGR28_SEC9		(0x1u<<9)
#define	GTZC1_MPCBB6_SECCFGR28_SEC8		(0x1u<<8)
#define	GTZC1_MPCBB6_SECCFGR28_SEC7		(0x1u<<7)
#define	GTZC1_MPCBB6_SECCFGR28_SEC6		(0x1u<<6)
#define	GTZC1_MPCBB6_SECCFGR28_SEC5		(0x1u<<5)
#define	GTZC1_MPCBB6_SECCFGR28_SEC4		(0x1u<<4)
#define	GTZC1_MPCBB6_SECCFGR28_SEC3		(0x1u<<3)
#define	GTZC1_MPCBB6_SECCFGR28_SEC2		(0x1u<<2)
#define	GTZC1_MPCBB6_SECCFGR28_SEC1		(0x1u<<1)
#define	GTZC1_MPCBB6_SECCFGR28_SEC0		(0x1u<<0)

// SECCFGR29 Configuration

#define	GTZC1_MPCBB6_SECCFGR29_SEC31	(0x1u<<31)
#define	GTZC1_MPCBB6_SECCFGR29_SEC30	(0x1u<<30)
#define	GTZC1_MPCBB6_SECCFGR29_SEC29	(0x1u<<29)
#define	GTZC1_MPCBB6_SECCFGR29_SEC28	(0x1u<<28)
#define	GTZC1_MPCBB6_SECCFGR29_SEC27	(0x1u<<27)
#define	GTZC1_MPCBB6_SECCFGR29_SEC26	(0x1u<<26)
#define	GTZC1_MPCBB6_SECCFGR29_SEC25	(0x1u<<25)
#define	GTZC1_MPCBB6_SECCFGR29_SEC24	(0x1u<<24)
#define	GTZC1_MPCBB6_SECCFGR29_SEC23	(0x1u<<23)
#define	GTZC1_MPCBB6_SECCFGR29_SEC22	(0x1u<<22)
#define	GTZC1_MPCBB6_SECCFGR29_SEC21	(0x1u<<21)
#define	GTZC1_MPCBB6_SECCFGR29_SEC20	(0x1u<<20)
#define	GTZC1_MPCBB6_SECCFGR29_SEC19	(0x1u<<19)
#define	GTZC1_MPCBB6_SECCFGR29_SEC18	(0x1u<<18)
#define	GTZC1_MPCBB6_SECCFGR29_SEC17	(0x1u<<17)
#define	GTZC1_MPCBB6_SECCFGR29_SEC16	(0x1u<<16)
#define	GTZC1_MPCBB6_SECCFGR29_SEC15	(0x1u<<15)
#define	GTZC1_MPCBB6_SECCFGR29_SEC14	(0x1u<<14)
#define	GTZC1_MPCBB6_SECCFGR29_SEC13	(0x1u<<13)
#define	GTZC1_MPCBB6_SECCFGR29_SEC12	(0x1u<<12)
#define	GTZC1_MPCBB6_SECCFGR29_SEC11	(0x1u<<11)
#define	GTZC1_MPCBB6_SECCFGR29_SEC10	(0x1u<<10)
#define	GTZC1_MPCBB6_SECCFGR29_SEC9		(0x1u<<9)
#define	GTZC1_MPCBB6_SECCFGR29_SEC8		(0x1u<<8)
#define	GTZC1_MPCBB6_SECCFGR29_SEC7		(0x1u<<7)
#define	GTZC1_MPCBB6_SECCFGR29_SEC6		(0x1u<<6)
#define	GTZC1_MPCBB6_SECCFGR29_SEC5		(0x1u<<5)
#define	GTZC1_MPCBB6_SECCFGR29_SEC4		(0x1u<<4)
#define	GTZC1_MPCBB6_SECCFGR29_SEC3		(0x1u<<3)
#define	GTZC1_MPCBB6_SECCFGR29_SEC2		(0x1u<<2)
#define	GTZC1_MPCBB6_SECCFGR29_SEC1		(0x1u<<1)
#define	GTZC1_MPCBB6_SECCFGR29_SEC0		(0x1u<<0)

// SECCFGR30 Configuration

#define	GTZC1_MPCBB6_SECCFGR30_SEC31	(0x1u<<31)
#define	GTZC1_MPCBB6_SECCFGR30_SEC30	(0x1u<<30)
#define	GTZC1_MPCBB6_SECCFGR30_SEC29	(0x1u<<29)
#define	GTZC1_MPCBB6_SECCFGR30_SEC28	(0x1u<<28)
#define	GTZC1_MPCBB6_SECCFGR30_SEC27	(0x1u<<27)
#define	GTZC1_MPCBB6_SECCFGR30_SEC26	(0x1u<<26)
#define	GTZC1_MPCBB6_SECCFGR30_SEC25	(0x1u<<25)
#define	GTZC1_MPCBB6_SECCFGR30_SEC24	(0x1u<<24)
#define	GTZC1_MPCBB6_SECCFGR30_SEC23	(0x1u<<23)
#define	GTZC1_MPCBB6_SECCFGR30_SEC22	(0x1u<<22)
#define	GTZC1_MPCBB6_SECCFGR30_SEC21	(0x1u<<21)
#define	GTZC1_MPCBB6_SECCFGR30_SEC20	(0x1u<<20)
#define	GTZC1_MPCBB6_SECCFGR30_SEC19	(0x1u<<19)
#define	GTZC1_MPCBB6_SECCFGR30_SEC18	(0x1u<<18)
#define	GTZC1_MPCBB6_SECCFGR30_SEC17	(0x1u<<17)
#define	GTZC1_MPCBB6_SECCFGR30_SEC16	(0x1u<<16)
#define	GTZC1_MPCBB6_SECCFGR30_SEC15	(0x1u<<15)
#define	GTZC1_MPCBB6_SECCFGR30_SEC14	(0x1u<<14)
#define	GTZC1_MPCBB6_SECCFGR30_SEC13	(0x1u<<13)
#define	GTZC1_MPCBB6_SECCFGR30_SEC12	(0x1u<<12)
#define	GTZC1_MPCBB6_SECCFGR30_SEC11	(0x1u<<11)
#define	GTZC1_MPCBB6_SECCFGR30_SEC10	(0x1u<<10)
#define	GTZC1_MPCBB6_SECCFGR30_SEC9		(0x1u<<9)
#define	GTZC1_MPCBB6_SECCFGR30_SEC8		(0x1u<<8)
#define	GTZC1_MPCBB6_SECCFGR30_SEC7		(0x1u<<7)
#define	GTZC1_MPCBB6_SECCFGR30_SEC6		(0x1u<<6)
#define	GTZC1_MPCBB6_SECCFGR30_SEC5		(0x1u<<5)
#define	GTZC1_MPCBB6_SECCFGR30_SEC4		(0x1u<<4)
#define	GTZC1_MPCBB6_SECCFGR30_SEC3		(0x1u<<3)
#define	GTZC1_MPCBB6_SECCFGR30_SEC2		(0x1u<<2)
#define	GTZC1_MPCBB6_SECCFGR30_SEC1		(0x1u<<1)
#define	GTZC1_MPCBB6_SECCFGR30_SEC0		(0x1u<<0)

// SECCFGR31 Configuration

