Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32U5G9/Includes/Registers/stm32U5Gx_gtzc1_mpcbb6.h
#define	GTZC1_MPCBB6_SECCFGR31_SEC31	(0x1u<<31)
#define	GTZC1_MPCBB6_SECCFGR31_SEC30	(0x1u<<30)
#define	GTZC1_MPCBB6_SECCFGR31_SEC29	(0x1u<<29)
#define	GTZC1_MPCBB6_SECCFGR31_SEC28	(0x1u<<28)
#define	GTZC1_MPCBB6_SECCFGR31_SEC27	(0x1u<<27)
#define	GTZC1_MPCBB6_SECCFGR31_SEC26	(0x1u<<26)
#define	GTZC1_MPCBB6_SECCFGR31_SEC25	(0x1u<<25)
#define	GTZC1_MPCBB6_SECCFGR31_SEC24	(0x1u<<24)
#define	GTZC1_MPCBB6_SECCFGR31_SEC23	(0x1u<<23)
#define	GTZC1_MPCBB6_SECCFGR31_SEC22	(0x1u<<22)
#define	GTZC1_MPCBB6_SECCFGR31_SEC21	(0x1u<<21)
#define	GTZC1_MPCBB6_SECCFGR31_SEC20	(0x1u<<20)
#define	GTZC1_MPCBB6_SECCFGR31_SEC19	(0x1u<<19)
#define	GTZC1_MPCBB6_SECCFGR31_SEC18	(0x1u<<18)
#define	GTZC1_MPCBB6_SECCFGR31_SEC17	(0x1u<<17)
#define	GTZC1_MPCBB6_SECCFGR31_SEC16	(0x1u<<16)
#define	GTZC1_MPCBB6_SECCFGR31_SEC15	(0x1u<<15)
#define	GTZC1_MPCBB6_SECCFGR31_SEC14	(0x1u<<14)
#define	GTZC1_MPCBB6_SECCFGR31_SEC13	(0x1u<<13)
#define	GTZC1_MPCBB6_SECCFGR31_SEC12	(0x1u<<12)
#define	GTZC1_MPCBB6_SECCFGR31_SEC11	(0x1u<<11)
#define	GTZC1_MPCBB6_SECCFGR31_SEC10	(0x1u<<10)
#define	GTZC1_MPCBB6_SECCFGR31_SEC9		(0x1u<<9)
#define	GTZC1_MPCBB6_SECCFGR31_SEC8		(0x1u<<8)
#define	GTZC1_MPCBB6_SECCFGR31_SEC7		(0x1u<<7)
#define	GTZC1_MPCBB6_SECCFGR31_SEC6		(0x1u<<6)
#define	GTZC1_MPCBB6_SECCFGR31_SEC5		(0x1u<<5)
#define	GTZC1_MPCBB6_SECCFGR31_SEC4		(0x1u<<4)
#define	GTZC1_MPCBB6_SECCFGR31_SEC3		(0x1u<<3)
#define	GTZC1_MPCBB6_SECCFGR31_SEC2		(0x1u<<2)
#define	GTZC1_MPCBB6_SECCFGR31_SEC1		(0x1u<<1)
#define	GTZC1_MPCBB6_SECCFGR31_SEC0		(0x1u<<0)

// SECCFGR32 Configuration

#define	GTZC1_MPCBB6_SECCFGR32_SEC31	(0x1u<<31)
#define	GTZC1_MPCBB6_SECCFGR32_SEC30	(0x1u<<30)
#define	GTZC1_MPCBB6_SECCFGR32_SEC29	(0x1u<<29)
#define	GTZC1_MPCBB6_SECCFGR32_SEC28	(0x1u<<28)
#define	GTZC1_MPCBB6_SECCFGR32_SEC27	(0x1u<<27)
#define	GTZC1_MPCBB6_SECCFGR32_SEC26	(0x1u<<26)
#define	GTZC1_MPCBB6_SECCFGR32_SEC25	(0x1u<<25)
#define	GTZC1_MPCBB6_SECCFGR32_SEC24	(0x1u<<24)
#define	GTZC1_MPCBB6_SECCFGR32_SEC23	(0x1u<<23)
#define	GTZC1_MPCBB6_SECCFGR32_SEC22	(0x1u<<22)
#define	GTZC1_MPCBB6_SECCFGR32_SEC21	(0x1u<<21)
#define	GTZC1_MPCBB6_SECCFGR32_SEC20	(0x1u<<20)
#define	GTZC1_MPCBB6_SECCFGR32_SEC19	(0x1u<<19)
#define	GTZC1_MPCBB6_SECCFGR32_SEC18	(0x1u<<18)
#define	GTZC1_MPCBB6_SECCFGR32_SEC17	(0x1u<<17)
#define	GTZC1_MPCBB6_SECCFGR32_SEC16	(0x1u<<16)
#define	GTZC1_MPCBB6_SECCFGR32_SEC15	(0x1u<<15)
#define	GTZC1_MPCBB6_SECCFGR32_SEC14	(0x1u<<14)
#define	GTZC1_MPCBB6_SECCFGR32_SEC13	(0x1u<<13)
#define	GTZC1_MPCBB6_SECCFGR32_SEC12	(0x1u<<12)
#define	GTZC1_MPCBB6_SECCFGR32_SEC11	(0x1u<<11)
#define	GTZC1_MPCBB6_SECCFGR32_SEC10	(0x1u<<10)
#define	GTZC1_MPCBB6_SECCFGR32_SEC9		(0x1u<<9)
#define	GTZC1_MPCBB6_SECCFGR32_SEC8		(0x1u<<8)
#define	GTZC1_MPCBB6_SECCFGR32_SEC7		(0x1u<<7)
#define	GTZC1_MPCBB6_SECCFGR32_SEC6		(0x1u<<6)
#define	GTZC1_MPCBB6_SECCFGR32_SEC5		(0x1u<<5)
#define	GTZC1_MPCBB6_SECCFGR32_SEC4		(0x1u<<4)
#define	GTZC1_MPCBB6_SECCFGR32_SEC3		(0x1u<<3)
#define	GTZC1_MPCBB6_SECCFGR32_SEC2		(0x1u<<2)
#define	GTZC1_MPCBB6_SECCFGR32_SEC1		(0x1u<<1)
#define	GTZC1_MPCBB6_SECCFGR32_SEC0		(0x1u<<0)

// SECCFGR33 Configuration

#define	GTZC1_MPCBB6_SECCFGR33_SEC31	(0x1u<<31)
#define	GTZC1_MPCBB6_SECCFGR33_SEC30	(0x1u<<30)
#define	GTZC1_MPCBB6_SECCFGR33_SEC29	(0x1u<<29)
#define	GTZC1_MPCBB6_SECCFGR33_SEC28	(0x1u<<28)
#define	GTZC1_MPCBB6_SECCFGR33_SEC27	(0x1u<<27)
#define	GTZC1_MPCBB6_SECCFGR33_SEC26	(0x1u<<26)
#define	GTZC1_MPCBB6_SECCFGR33_SEC25	(0x1u<<25)
#define	GTZC1_MPCBB6_SECCFGR33_SEC24	(0x1u<<24)
#define	GTZC1_MPCBB6_SECCFGR33_SEC23	(0x1u<<23)
#define	GTZC1_MPCBB6_SECCFGR33_SEC22	(0x1u<<22)
#define	GTZC1_MPCBB6_SECCFGR33_SEC21	(0x1u<<21)
#define	GTZC1_MPCBB6_SECCFGR33_SEC20	(0x1u<<20)
#define	GTZC1_MPCBB6_SECCFGR33_SEC19	(0x1u<<19)
#define	GTZC1_MPCBB6_SECCFGR33_SEC18	(0x1u<<18)
#define	GTZC1_MPCBB6_SECCFGR33_SEC17	(0x1u<<17)
#define	GTZC1_MPCBB6_SECCFGR33_SEC16	(0x1u<<16)
#define	GTZC1_MPCBB6_SECCFGR33_SEC15	(0x1u<<15)
#define	GTZC1_MPCBB6_SECCFGR33_SEC14	(0x1u<<14)
#define	GTZC1_MPCBB6_SECCFGR33_SEC13	(0x1u<<13)
#define	GTZC1_MPCBB6_SECCFGR33_SEC12	(0x1u<<12)
#define	GTZC1_MPCBB6_SECCFGR33_SEC11	(0x1u<<11)
#define	GTZC1_MPCBB6_SECCFGR33_SEC10	(0x1u<<10)
#define	GTZC1_MPCBB6_SECCFGR33_SEC9		(0x1u<<9)
#define	GTZC1_MPCBB6_SECCFGR33_SEC8		(0x1u<<8)
#define	GTZC1_MPCBB6_SECCFGR33_SEC7		(0x1u<<7)
#define	GTZC1_MPCBB6_SECCFGR33_SEC6		(0x1u<<6)
#define	GTZC1_MPCBB6_SECCFGR33_SEC5		(0x1u<<5)
#define	GTZC1_MPCBB6_SECCFGR33_SEC4		(0x1u<<4)
#define	GTZC1_MPCBB6_SECCFGR33_SEC3		(0x1u<<3)
#define	GTZC1_MPCBB6_SECCFGR33_SEC2		(0x1u<<2)
#define	GTZC1_MPCBB6_SECCFGR33_SEC1		(0x1u<<1)
#define	GTZC1_MPCBB6_SECCFGR33_SEC0		(0x1u<<0)

// SECCFGR34 Configuration

#define	GTZC1_MPCBB6_SECCFGR34_SEC31	(0x1u<<31)
#define	GTZC1_MPCBB6_SECCFGR34_SEC30	(0x1u<<30)
#define	GTZC1_MPCBB6_SECCFGR34_SEC29	(0x1u<<29)
#define	GTZC1_MPCBB6_SECCFGR34_SEC28	(0x1u<<28)
#define	GTZC1_MPCBB6_SECCFGR34_SEC27	(0x1u<<27)
#define	GTZC1_MPCBB6_SECCFGR34_SEC26	(0x1u<<26)
#define	GTZC1_MPCBB6_SECCFGR34_SEC25	(0x1u<<25)
#define	GTZC1_MPCBB6_SECCFGR34_SEC24	(0x1u<<24)
#define	GTZC1_MPCBB6_SECCFGR34_SEC23	(0x1u<<23)
#define	GTZC1_MPCBB6_SECCFGR34_SEC22	(0x1u<<22)
#define	GTZC1_MPCBB6_SECCFGR34_SEC21	(0x1u<<21)
#define	GTZC1_MPCBB6_SECCFGR34_SEC20	(0x1u<<20)
#define	GTZC1_MPCBB6_SECCFGR34_SEC19	(0x1u<<19)
#define	GTZC1_MPCBB6_SECCFGR34_SEC18	(0x1u<<18)
#define	GTZC1_MPCBB6_SECCFGR34_SEC17	(0x1u<<17)
#define	GTZC1_MPCBB6_SECCFGR34_SEC16	(0x1u<<16)
#define	GTZC1_MPCBB6_SECCFGR34_SEC15	(0x1u<<15)
#define	GTZC1_MPCBB6_SECCFGR34_SEC14	(0x1u<<14)
#define	GTZC1_MPCBB6_SECCFGR34_SEC13	(0x1u<<13)
#define	GTZC1_MPCBB6_SECCFGR34_SEC12	(0x1u<<12)
#define	GTZC1_MPCBB6_SECCFGR34_SEC11	(0x1u<<11)
#define	GTZC1_MPCBB6_SECCFGR34_SEC10	(0x1u<<10)
#define	GTZC1_MPCBB6_SECCFGR34_SEC9		(0x1u<<9)
#define	GTZC1_MPCBB6_SECCFGR34_SEC8		(0x1u<<8)
#define	GTZC1_MPCBB6_SECCFGR34_SEC7		(0x1u<<7)
#define	GTZC1_MPCBB6_SECCFGR34_SEC6		(0x1u<<6)
#define	GTZC1_MPCBB6_SECCFGR34_SEC5		(0x1u<<5)
#define	GTZC1_MPCBB6_SECCFGR34_SEC4		(0x1u<<4)
#define	GTZC1_MPCBB6_SECCFGR34_SEC3		(0x1u<<3)
#define	GTZC1_MPCBB6_SECCFGR34_SEC2		(0x1u<<2)
#define	GTZC1_MPCBB6_SECCFGR34_SEC1		(0x1u<<1)
#define	GTZC1_MPCBB6_SECCFGR34_SEC0		(0x1u<<0)

// SECCFGR35 Configuration

#define	GTZC1_MPCBB6_SECCFGR35_SEC31	(0x1u<<31)
#define	GTZC1_MPCBB6_SECCFGR35_SEC30	(0x1u<<30)
#define	GTZC1_MPCBB6_SECCFGR35_SEC29	(0x1u<<29)
#define	GTZC1_MPCBB6_SECCFGR35_SEC28	(0x1u<<28)
#define	GTZC1_MPCBB6_SECCFGR35_SEC27	(0x1u<<27)
#define	GTZC1_MPCBB6_SECCFGR35_SEC26	(0x1u<<26)
#define	GTZC1_MPCBB6_SECCFGR35_SEC25	(0x1u<<25)
#define	GTZC1_MPCBB6_SECCFGR35_SEC24	(0x1u<<24)
#define	GTZC1_MPCBB6_SECCFGR35_SEC23	(0x1u<<23)
#define	GTZC1_MPCBB6_SECCFGR35_SEC22	(0x1u<<22)
#define	GTZC1_MPCBB6_SECCFGR35_SEC21	(0x1u<<21)
#define	GTZC1_MPCBB6_SECCFGR35_SEC20	(0x1u<<20)
#define	GTZC1_MPCBB6_SECCFGR35_SEC19	(0x1u<<19)
#define	GTZC1_MPCBB6_SECCFGR35_SEC18	(0x1u<<18)
#define	GTZC1_MPCBB6_SECCFGR35_SEC17	(0x1u<<17)
#define	GTZC1_MPCBB6_SECCFGR35_SEC16	(0x1u<<16)
#define	GTZC1_MPCBB6_SECCFGR35_SEC15	(0x1u<<15)
#define	GTZC1_MPCBB6_SECCFGR35_SEC14	(0x1u<<14)
#define	GTZC1_MPCBB6_SECCFGR35_SEC13	(0x1u<<13)
#define	GTZC1_MPCBB6_SECCFGR35_SEC12	(0x1u<<12)
#define	GTZC1_MPCBB6_SECCFGR35_SEC11	(0x1u<<11)
#define	GTZC1_MPCBB6_SECCFGR35_SEC10	(0x1u<<10)
#define	GTZC1_MPCBB6_SECCFGR35_SEC9		(0x1u<<9)
#define	GTZC1_MPCBB6_SECCFGR35_SEC8		(0x1u<<8)
#define	GTZC1_MPCBB6_SECCFGR35_SEC7		(0x1u<<7)
#define	GTZC1_MPCBB6_SECCFGR35_SEC6		(0x1u<<6)
#define	GTZC1_MPCBB6_SECCFGR35_SEC5		(0x1u<<5)
#define	GTZC1_MPCBB6_SECCFGR35_SEC4		(0x1u<<4)
#define	GTZC1_MPCBB6_SECCFGR35_SEC3		(0x1u<<3)
#define	GTZC1_MPCBB6_SECCFGR35_SEC2		(0x1u<<2)
#define	GTZC1_MPCBB6_SECCFGR35_SEC1		(0x1u<<1)
#define	GTZC1_MPCBB6_SECCFGR35_SEC0		(0x1u<<0)

// SECCFGR36 Configuration

