Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32U5G9/Includes/Registers/stm32U5Gx_gtzc1_mpcbb6.h
#define	GTZC1_MPCBB6_SECCFGR36_SEC31	(0x1u<<31)
#define	GTZC1_MPCBB6_SECCFGR36_SEC30	(0x1u<<30)
#define	GTZC1_MPCBB6_SECCFGR36_SEC29	(0x1u<<29)
#define	GTZC1_MPCBB6_SECCFGR36_SEC28	(0x1u<<28)
#define	GTZC1_MPCBB6_SECCFGR36_SEC27	(0x1u<<27)
#define	GTZC1_MPCBB6_SECCFGR36_SEC26	(0x1u<<26)
#define	GTZC1_MPCBB6_SECCFGR36_SEC25	(0x1u<<25)
#define	GTZC1_MPCBB6_SECCFGR36_SEC24	(0x1u<<24)
#define	GTZC1_MPCBB6_SECCFGR36_SEC23	(0x1u<<23)
#define	GTZC1_MPCBB6_SECCFGR36_SEC22	(0x1u<<22)
#define	GTZC1_MPCBB6_SECCFGR36_SEC21	(0x1u<<21)
#define	GTZC1_MPCBB6_SECCFGR36_SEC20	(0x1u<<20)
#define	GTZC1_MPCBB6_SECCFGR36_SEC19	(0x1u<<19)
#define	GTZC1_MPCBB6_SECCFGR36_SEC18	(0x1u<<18)
#define	GTZC1_MPCBB6_SECCFGR36_SEC17	(0x1u<<17)
#define	GTZC1_MPCBB6_SECCFGR36_SEC16	(0x1u<<16)
#define	GTZC1_MPCBB6_SECCFGR36_SEC15	(0x1u<<15)
#define	GTZC1_MPCBB6_SECCFGR36_SEC14	(0x1u<<14)
#define	GTZC1_MPCBB6_SECCFGR36_SEC13	(0x1u<<13)
#define	GTZC1_MPCBB6_SECCFGR36_SEC12	(0x1u<<12)
#define	GTZC1_MPCBB6_SECCFGR36_SEC11	(0x1u<<11)
#define	GTZC1_MPCBB6_SECCFGR36_SEC10	(0x1u<<10)
#define	GTZC1_MPCBB6_SECCFGR36_SEC9		(0x1u<<9)
#define	GTZC1_MPCBB6_SECCFGR36_SEC8		(0x1u<<8)
#define	GTZC1_MPCBB6_SECCFGR36_SEC7		(0x1u<<7)
#define	GTZC1_MPCBB6_SECCFGR36_SEC6		(0x1u<<6)
#define	GTZC1_MPCBB6_SECCFGR36_SEC5		(0x1u<<5)
#define	GTZC1_MPCBB6_SECCFGR36_SEC4		(0x1u<<4)
#define	GTZC1_MPCBB6_SECCFGR36_SEC3		(0x1u<<3)
#define	GTZC1_MPCBB6_SECCFGR36_SEC2		(0x1u<<2)
#define	GTZC1_MPCBB6_SECCFGR36_SEC1		(0x1u<<1)
#define	GTZC1_MPCBB6_SECCFGR36_SEC0		(0x1u<<0)

// SECCFGR37 Configuration

#define	GTZC1_MPCBB6_SECCFGR37_SEC31	(0x1u<<31)
#define	GTZC1_MPCBB6_SECCFGR37_SEC30	(0x1u<<30)
#define	GTZC1_MPCBB6_SECCFGR37_SEC29	(0x1u<<29)
#define	GTZC1_MPCBB6_SECCFGR37_SEC28	(0x1u<<28)
#define	GTZC1_MPCBB6_SECCFGR37_SEC27	(0x1u<<27)
#define	GTZC1_MPCBB6_SECCFGR37_SEC26	(0x1u<<26)
#define	GTZC1_MPCBB6_SECCFGR37_SEC25	(0x1u<<25)
#define	GTZC1_MPCBB6_SECCFGR37_SEC24	(0x1u<<24)
#define	GTZC1_MPCBB6_SECCFGR37_SEC23	(0x1u<<23)
#define	GTZC1_MPCBB6_SECCFGR37_SEC22	(0x1u<<22)
#define	GTZC1_MPCBB6_SECCFGR37_SEC21	(0x1u<<21)
#define	GTZC1_MPCBB6_SECCFGR37_SEC20	(0x1u<<20)
#define	GTZC1_MPCBB6_SECCFGR37_SEC19	(0x1u<<19)
#define	GTZC1_MPCBB6_SECCFGR37_SEC18	(0x1u<<18)
#define	GTZC1_MPCBB6_SECCFGR37_SEC17	(0x1u<<17)
#define	GTZC1_MPCBB6_SECCFGR37_SEC16	(0x1u<<16)
#define	GTZC1_MPCBB6_SECCFGR37_SEC15	(0x1u<<15)
#define	GTZC1_MPCBB6_SECCFGR37_SEC14	(0x1u<<14)
#define	GTZC1_MPCBB6_SECCFGR37_SEC13	(0x1u<<13)
#define	GTZC1_MPCBB6_SECCFGR37_SEC12	(0x1u<<12)
#define	GTZC1_MPCBB6_SECCFGR37_SEC11	(0x1u<<11)
#define	GTZC1_MPCBB6_SECCFGR37_SEC10	(0x1u<<10)
#define	GTZC1_MPCBB6_SECCFGR37_SEC9		(0x1u<<9)
#define	GTZC1_MPCBB6_SECCFGR37_SEC8		(0x1u<<8)
#define	GTZC1_MPCBB6_SECCFGR37_SEC7		(0x1u<<7)
#define	GTZC1_MPCBB6_SECCFGR37_SEC6		(0x1u<<6)
#define	GTZC1_MPCBB6_SECCFGR37_SEC5		(0x1u<<5)
#define	GTZC1_MPCBB6_SECCFGR37_SEC4		(0x1u<<4)
#define	GTZC1_MPCBB6_SECCFGR37_SEC3		(0x1u<<3)
#define	GTZC1_MPCBB6_SECCFGR37_SEC2		(0x1u<<2)
#define	GTZC1_MPCBB6_SECCFGR37_SEC1		(0x1u<<1)
#define	GTZC1_MPCBB6_SECCFGR37_SEC0		(0x1u<<0)

// SECCFGR38 Configuration

#define	GTZC1_MPCBB6_SECCFGR38_SEC31	(0x1u<<31)
#define	GTZC1_MPCBB6_SECCFGR38_SEC30	(0x1u<<30)
#define	GTZC1_MPCBB6_SECCFGR38_SEC29	(0x1u<<29)
#define	GTZC1_MPCBB6_SECCFGR38_SEC28	(0x1u<<28)
#define	GTZC1_MPCBB6_SECCFGR38_SEC27	(0x1u<<27)
#define	GTZC1_MPCBB6_SECCFGR38_SEC26	(0x1u<<26)
#define	GTZC1_MPCBB6_SECCFGR38_SEC25	(0x1u<<25)
#define	GTZC1_MPCBB6_SECCFGR38_SEC24	(0x1u<<24)
#define	GTZC1_MPCBB6_SECCFGR38_SEC23	(0x1u<<23)
#define	GTZC1_MPCBB6_SECCFGR38_SEC22	(0x1u<<22)
#define	GTZC1_MPCBB6_SECCFGR38_SEC21	(0x1u<<21)
#define	GTZC1_MPCBB6_SECCFGR38_SEC20	(0x1u<<20)
#define	GTZC1_MPCBB6_SECCFGR38_SEC19	(0x1u<<19)
#define	GTZC1_MPCBB6_SECCFGR38_SEC18	(0x1u<<18)
#define	GTZC1_MPCBB6_SECCFGR38_SEC17	(0x1u<<17)
#define	GTZC1_MPCBB6_SECCFGR38_SEC16	(0x1u<<16)
#define	GTZC1_MPCBB6_SECCFGR38_SEC15	(0x1u<<15)
#define	GTZC1_MPCBB6_SECCFGR38_SEC14	(0x1u<<14)
#define	GTZC1_MPCBB6_SECCFGR38_SEC13	(0x1u<<13)
#define	GTZC1_MPCBB6_SECCFGR38_SEC12	(0x1u<<12)
#define	GTZC1_MPCBB6_SECCFGR38_SEC11	(0x1u<<11)
#define	GTZC1_MPCBB6_SECCFGR38_SEC10	(0x1u<<10)
#define	GTZC1_MPCBB6_SECCFGR38_SEC9		(0x1u<<9)
#define	GTZC1_MPCBB6_SECCFGR38_SEC8		(0x1u<<8)
#define	GTZC1_MPCBB6_SECCFGR38_SEC7		(0x1u<<7)
#define	GTZC1_MPCBB6_SECCFGR38_SEC6		(0x1u<<6)
#define	GTZC1_MPCBB6_SECCFGR38_SEC5		(0x1u<<5)
#define	GTZC1_MPCBB6_SECCFGR38_SEC4		(0x1u<<4)
#define	GTZC1_MPCBB6_SECCFGR38_SEC3		(0x1u<<3)
#define	GTZC1_MPCBB6_SECCFGR38_SEC2		(0x1u<<2)
#define	GTZC1_MPCBB6_SECCFGR38_SEC1		(0x1u<<1)
#define	GTZC1_MPCBB6_SECCFGR38_SEC0		(0x1u<<0)

// SECCFGR39 Configuration

#define	GTZC1_MPCBB6_SECCFGR39_SEC31	(0x1u<<31)
#define	GTZC1_MPCBB6_SECCFGR39_SEC30	(0x1u<<30)
#define	GTZC1_MPCBB6_SECCFGR39_SEC29	(0x1u<<29)
#define	GTZC1_MPCBB6_SECCFGR39_SEC28	(0x1u<<28)
#define	GTZC1_MPCBB6_SECCFGR39_SEC27	(0x1u<<27)
#define	GTZC1_MPCBB6_SECCFGR39_SEC26	(0x1u<<26)
#define	GTZC1_MPCBB6_SECCFGR39_SEC25	(0x1u<<25)
#define	GTZC1_MPCBB6_SECCFGR39_SEC24	(0x1u<<24)
#define	GTZC1_MPCBB6_SECCFGR39_SEC23	(0x1u<<23)
#define	GTZC1_MPCBB6_SECCFGR39_SEC22	(0x1u<<22)
#define	GTZC1_MPCBB6_SECCFGR39_SEC21	(0x1u<<21)
#define	GTZC1_MPCBB6_SECCFGR39_SEC20	(0x1u<<20)
#define	GTZC1_MPCBB6_SECCFGR39_SEC19	(0x1u<<19)
#define	GTZC1_MPCBB6_SECCFGR39_SEC18	(0x1u<<18)
#define	GTZC1_MPCBB6_SECCFGR39_SEC17	(0x1u<<17)
#define	GTZC1_MPCBB6_SECCFGR39_SEC16	(0x1u<<16)
#define	GTZC1_MPCBB6_SECCFGR39_SEC15	(0x1u<<15)
#define	GTZC1_MPCBB6_SECCFGR39_SEC14	(0x1u<<14)
#define	GTZC1_MPCBB6_SECCFGR39_SEC13	(0x1u<<13)
#define	GTZC1_MPCBB6_SECCFGR39_SEC12	(0x1u<<12)
#define	GTZC1_MPCBB6_SECCFGR39_SEC11	(0x1u<<11)
#define	GTZC1_MPCBB6_SECCFGR39_SEC10	(0x1u<<10)
#define	GTZC1_MPCBB6_SECCFGR39_SEC9		(0x1u<<9)
#define	GTZC1_MPCBB6_SECCFGR39_SEC8		(0x1u<<8)
#define	GTZC1_MPCBB6_SECCFGR39_SEC7		(0x1u<<7)
#define	GTZC1_MPCBB6_SECCFGR39_SEC6		(0x1u<<6)
#define	GTZC1_MPCBB6_SECCFGR39_SEC5		(0x1u<<5)
#define	GTZC1_MPCBB6_SECCFGR39_SEC4		(0x1u<<4)
#define	GTZC1_MPCBB6_SECCFGR39_SEC3		(0x1u<<3)
#define	GTZC1_MPCBB6_SECCFGR39_SEC2		(0x1u<<2)
#define	GTZC1_MPCBB6_SECCFGR39_SEC1		(0x1u<<1)
#define	GTZC1_MPCBB6_SECCFGR39_SEC0		(0x1u<<0)

