Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32U5G9/Includes/Registers/stm32U5Gx_gtzc1_mpcbb6.h
// SECCFGR40 Configuration

#define	GTZC1_MPCBB6_SECCFGR40_SEC31	(0x1u<<31)
#define	GTZC1_MPCBB6_SECCFGR40_SEC30	(0x1u<<30)
#define	GTZC1_MPCBB6_SECCFGR40_SEC29	(0x1u<<29)
#define	GTZC1_MPCBB6_SECCFGR40_SEC28	(0x1u<<28)
#define	GTZC1_MPCBB6_SECCFGR40_SEC27	(0x1u<<27)
#define	GTZC1_MPCBB6_SECCFGR40_SEC26	(0x1u<<26)
#define	GTZC1_MPCBB6_SECCFGR40_SEC25	(0x1u<<25)
#define	GTZC1_MPCBB6_SECCFGR40_SEC24	(0x1u<<24)
#define	GTZC1_MPCBB6_SECCFGR40_SEC23	(0x1u<<23)
#define	GTZC1_MPCBB6_SECCFGR40_SEC22	(0x1u<<22)
#define	GTZC1_MPCBB6_SECCFGR40_SEC21	(0x1u<<21)
#define	GTZC1_MPCBB6_SECCFGR40_SEC20	(0x1u<<20)
#define	GTZC1_MPCBB6_SECCFGR40_SEC19	(0x1u<<19)
#define	GTZC1_MPCBB6_SECCFGR40_SEC18	(0x1u<<18)
#define	GTZC1_MPCBB6_SECCFGR40_SEC17	(0x1u<<17)
#define	GTZC1_MPCBB6_SECCFGR40_SEC16	(0x1u<<16)
#define	GTZC1_MPCBB6_SECCFGR40_SEC15	(0x1u<<15)
#define	GTZC1_MPCBB6_SECCFGR40_SEC14	(0x1u<<14)
#define	GTZC1_MPCBB6_SECCFGR40_SEC13	(0x1u<<13)
#define	GTZC1_MPCBB6_SECCFGR40_SEC12	(0x1u<<12)
#define	GTZC1_MPCBB6_SECCFGR40_SEC11	(0x1u<<11)
#define	GTZC1_MPCBB6_SECCFGR40_SEC10	(0x1u<<10)
#define	GTZC1_MPCBB6_SECCFGR40_SEC9		(0x1u<<9)
#define	GTZC1_MPCBB6_SECCFGR40_SEC8		(0x1u<<8)
#define	GTZC1_MPCBB6_SECCFGR40_SEC7		(0x1u<<7)
#define	GTZC1_MPCBB6_SECCFGR40_SEC6		(0x1u<<6)
#define	GTZC1_MPCBB6_SECCFGR40_SEC5		(0x1u<<5)
#define	GTZC1_MPCBB6_SECCFGR40_SEC4		(0x1u<<4)
#define	GTZC1_MPCBB6_SECCFGR40_SEC3		(0x1u<<3)
#define	GTZC1_MPCBB6_SECCFGR40_SEC2		(0x1u<<2)
#define	GTZC1_MPCBB6_SECCFGR40_SEC1		(0x1u<<1)
#define	GTZC1_MPCBB6_SECCFGR40_SEC0		(0x1u<<0)

// SECCFGR41 Configuration

#define	GTZC1_MPCBB6_SECCFGR41_SEC31	(0x1u<<31)
#define	GTZC1_MPCBB6_SECCFGR41_SEC30	(0x1u<<30)
#define	GTZC1_MPCBB6_SECCFGR41_SEC29	(0x1u<<29)
#define	GTZC1_MPCBB6_SECCFGR41_SEC28	(0x1u<<28)
#define	GTZC1_MPCBB6_SECCFGR41_SEC27	(0x1u<<27)
#define	GTZC1_MPCBB6_SECCFGR41_SEC26	(0x1u<<26)
#define	GTZC1_MPCBB6_SECCFGR41_SEC25	(0x1u<<25)
#define	GTZC1_MPCBB6_SECCFGR41_SEC24	(0x1u<<24)
#define	GTZC1_MPCBB6_SECCFGR41_SEC23	(0x1u<<23)
#define	GTZC1_MPCBB6_SECCFGR41_SEC22	(0x1u<<22)
#define	GTZC1_MPCBB6_SECCFGR41_SEC21	(0x1u<<21)
#define	GTZC1_MPCBB6_SECCFGR41_SEC20	(0x1u<<20)
#define	GTZC1_MPCBB6_SECCFGR41_SEC19	(0x1u<<19)
#define	GTZC1_MPCBB6_SECCFGR41_SEC18	(0x1u<<18)
#define	GTZC1_MPCBB6_SECCFGR41_SEC17	(0x1u<<17)
#define	GTZC1_MPCBB6_SECCFGR41_SEC16	(0x1u<<16)
#define	GTZC1_MPCBB6_SECCFGR41_SEC15	(0x1u<<15)
#define	GTZC1_MPCBB6_SECCFGR41_SEC14	(0x1u<<14)
#define	GTZC1_MPCBB6_SECCFGR41_SEC13	(0x1u<<13)
#define	GTZC1_MPCBB6_SECCFGR41_SEC12	(0x1u<<12)
#define	GTZC1_MPCBB6_SECCFGR41_SEC11	(0x1u<<11)
#define	GTZC1_MPCBB6_SECCFGR41_SEC10	(0x1u<<10)
#define	GTZC1_MPCBB6_SECCFGR41_SEC9		(0x1u<<9)
#define	GTZC1_MPCBB6_SECCFGR41_SEC8		(0x1u<<8)
#define	GTZC1_MPCBB6_SECCFGR41_SEC7		(0x1u<<7)
#define	GTZC1_MPCBB6_SECCFGR41_SEC6		(0x1u<<6)
#define	GTZC1_MPCBB6_SECCFGR41_SEC5		(0x1u<<5)
#define	GTZC1_MPCBB6_SECCFGR41_SEC4		(0x1u<<4)
#define	GTZC1_MPCBB6_SECCFGR41_SEC3		(0x1u<<3)
#define	GTZC1_MPCBB6_SECCFGR41_SEC2		(0x1u<<2)
#define	GTZC1_MPCBB6_SECCFGR41_SEC1		(0x1u<<1)
#define	GTZC1_MPCBB6_SECCFGR41_SEC0		(0x1u<<0)

// SECCFGR42 Configuration

#define	GTZC1_MPCBB6_SECCFGR42_SEC31	(0x1u<<31)
#define	GTZC1_MPCBB6_SECCFGR42_SEC30	(0x1u<<30)
#define	GTZC1_MPCBB6_SECCFGR42_SEC29	(0x1u<<29)
#define	GTZC1_MPCBB6_SECCFGR42_SEC28	(0x1u<<28)
#define	GTZC1_MPCBB6_SECCFGR42_SEC27	(0x1u<<27)
#define	GTZC1_MPCBB6_SECCFGR42_SEC26	(0x1u<<26)
#define	GTZC1_MPCBB6_SECCFGR42_SEC25	(0x1u<<25)
#define	GTZC1_MPCBB6_SECCFGR42_SEC24	(0x1u<<24)
#define	GTZC1_MPCBB6_SECCFGR42_SEC23	(0x1u<<23)
#define	GTZC1_MPCBB6_SECCFGR42_SEC22	(0x1u<<22)
#define	GTZC1_MPCBB6_SECCFGR42_SEC21	(0x1u<<21)
#define	GTZC1_MPCBB6_SECCFGR42_SEC20	(0x1u<<20)
#define	GTZC1_MPCBB6_SECCFGR42_SEC19	(0x1u<<19)
#define	GTZC1_MPCBB6_SECCFGR42_SEC18	(0x1u<<18)
#define	GTZC1_MPCBB6_SECCFGR42_SEC17	(0x1u<<17)
#define	GTZC1_MPCBB6_SECCFGR42_SEC16	(0x1u<<16)
#define	GTZC1_MPCBB6_SECCFGR42_SEC15	(0x1u<<15)
#define	GTZC1_MPCBB6_SECCFGR42_SEC14	(0x1u<<14)
#define	GTZC1_MPCBB6_SECCFGR42_SEC13	(0x1u<<13)
#define	GTZC1_MPCBB6_SECCFGR42_SEC12	(0x1u<<12)
#define	GTZC1_MPCBB6_SECCFGR42_SEC11	(0x1u<<11)
#define	GTZC1_MPCBB6_SECCFGR42_SEC10	(0x1u<<10)
#define	GTZC1_MPCBB6_SECCFGR42_SEC9		(0x1u<<9)
#define	GTZC1_MPCBB6_SECCFGR42_SEC8		(0x1u<<8)
#define	GTZC1_MPCBB6_SECCFGR42_SEC7		(0x1u<<7)
#define	GTZC1_MPCBB6_SECCFGR42_SEC6		(0x1u<<6)
#define	GTZC1_MPCBB6_SECCFGR42_SEC5		(0x1u<<5)
#define	GTZC1_MPCBB6_SECCFGR42_SEC4		(0x1u<<4)
#define	GTZC1_MPCBB6_SECCFGR42_SEC3		(0x1u<<3)
#define	GTZC1_MPCBB6_SECCFGR42_SEC2		(0x1u<<2)
#define	GTZC1_MPCBB6_SECCFGR42_SEC1		(0x1u<<1)
#define	GTZC1_MPCBB6_SECCFGR42_SEC0		(0x1u<<0)

// SECCFGR43 Configuration

#define	GTZC1_MPCBB6_SECCFGR43_SEC31	(0x1u<<31)
#define	GTZC1_MPCBB6_SECCFGR43_SEC30	(0x1u<<30)
#define	GTZC1_MPCBB6_SECCFGR43_SEC29	(0x1u<<29)
#define	GTZC1_MPCBB6_SECCFGR43_SEC28	(0x1u<<28)
#define	GTZC1_MPCBB6_SECCFGR43_SEC27	(0x1u<<27)
#define	GTZC1_MPCBB6_SECCFGR43_SEC26	(0x1u<<26)
#define	GTZC1_MPCBB6_SECCFGR43_SEC25	(0x1u<<25)
#define	GTZC1_MPCBB6_SECCFGR43_SEC24	(0x1u<<24)
#define	GTZC1_MPCBB6_SECCFGR43_SEC23	(0x1u<<23)
#define	GTZC1_MPCBB6_SECCFGR43_SEC22	(0x1u<<22)
#define	GTZC1_MPCBB6_SECCFGR43_SEC21	(0x1u<<21)
#define	GTZC1_MPCBB6_SECCFGR43_SEC20	(0x1u<<20)
#define	GTZC1_MPCBB6_SECCFGR43_SEC19	(0x1u<<19)
#define	GTZC1_MPCBB6_SECCFGR43_SEC18	(0x1u<<18)
#define	GTZC1_MPCBB6_SECCFGR43_SEC17	(0x1u<<17)
#define	GTZC1_MPCBB6_SECCFGR43_SEC16	(0x1u<<16)
#define	GTZC1_MPCBB6_SECCFGR43_SEC15	(0x1u<<15)
#define	GTZC1_MPCBB6_SECCFGR43_SEC14	(0x1u<<14)
#define	GTZC1_MPCBB6_SECCFGR43_SEC13	(0x1u<<13)
#define	GTZC1_MPCBB6_SECCFGR43_SEC12	(0x1u<<12)
#define	GTZC1_MPCBB6_SECCFGR43_SEC11	(0x1u<<11)
#define	GTZC1_MPCBB6_SECCFGR43_SEC10	(0x1u<<10)
#define	GTZC1_MPCBB6_SECCFGR43_SEC9		(0x1u<<9)
#define	GTZC1_MPCBB6_SECCFGR43_SEC8		(0x1u<<8)
#define	GTZC1_MPCBB6_SECCFGR43_SEC7		(0x1u<<7)
#define	GTZC1_MPCBB6_SECCFGR43_SEC6		(0x1u<<6)
#define	GTZC1_MPCBB6_SECCFGR43_SEC5		(0x1u<<5)
#define	GTZC1_MPCBB6_SECCFGR43_SEC4		(0x1u<<4)
#define	GTZC1_MPCBB6_SECCFGR43_SEC3		(0x1u<<3)
#define	GTZC1_MPCBB6_SECCFGR43_SEC2		(0x1u<<2)
#define	GTZC1_MPCBB6_SECCFGR43_SEC1		(0x1u<<1)
#define	GTZC1_MPCBB6_SECCFGR43_SEC0		(0x1u<<0)

// SECCFGR44 Configuration

