Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32U5G9/Includes/Registers/stm32U5Gx_gtzc1_mpcbb6.h
#define	GTZC1_MPCBB6_SECCFGR44_SEC31	(0x1u<<31)
#define	GTZC1_MPCBB6_SECCFGR44_SEC30	(0x1u<<30)
#define	GTZC1_MPCBB6_SECCFGR44_SEC29	(0x1u<<29)
#define	GTZC1_MPCBB6_SECCFGR44_SEC28	(0x1u<<28)
#define	GTZC1_MPCBB6_SECCFGR44_SEC27	(0x1u<<27)
#define	GTZC1_MPCBB6_SECCFGR44_SEC26	(0x1u<<26)
#define	GTZC1_MPCBB6_SECCFGR44_SEC25	(0x1u<<25)
#define	GTZC1_MPCBB6_SECCFGR44_SEC24	(0x1u<<24)
#define	GTZC1_MPCBB6_SECCFGR44_SEC23	(0x1u<<23)
#define	GTZC1_MPCBB6_SECCFGR44_SEC22	(0x1u<<22)
#define	GTZC1_MPCBB6_SECCFGR44_SEC21	(0x1u<<21)
#define	GTZC1_MPCBB6_SECCFGR44_SEC20	(0x1u<<20)
#define	GTZC1_MPCBB6_SECCFGR44_SEC19	(0x1u<<19)
#define	GTZC1_MPCBB6_SECCFGR44_SEC18	(0x1u<<18)
#define	GTZC1_MPCBB6_SECCFGR44_SEC17	(0x1u<<17)
#define	GTZC1_MPCBB6_SECCFGR44_SEC16	(0x1u<<16)
#define	GTZC1_MPCBB6_SECCFGR44_SEC15	(0x1u<<15)
#define	GTZC1_MPCBB6_SECCFGR44_SEC14	(0x1u<<14)
#define	GTZC1_MPCBB6_SECCFGR44_SEC13	(0x1u<<13)
#define	GTZC1_MPCBB6_SECCFGR44_SEC12	(0x1u<<12)
#define	GTZC1_MPCBB6_SECCFGR44_SEC11	(0x1u<<11)
#define	GTZC1_MPCBB6_SECCFGR44_SEC10	(0x1u<<10)
#define	GTZC1_MPCBB6_SECCFGR44_SEC9		(0x1u<<9)
#define	GTZC1_MPCBB6_SECCFGR44_SEC8		(0x1u<<8)
#define	GTZC1_MPCBB6_SECCFGR44_SEC7		(0x1u<<7)
#define	GTZC1_MPCBB6_SECCFGR44_SEC6		(0x1u<<6)
#define	GTZC1_MPCBB6_SECCFGR44_SEC5		(0x1u<<5)
#define	GTZC1_MPCBB6_SECCFGR44_SEC4		(0x1u<<4)
#define	GTZC1_MPCBB6_SECCFGR44_SEC3		(0x1u<<3)
#define	GTZC1_MPCBB6_SECCFGR44_SEC2		(0x1u<<2)
#define	GTZC1_MPCBB6_SECCFGR44_SEC1		(0x1u<<1)
#define	GTZC1_MPCBB6_SECCFGR44_SEC0		(0x1u<<0)

// SECCFGR45 Configuration

#define	GTZC1_MPCBB6_SECCFGR45_SEC31	(0x1u<<31)
#define	GTZC1_MPCBB6_SECCFGR45_SEC30	(0x1u<<30)
#define	GTZC1_MPCBB6_SECCFGR45_SEC29	(0x1u<<29)
#define	GTZC1_MPCBB6_SECCFGR45_SEC28	(0x1u<<28)
#define	GTZC1_MPCBB6_SECCFGR45_SEC27	(0x1u<<27)
#define	GTZC1_MPCBB6_SECCFGR45_SEC26	(0x1u<<26)
#define	GTZC1_MPCBB6_SECCFGR45_SEC25	(0x1u<<25)
#define	GTZC1_MPCBB6_SECCFGR45_SEC24	(0x1u<<24)
#define	GTZC1_MPCBB6_SECCFGR45_SEC23	(0x1u<<23)
#define	GTZC1_MPCBB6_SECCFGR45_SEC22	(0x1u<<22)
#define	GTZC1_MPCBB6_SECCFGR45_SEC21	(0x1u<<21)
#define	GTZC1_MPCBB6_SECCFGR45_SEC20	(0x1u<<20)
#define	GTZC1_MPCBB6_SECCFGR45_SEC19	(0x1u<<19)
#define	GTZC1_MPCBB6_SECCFGR45_SEC18	(0x1u<<18)
#define	GTZC1_MPCBB6_SECCFGR45_SEC17	(0x1u<<17)
#define	GTZC1_MPCBB6_SECCFGR45_SEC16	(0x1u<<16)
#define	GTZC1_MPCBB6_SECCFGR45_SEC15	(0x1u<<15)
#define	GTZC1_MPCBB6_SECCFGR45_SEC14	(0x1u<<14)
#define	GTZC1_MPCBB6_SECCFGR45_SEC13	(0x1u<<13)
#define	GTZC1_MPCBB6_SECCFGR45_SEC12	(0x1u<<12)
#define	GTZC1_MPCBB6_SECCFGR45_SEC11	(0x1u<<11)
#define	GTZC1_MPCBB6_SECCFGR45_SEC10	(0x1u<<10)
#define	GTZC1_MPCBB6_SECCFGR45_SEC9		(0x1u<<9)
#define	GTZC1_MPCBB6_SECCFGR45_SEC8		(0x1u<<8)
#define	GTZC1_MPCBB6_SECCFGR45_SEC7		(0x1u<<7)
#define	GTZC1_MPCBB6_SECCFGR45_SEC6		(0x1u<<6)
#define	GTZC1_MPCBB6_SECCFGR45_SEC5		(0x1u<<5)
#define	GTZC1_MPCBB6_SECCFGR45_SEC4		(0x1u<<4)
#define	GTZC1_MPCBB6_SECCFGR45_SEC3		(0x1u<<3)
#define	GTZC1_MPCBB6_SECCFGR45_SEC2		(0x1u<<2)
#define	GTZC1_MPCBB6_SECCFGR45_SEC1		(0x1u<<1)
#define	GTZC1_MPCBB6_SECCFGR45_SEC0		(0x1u<<0)

// SECCFGR46 Configuration

#define	GTZC1_MPCBB6_SECCFGR46_SEC31	(0x1u<<31)
#define	GTZC1_MPCBB6_SECCFGR46_SEC30	(0x1u<<30)
#define	GTZC1_MPCBB6_SECCFGR46_SEC29	(0x1u<<29)
#define	GTZC1_MPCBB6_SECCFGR46_SEC28	(0x1u<<28)
#define	GTZC1_MPCBB6_SECCFGR46_SEC27	(0x1u<<27)
#define	GTZC1_MPCBB6_SECCFGR46_SEC26	(0x1u<<26)
#define	GTZC1_MPCBB6_SECCFGR46_SEC25	(0x1u<<25)
#define	GTZC1_MPCBB6_SECCFGR46_SEC24	(0x1u<<24)
#define	GTZC1_MPCBB6_SECCFGR46_SEC23	(0x1u<<23)
#define	GTZC1_MPCBB6_SECCFGR46_SEC22	(0x1u<<22)
#define	GTZC1_MPCBB6_SECCFGR46_SEC21	(0x1u<<21)
#define	GTZC1_MPCBB6_SECCFGR46_SEC20	(0x1u<<20)
#define	GTZC1_MPCBB6_SECCFGR46_SEC19	(0x1u<<19)
#define	GTZC1_MPCBB6_SECCFGR46_SEC18	(0x1u<<18)
#define	GTZC1_MPCBB6_SECCFGR46_SEC17	(0x1u<<17)
#define	GTZC1_MPCBB6_SECCFGR46_SEC16	(0x1u<<16)
#define	GTZC1_MPCBB6_SECCFGR46_SEC15	(0x1u<<15)
#define	GTZC1_MPCBB6_SECCFGR46_SEC14	(0x1u<<14)
#define	GTZC1_MPCBB6_SECCFGR46_SEC13	(0x1u<<13)
#define	GTZC1_MPCBB6_SECCFGR46_SEC12	(0x1u<<12)
#define	GTZC1_MPCBB6_SECCFGR46_SEC11	(0x1u<<11)
#define	GTZC1_MPCBB6_SECCFGR46_SEC10	(0x1u<<10)
#define	GTZC1_MPCBB6_SECCFGR46_SEC9		(0x1u<<9)
#define	GTZC1_MPCBB6_SECCFGR46_SEC8		(0x1u<<8)
#define	GTZC1_MPCBB6_SECCFGR46_SEC7		(0x1u<<7)
#define	GTZC1_MPCBB6_SECCFGR46_SEC6		(0x1u<<6)
#define	GTZC1_MPCBB6_SECCFGR46_SEC5		(0x1u<<5)
#define	GTZC1_MPCBB6_SECCFGR46_SEC4		(0x1u<<4)
#define	GTZC1_MPCBB6_SECCFGR46_SEC3		(0x1u<<3)
#define	GTZC1_MPCBB6_SECCFGR46_SEC2		(0x1u<<2)
#define	GTZC1_MPCBB6_SECCFGR46_SEC1		(0x1u<<1)
#define	GTZC1_MPCBB6_SECCFGR46_SEC0		(0x1u<<0)

// SECCFGR47 Configuration

#define	GTZC1_MPCBB6_SECCFGR47_SEC31	(0x1u<<31)
#define	GTZC1_MPCBB6_SECCFGR47_SEC30	(0x1u<<30)
#define	GTZC1_MPCBB6_SECCFGR47_SEC29	(0x1u<<29)
#define	GTZC1_MPCBB6_SECCFGR47_SEC28	(0x1u<<28)
#define	GTZC1_MPCBB6_SECCFGR47_SEC27	(0x1u<<27)
#define	GTZC1_MPCBB6_SECCFGR47_SEC26	(0x1u<<26)
#define	GTZC1_MPCBB6_SECCFGR47_SEC25	(0x1u<<25)
#define	GTZC1_MPCBB6_SECCFGR47_SEC24	(0x1u<<24)
#define	GTZC1_MPCBB6_SECCFGR47_SEC23	(0x1u<<23)
#define	GTZC1_MPCBB6_SECCFGR47_SEC22	(0x1u<<22)
#define	GTZC1_MPCBB6_SECCFGR47_SEC21	(0x1u<<21)
#define	GTZC1_MPCBB6_SECCFGR47_SEC20	(0x1u<<20)
#define	GTZC1_MPCBB6_SECCFGR47_SEC19	(0x1u<<19)
#define	GTZC1_MPCBB6_SECCFGR47_SEC18	(0x1u<<18)
#define	GTZC1_MPCBB6_SECCFGR47_SEC17	(0x1u<<17)
#define	GTZC1_MPCBB6_SECCFGR47_SEC16	(0x1u<<16)
#define	GTZC1_MPCBB6_SECCFGR47_SEC15	(0x1u<<15)
#define	GTZC1_MPCBB6_SECCFGR47_SEC14	(0x1u<<14)
#define	GTZC1_MPCBB6_SECCFGR47_SEC13	(0x1u<<13)
#define	GTZC1_MPCBB6_SECCFGR47_SEC12	(0x1u<<12)
#define	GTZC1_MPCBB6_SECCFGR47_SEC11	(0x1u<<11)
#define	GTZC1_MPCBB6_SECCFGR47_SEC10	(0x1u<<10)
#define	GTZC1_MPCBB6_SECCFGR47_SEC9		(0x1u<<9)
#define	GTZC1_MPCBB6_SECCFGR47_SEC8		(0x1u<<8)
#define	GTZC1_MPCBB6_SECCFGR47_SEC7		(0x1u<<7)
#define	GTZC1_MPCBB6_SECCFGR47_SEC6		(0x1u<<6)
#define	GTZC1_MPCBB6_SECCFGR47_SEC5		(0x1u<<5)
#define	GTZC1_MPCBB6_SECCFGR47_SEC4		(0x1u<<4)
#define	GTZC1_MPCBB6_SECCFGR47_SEC3		(0x1u<<3)
#define	GTZC1_MPCBB6_SECCFGR47_SEC2		(0x1u<<2)
#define	GTZC1_MPCBB6_SECCFGR47_SEC1		(0x1u<<1)
#define	GTZC1_MPCBB6_SECCFGR47_SEC0		(0x1u<<0)

// SECCFGR48 Configuration

#define	GTZC1_MPCBB6_SECCFGR48_SEC31	(0x1u<<31)
#define	GTZC1_MPCBB6_SECCFGR48_SEC30	(0x1u<<30)
#define	GTZC1_MPCBB6_SECCFGR48_SEC29	(0x1u<<29)
#define	GTZC1_MPCBB6_SECCFGR48_SEC28	(0x1u<<28)
#define	GTZC1_MPCBB6_SECCFGR48_SEC27	(0x1u<<27)
#define	GTZC1_MPCBB6_SECCFGR48_SEC26	(0x1u<<26)
#define	GTZC1_MPCBB6_SECCFGR48_SEC25	(0x1u<<25)
#define	GTZC1_MPCBB6_SECCFGR48_SEC24	(0x1u<<24)
#define	GTZC1_MPCBB6_SECCFGR48_SEC23	(0x1u<<23)
#define	GTZC1_MPCBB6_SECCFGR48_SEC22	(0x1u<<22)
#define	GTZC1_MPCBB6_SECCFGR48_SEC21	(0x1u<<21)
#define	GTZC1_MPCBB6_SECCFGR48_SEC20	(0x1u<<20)
#define	GTZC1_MPCBB6_SECCFGR48_SEC19	(0x1u<<19)
#define	GTZC1_MPCBB6_SECCFGR48_SEC18	(0x1u<<18)
#define	GTZC1_MPCBB6_SECCFGR48_SEC17	(0x1u<<17)
#define	GTZC1_MPCBB6_SECCFGR48_SEC16	(0x1u<<16)
#define	GTZC1_MPCBB6_SECCFGR48_SEC15	(0x1u<<15)
#define	GTZC1_MPCBB6_SECCFGR48_SEC14	(0x1u<<14)
#define	GTZC1_MPCBB6_SECCFGR48_SEC13	(0x1u<<13)
#define	GTZC1_MPCBB6_SECCFGR48_SEC12	(0x1u<<12)
#define	GTZC1_MPCBB6_SECCFGR48_SEC11	(0x1u<<11)
#define	GTZC1_MPCBB6_SECCFGR48_SEC10	(0x1u<<10)
#define	GTZC1_MPCBB6_SECCFGR48_SEC9		(0x1u<<9)
#define	GTZC1_MPCBB6_SECCFGR48_SEC8		(0x1u<<8)
#define	GTZC1_MPCBB6_SECCFGR48_SEC7		(0x1u<<7)
#define	GTZC1_MPCBB6_SECCFGR48_SEC6		(0x1u<<6)
#define	GTZC1_MPCBB6_SECCFGR48_SEC5		(0x1u<<5)
#define	GTZC1_MPCBB6_SECCFGR48_SEC4		(0x1u<<4)
#define	GTZC1_MPCBB6_SECCFGR48_SEC3		(0x1u<<3)
#define	GTZC1_MPCBB6_SECCFGR48_SEC2		(0x1u<<2)
#define	GTZC1_MPCBB6_SECCFGR48_SEC1		(0x1u<<1)
#define	GTZC1_MPCBB6_SECCFGR48_SEC0		(0x1u<<0)

// SECCFGR49 Configuration

#define	GTZC1_MPCBB6_SECCFGR49_SEC31	(0x1u<<31)
#define	GTZC1_MPCBB6_SECCFGR49_SEC30	(0x1u<<30)
#define	GTZC1_MPCBB6_SECCFGR49_SEC29	(0x1u<<29)
#define	GTZC1_MPCBB6_SECCFGR49_SEC28	(0x1u<<28)
#define	GTZC1_MPCBB6_SECCFGR49_SEC27	(0x1u<<27)
#define	GTZC1_MPCBB6_SECCFGR49_SEC26	(0x1u<<26)
#define	GTZC1_MPCBB6_SECCFGR49_SEC25	(0x1u<<25)
#define	GTZC1_MPCBB6_SECCFGR49_SEC24	(0x1u<<24)
#define	GTZC1_MPCBB6_SECCFGR49_SEC23	(0x1u<<23)
#define	GTZC1_MPCBB6_SECCFGR49_SEC22	(0x1u<<22)
#define	GTZC1_MPCBB6_SECCFGR49_SEC21	(0x1u<<21)
#define	GTZC1_MPCBB6_SECCFGR49_SEC20	(0x1u<<20)
#define	GTZC1_MPCBB6_SECCFGR49_SEC19	(0x1u<<19)
#define	GTZC1_MPCBB6_SECCFGR49_SEC18	(0x1u<<18)
#define	GTZC1_MPCBB6_SECCFGR49_SEC17	(0x1u<<17)
#define	GTZC1_MPCBB6_SECCFGR49_SEC16	(0x1u<<16)
#define	GTZC1_MPCBB6_SECCFGR49_SEC15	(0x1u<<15)
#define	GTZC1_MPCBB6_SECCFGR49_SEC14	(0x1u<<14)
#define	GTZC1_MPCBB6_SECCFGR49_SEC13	(0x1u<<13)
#define	GTZC1_MPCBB6_SECCFGR49_SEC12	(0x1u<<12)
#define	GTZC1_MPCBB6_SECCFGR49_SEC11	(0x1u<<11)
#define	GTZC1_MPCBB6_SECCFGR49_SEC10	(0x1u<<10)
#define	GTZC1_MPCBB6_SECCFGR49_SEC9		(0x1u<<9)
#define	GTZC1_MPCBB6_SECCFGR49_SEC8		(0x1u<<8)
#define	GTZC1_MPCBB6_SECCFGR49_SEC7		(0x1u<<7)
#define	GTZC1_MPCBB6_SECCFGR49_SEC6		(0x1u<<6)
#define	GTZC1_MPCBB6_SECCFGR49_SEC5		(0x1u<<5)
#define	GTZC1_MPCBB6_SECCFGR49_SEC4		(0x1u<<4)
#define	GTZC1_MPCBB6_SECCFGR49_SEC3		(0x1u<<3)
#define	GTZC1_MPCBB6_SECCFGR49_SEC2		(0x1u<<2)
#define	GTZC1_MPCBB6_SECCFGR49_SEC1		(0x1u<<1)
#define	GTZC1_MPCBB6_SECCFGR49_SEC0		(0x1u<<0)

// SECCFGR50 Configuration

#define	GTZC1_MPCBB6_SECCFGR50_SEC31	(0x1u<<31)
#define	GTZC1_MPCBB6_SECCFGR50_SEC30	(0x1u<<30)
#define	GTZC1_MPCBB6_SECCFGR50_SEC29	(0x1u<<29)
#define	GTZC1_MPCBB6_SECCFGR50_SEC28	(0x1u<<28)
#define	GTZC1_MPCBB6_SECCFGR50_SEC27	(0x1u<<27)
#define	GTZC1_MPCBB6_SECCFGR50_SEC26	(0x1u<<26)
#define	GTZC1_MPCBB6_SECCFGR50_SEC25	(0x1u<<25)
#define	GTZC1_MPCBB6_SECCFGR50_SEC24	(0x1u<<24)
#define	GTZC1_MPCBB6_SECCFGR50_SEC23	(0x1u<<23)
#define	GTZC1_MPCBB6_SECCFGR50_SEC22	(0x1u<<22)
#define	GTZC1_MPCBB6_SECCFGR50_SEC21	(0x1u<<21)
#define	GTZC1_MPCBB6_SECCFGR50_SEC20	(0x1u<<20)
#define	GTZC1_MPCBB6_SECCFGR50_SEC19	(0x1u<<19)
#define	GTZC1_MPCBB6_SECCFGR50_SEC18	(0x1u<<18)
#define	GTZC1_MPCBB6_SECCFGR50_SEC17	(0x1u<<17)
#define	GTZC1_MPCBB6_SECCFGR50_SEC16	(0x1u<<16)
#define	GTZC1_MPCBB6_SECCFGR50_SEC15	(0x1u<<15)
#define	GTZC1_MPCBB6_SECCFGR50_SEC14	(0x1u<<14)
#define	GTZC1_MPCBB6_SECCFGR50_SEC13	(0x1u<<13)
#define	GTZC1_MPCBB6_SECCFGR50_SEC12	(0x1u<<12)
#define	GTZC1_MPCBB6_SECCFGR50_SEC11	(0x1u<<11)
#define	GTZC1_MPCBB6_SECCFGR50_SEC10	(0x1u<<10)
#define	GTZC1_MPCBB6_SECCFGR50_SEC9		(0x1u<<9)
#define	GTZC1_MPCBB6_SECCFGR50_SEC8		(0x1u<<8)
#define	GTZC1_MPCBB6_SECCFGR50_SEC7		(0x1u<<7)
#define	GTZC1_MPCBB6_SECCFGR50_SEC6		(0x1u<<6)
#define	GTZC1_MPCBB6_SECCFGR50_SEC5		(0x1u<<5)
#define	GTZC1_MPCBB6_SECCFGR50_SEC4		(0x1u<<4)
#define	GTZC1_MPCBB6_SECCFGR50_SEC3		(0x1u<<3)
#define	GTZC1_MPCBB6_SECCFGR50_SEC2		(0x1u<<2)
#define	GTZC1_MPCBB6_SECCFGR50_SEC1		(0x1u<<1)
#define	GTZC1_MPCBB6_SECCFGR50_SEC0		(0x1u<<0)

// SECCFGR51 Configuration

#define	GTZC1_MPCBB6_SECCFGR51_SEC31	(0x1u<<31)
#define	GTZC1_MPCBB6_SECCFGR51_SEC30	(0x1u<<30)
#define	GTZC1_MPCBB6_SECCFGR51_SEC29	(0x1u<<29)
#define	GTZC1_MPCBB6_SECCFGR51_SEC28	(0x1u<<28)
#define	GTZC1_MPCBB6_SECCFGR51_SEC27	(0x1u<<27)
#define	GTZC1_MPCBB6_SECCFGR51_SEC26	(0x1u<<26)
#define	GTZC1_MPCBB6_SECCFGR51_SEC25	(0x1u<<25)
#define	GTZC1_MPCBB6_SECCFGR51_SEC24	(0x1u<<24)
#define	GTZC1_MPCBB6_SECCFGR51_SEC23	(0x1u<<23)
#define	GTZC1_MPCBB6_SECCFGR51_SEC22	(0x1u<<22)
#define	GTZC1_MPCBB6_SECCFGR51_SEC21	(0x1u<<21)
#define	GTZC1_MPCBB6_SECCFGR51_SEC20	(0x1u<<20)
#define	GTZC1_MPCBB6_SECCFGR51_SEC19	(0x1u<<19)
#define	GTZC1_MPCBB6_SECCFGR51_SEC18	(0x1u<<18)
#define	GTZC1_MPCBB6_SECCFGR51_SEC17	(0x1u<<17)
#define	GTZC1_MPCBB6_SECCFGR51_SEC16	(0x1u<<16)
#define	GTZC1_MPCBB6_SECCFGR51_SEC15	(0x1u<<15)
#define	GTZC1_MPCBB6_SECCFGR51_SEC14	(0x1u<<14)
#define	GTZC1_MPCBB6_SECCFGR51_SEC13	(0x1u<<13)
#define	GTZC1_MPCBB6_SECCFGR51_SEC12	(0x1u<<12)
#define	GTZC1_MPCBB6_SECCFGR51_SEC11	(0x1u<<11)
#define	GTZC1_MPCBB6_SECCFGR51_SEC10	(0x1u<<10)
#define	GTZC1_MPCBB6_SECCFGR51_SEC9		(0x1u<<9)
#define	GTZC1_MPCBB6_SECCFGR51_SEC8		(0x1u<<8)
#define	GTZC1_MPCBB6_SECCFGR51_SEC7		(0x1u<<7)
#define	GTZC1_MPCBB6_SECCFGR51_SEC6		(0x1u<<6)
#define	GTZC1_MPCBB6_SECCFGR51_SEC5		(0x1u<<5)
#define	GTZC1_MPCBB6_SECCFGR51_SEC4		(0x1u<<4)
#define	GTZC1_MPCBB6_SECCFGR51_SEC3		(0x1u<<3)
#define	GTZC1_MPCBB6_SECCFGR51_SEC2		(0x1u<<2)
#define	GTZC1_MPCBB6_SECCFGR51_SEC1		(0x1u<<1)
#define	GTZC1_MPCBB6_SECCFGR51_SEC0		(0x1u<<0)

