Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32U5G9/Includes/Registers/stm32U5Gx_gtzc1_mpcbb6.h
// PRIVCFGR0 Configuration

#define	GTZC1_MPCBB6_PRIVCFGR0_PRIV31	(0x1u<<31)
#define	GTZC1_MPCBB6_PRIVCFGR0_PRIV30	(0x1u<<30)
#define	GTZC1_MPCBB6_PRIVCFGR0_PRIV29	(0x1u<<29)
#define	GTZC1_MPCBB6_PRIVCFGR0_PRIV28	(0x1u<<28)
#define	GTZC1_MPCBB6_PRIVCFGR0_PRIV27	(0x1u<<27)
#define	GTZC1_MPCBB6_PRIVCFGR0_PRIV26	(0x1u<<26)
#define	GTZC1_MPCBB6_PRIVCFGR0_PRIV25	(0x1u<<25)
#define	GTZC1_MPCBB6_PRIVCFGR0_PRIV24	(0x1u<<24)
#define	GTZC1_MPCBB6_PRIVCFGR0_PRIV23	(0x1u<<23)
#define	GTZC1_MPCBB6_PRIVCFGR0_PRIV22	(0x1u<<22)
#define	GTZC1_MPCBB6_PRIVCFGR0_PRIV21	(0x1u<<21)
#define	GTZC1_MPCBB6_PRIVCFGR0_PRIV20	(0x1u<<20)
#define	GTZC1_MPCBB6_PRIVCFGR0_PRIV19	(0x1u<<19)
#define	GTZC1_MPCBB6_PRIVCFGR0_PRIV18	(0x1u<<18)
#define	GTZC1_MPCBB6_PRIVCFGR0_PRIV17	(0x1u<<17)
#define	GTZC1_MPCBB6_PRIVCFGR0_PRIV16	(0x1u<<16)
#define	GTZC1_MPCBB6_PRIVCFGR0_PRIV15	(0x1u<<15)
#define	GTZC1_MPCBB6_PRIVCFGR0_PRIV14	(0x1u<<14)
#define	GTZC1_MPCBB6_PRIVCFGR0_PRIV13	(0x1u<<13)
#define	GTZC1_MPCBB6_PRIVCFGR0_PRIV12	(0x1u<<12)
#define	GTZC1_MPCBB6_PRIVCFGR0_PRIV11	(0x1u<<11)
#define	GTZC1_MPCBB6_PRIVCFGR0_PRIV10	(0x1u<<10)
#define	GTZC1_MPCBB6_PRIVCFGR0_PRIV9	(0x1u<<9)
#define	GTZC1_MPCBB6_PRIVCFGR0_PRIV8	(0x1u<<8)
#define	GTZC1_MPCBB6_PRIVCFGR0_PRIV7	(0x1u<<7)
#define	GTZC1_MPCBB6_PRIVCFGR0_PRIV6	(0x1u<<6)
#define	GTZC1_MPCBB6_PRIVCFGR0_PRIV5	(0x1u<<5)
#define	GTZC1_MPCBB6_PRIVCFGR0_PRIV4	(0x1u<<4)
#define	GTZC1_MPCBB6_PRIVCFGR0_PRIV3	(0x1u<<3)
#define	GTZC1_MPCBB6_PRIVCFGR0_PRIV2	(0x1u<<2)
#define	GTZC1_MPCBB6_PRIVCFGR0_PRIV1	(0x1u<<1)
#define	GTZC1_MPCBB6_PRIVCFGR0_PRIV0	(0x1u<<0)

// PRIVCFGR1 Configuration

#define	GTZC1_MPCBB6_PRIVCFGR1_PRIV31	(0x1u<<31)
#define	GTZC1_MPCBB6_PRIVCFGR1_PRIV30	(0x1u<<30)
#define	GTZC1_MPCBB6_PRIVCFGR1_PRIV29	(0x1u<<29)
#define	GTZC1_MPCBB6_PRIVCFGR1_PRIV28	(0x1u<<28)
#define	GTZC1_MPCBB6_PRIVCFGR1_PRIV27	(0x1u<<27)
#define	GTZC1_MPCBB6_PRIVCFGR1_PRIV26	(0x1u<<26)
#define	GTZC1_MPCBB6_PRIVCFGR1_PRIV25	(0x1u<<25)
#define	GTZC1_MPCBB6_PRIVCFGR1_PRIV24	(0x1u<<24)
#define	GTZC1_MPCBB6_PRIVCFGR1_PRIV23	(0x1u<<23)
#define	GTZC1_MPCBB6_PRIVCFGR1_PRIV22	(0x1u<<22)
#define	GTZC1_MPCBB6_PRIVCFGR1_PRIV21	(0x1u<<21)
#define	GTZC1_MPCBB6_PRIVCFGR1_PRIV20	(0x1u<<20)
#define	GTZC1_MPCBB6_PRIVCFGR1_PRIV19	(0x1u<<19)
#define	GTZC1_MPCBB6_PRIVCFGR1_PRIV18	(0x1u<<18)
#define	GTZC1_MPCBB6_PRIVCFGR1_PRIV17	(0x1u<<17)
#define	GTZC1_MPCBB6_PRIVCFGR1_PRIV16	(0x1u<<16)
#define	GTZC1_MPCBB6_PRIVCFGR1_PRIV15	(0x1u<<15)
#define	GTZC1_MPCBB6_PRIVCFGR1_PRIV14	(0x1u<<14)
#define	GTZC1_MPCBB6_PRIVCFGR1_PRIV13	(0x1u<<13)
#define	GTZC1_MPCBB6_PRIVCFGR1_PRIV12	(0x1u<<12)
#define	GTZC1_MPCBB6_PRIVCFGR1_PRIV11	(0x1u<<11)
#define	GTZC1_MPCBB6_PRIVCFGR1_PRIV10	(0x1u<<10)
#define	GTZC1_MPCBB6_PRIVCFGR1_PRIV9	(0x1u<<9)
#define	GTZC1_MPCBB6_PRIVCFGR1_PRIV8	(0x1u<<8)
#define	GTZC1_MPCBB6_PRIVCFGR1_PRIV7	(0x1u<<7)
#define	GTZC1_MPCBB6_PRIVCFGR1_PRIV6	(0x1u<<6)
#define	GTZC1_MPCBB6_PRIVCFGR1_PRIV5	(0x1u<<5)
#define	GTZC1_MPCBB6_PRIVCFGR1_PRIV4	(0x1u<<4)
#define	GTZC1_MPCBB6_PRIVCFGR1_PRIV3	(0x1u<<3)
#define	GTZC1_MPCBB6_PRIVCFGR1_PRIV2	(0x1u<<2)
#define	GTZC1_MPCBB6_PRIVCFGR1_PRIV1	(0x1u<<1)
#define	GTZC1_MPCBB6_PRIVCFGR1_PRIV0	(0x1u<<0)

// PRIVCFGR2 Configuration

#define	GTZC1_MPCBB6_PRIVCFGR2_PRIV31	(0x1u<<31)
#define	GTZC1_MPCBB6_PRIVCFGR2_PRIV30	(0x1u<<30)
#define	GTZC1_MPCBB6_PRIVCFGR2_PRIV29	(0x1u<<29)
#define	GTZC1_MPCBB6_PRIVCFGR2_PRIV28	(0x1u<<28)
#define	GTZC1_MPCBB6_PRIVCFGR2_PRIV27	(0x1u<<27)
#define	GTZC1_MPCBB6_PRIVCFGR2_PRIV26	(0x1u<<26)
#define	GTZC1_MPCBB6_PRIVCFGR2_PRIV25	(0x1u<<25)
#define	GTZC1_MPCBB6_PRIVCFGR2_PRIV24	(0x1u<<24)
#define	GTZC1_MPCBB6_PRIVCFGR2_PRIV23	(0x1u<<23)
#define	GTZC1_MPCBB6_PRIVCFGR2_PRIV22	(0x1u<<22)
#define	GTZC1_MPCBB6_PRIVCFGR2_PRIV21	(0x1u<<21)
#define	GTZC1_MPCBB6_PRIVCFGR2_PRIV20	(0x1u<<20)
#define	GTZC1_MPCBB6_PRIVCFGR2_PRIV19	(0x1u<<19)
#define	GTZC1_MPCBB6_PRIVCFGR2_PRIV18	(0x1u<<18)
#define	GTZC1_MPCBB6_PRIVCFGR2_PRIV17	(0x1u<<17)
#define	GTZC1_MPCBB6_PRIVCFGR2_PRIV16	(0x1u<<16)
#define	GTZC1_MPCBB6_PRIVCFGR2_PRIV15	(0x1u<<15)
#define	GTZC1_MPCBB6_PRIVCFGR2_PRIV14	(0x1u<<14)
#define	GTZC1_MPCBB6_PRIVCFGR2_PRIV13	(0x1u<<13)
#define	GTZC1_MPCBB6_PRIVCFGR2_PRIV12	(0x1u<<12)
#define	GTZC1_MPCBB6_PRIVCFGR2_PRIV11	(0x1u<<11)
#define	GTZC1_MPCBB6_PRIVCFGR2_PRIV10	(0x1u<<10)
#define	GTZC1_MPCBB6_PRIVCFGR2_PRIV9	(0x1u<<9)
#define	GTZC1_MPCBB6_PRIVCFGR2_PRIV8	(0x1u<<8)
#define	GTZC1_MPCBB6_PRIVCFGR2_PRIV7	(0x1u<<7)
#define	GTZC1_MPCBB6_PRIVCFGR2_PRIV6	(0x1u<<6)
#define	GTZC1_MPCBB6_PRIVCFGR2_PRIV5	(0x1u<<5)
#define	GTZC1_MPCBB6_PRIVCFGR2_PRIV4	(0x1u<<4)
#define	GTZC1_MPCBB6_PRIVCFGR2_PRIV3	(0x1u<<3)
#define	GTZC1_MPCBB6_PRIVCFGR2_PRIV2	(0x1u<<2)
#define	GTZC1_MPCBB6_PRIVCFGR2_PRIV1	(0x1u<<1)
#define	GTZC1_MPCBB6_PRIVCFGR2_PRIV0	(0x1u<<0)

// PRIVCFGR3 Configuration

#define	GTZC1_MPCBB6_PRIVCFGR3_PRIV31	(0x1u<<31)
#define	GTZC1_MPCBB6_PRIVCFGR3_PRIV30	(0x1u<<30)
#define	GTZC1_MPCBB6_PRIVCFGR3_PRIV29	(0x1u<<29)
#define	GTZC1_MPCBB6_PRIVCFGR3_PRIV28	(0x1u<<28)
#define	GTZC1_MPCBB6_PRIVCFGR3_PRIV27	(0x1u<<27)
#define	GTZC1_MPCBB6_PRIVCFGR3_PRIV26	(0x1u<<26)
#define	GTZC1_MPCBB6_PRIVCFGR3_PRIV25	(0x1u<<25)
#define	GTZC1_MPCBB6_PRIVCFGR3_PRIV24	(0x1u<<24)
#define	GTZC1_MPCBB6_PRIVCFGR3_PRIV23	(0x1u<<23)
#define	GTZC1_MPCBB6_PRIVCFGR3_PRIV22	(0x1u<<22)
#define	GTZC1_MPCBB6_PRIVCFGR3_PRIV21	(0x1u<<21)
#define	GTZC1_MPCBB6_PRIVCFGR3_PRIV20	(0x1u<<20)
#define	GTZC1_MPCBB6_PRIVCFGR3_PRIV19	(0x1u<<19)
#define	GTZC1_MPCBB6_PRIVCFGR3_PRIV18	(0x1u<<18)
#define	GTZC1_MPCBB6_PRIVCFGR3_PRIV17	(0x1u<<17)
#define	GTZC1_MPCBB6_PRIVCFGR3_PRIV16	(0x1u<<16)
#define	GTZC1_MPCBB6_PRIVCFGR3_PRIV15	(0x1u<<15)
#define	GTZC1_MPCBB6_PRIVCFGR3_PRIV14	(0x1u<<14)
#define	GTZC1_MPCBB6_PRIVCFGR3_PRIV13	(0x1u<<13)
#define	GTZC1_MPCBB6_PRIVCFGR3_PRIV12	(0x1u<<12)
#define	GTZC1_MPCBB6_PRIVCFGR3_PRIV11	(0x1u<<11)
#define	GTZC1_MPCBB6_PRIVCFGR3_PRIV10	(0x1u<<10)
#define	GTZC1_MPCBB6_PRIVCFGR3_PRIV9	(0x1u<<9)
#define	GTZC1_MPCBB6_PRIVCFGR3_PRIV8	(0x1u<<8)
#define	GTZC1_MPCBB6_PRIVCFGR3_PRIV7	(0x1u<<7)
#define	GTZC1_MPCBB6_PRIVCFGR3_PRIV6	(0x1u<<6)
#define	GTZC1_MPCBB6_PRIVCFGR3_PRIV5	(0x1u<<5)
#define	GTZC1_MPCBB6_PRIVCFGR3_PRIV4	(0x1u<<4)
#define	GTZC1_MPCBB6_PRIVCFGR3_PRIV3	(0x1u<<3)
#define	GTZC1_MPCBB6_PRIVCFGR3_PRIV2	(0x1u<<2)
#define	GTZC1_MPCBB6_PRIVCFGR3_PRIV1	(0x1u<<1)
#define	GTZC1_MPCBB6_PRIVCFGR3_PRIV0	(0x1u<<0)

// PRIVCFGR4 Configuration

#define	GTZC1_MPCBB6_PRIVCFGR4_PRIV31	(0x1u<<31)
#define	GTZC1_MPCBB6_PRIVCFGR4_PRIV30	(0x1u<<30)
#define	GTZC1_MPCBB6_PRIVCFGR4_PRIV29	(0x1u<<29)
#define	GTZC1_MPCBB6_PRIVCFGR4_PRIV28	(0x1u<<28)
#define	GTZC1_MPCBB6_PRIVCFGR4_PRIV27	(0x1u<<27)
#define	GTZC1_MPCBB6_PRIVCFGR4_PRIV26	(0x1u<<26)
#define	GTZC1_MPCBB6_PRIVCFGR4_PRIV25	(0x1u<<25)
#define	GTZC1_MPCBB6_PRIVCFGR4_PRIV24	(0x1u<<24)
#define	GTZC1_MPCBB6_PRIVCFGR4_PRIV23	(0x1u<<23)
#define	GTZC1_MPCBB6_PRIVCFGR4_PRIV22	(0x1u<<22)
#define	GTZC1_MPCBB6_PRIVCFGR4_PRIV21	(0x1u<<21)
#define	GTZC1_MPCBB6_PRIVCFGR4_PRIV20	(0x1u<<20)
#define	GTZC1_MPCBB6_PRIVCFGR4_PRIV19	(0x1u<<19)
#define	GTZC1_MPCBB6_PRIVCFGR4_PRIV18	(0x1u<<18)
#define	GTZC1_MPCBB6_PRIVCFGR4_PRIV17	(0x1u<<17)
#define	GTZC1_MPCBB6_PRIVCFGR4_PRIV16	(0x1u<<16)
#define	GTZC1_MPCBB6_PRIVCFGR4_PRIV15	(0x1u<<15)
#define	GTZC1_MPCBB6_PRIVCFGR4_PRIV14	(0x1u<<14)
#define	GTZC1_MPCBB6_PRIVCFGR4_PRIV13	(0x1u<<13)
#define	GTZC1_MPCBB6_PRIVCFGR4_PRIV12	(0x1u<<12)
#define	GTZC1_MPCBB6_PRIVCFGR4_PRIV11	(0x1u<<11)
#define	GTZC1_MPCBB6_PRIVCFGR4_PRIV10	(0x1u<<10)
#define	GTZC1_MPCBB6_PRIVCFGR4_PRIV9	(0x1u<<9)
#define	GTZC1_MPCBB6_PRIVCFGR4_PRIV8	(0x1u<<8)
#define	GTZC1_MPCBB6_PRIVCFGR4_PRIV7	(0x1u<<7)
#define	GTZC1_MPCBB6_PRIVCFGR4_PRIV6	(0x1u<<6)
#define	GTZC1_MPCBB6_PRIVCFGR4_PRIV5	(0x1u<<5)
#define	GTZC1_MPCBB6_PRIVCFGR4_PRIV4	(0x1u<<4)
#define	GTZC1_MPCBB6_PRIVCFGR4_PRIV3	(0x1u<<3)
#define	GTZC1_MPCBB6_PRIVCFGR4_PRIV2	(0x1u<<2)
#define	GTZC1_MPCBB6_PRIVCFGR4_PRIV1	(0x1u<<1)
#define	GTZC1_MPCBB6_PRIVCFGR4_PRIV0	(0x1u<<0)

// PRIVCFGR5 Configuration

#define	GTZC1_MPCBB6_PRIVCFGR5_PRIV31	(0x1u<<31)
#define	GTZC1_MPCBB6_PRIVCFGR5_PRIV30	(0x1u<<30)
#define	GTZC1_MPCBB6_PRIVCFGR5_PRIV29	(0x1u<<29)
#define	GTZC1_MPCBB6_PRIVCFGR5_PRIV28	(0x1u<<28)
#define	GTZC1_MPCBB6_PRIVCFGR5_PRIV27	(0x1u<<27)
#define	GTZC1_MPCBB6_PRIVCFGR5_PRIV26	(0x1u<<26)
#define	GTZC1_MPCBB6_PRIVCFGR5_PRIV25	(0x1u<<25)
#define	GTZC1_MPCBB6_PRIVCFGR5_PRIV24	(0x1u<<24)
#define	GTZC1_MPCBB6_PRIVCFGR5_PRIV23	(0x1u<<23)
#define	GTZC1_MPCBB6_PRIVCFGR5_PRIV22	(0x1u<<22)
#define	GTZC1_MPCBB6_PRIVCFGR5_PRIV21	(0x1u<<21)
#define	GTZC1_MPCBB6_PRIVCFGR5_PRIV20	(0x1u<<20)
#define	GTZC1_MPCBB6_PRIVCFGR5_PRIV19	(0x1u<<19)
#define	GTZC1_MPCBB6_PRIVCFGR5_PRIV18	(0x1u<<18)
#define	GTZC1_MPCBB6_PRIVCFGR5_PRIV17	(0x1u<<17)
#define	GTZC1_MPCBB6_PRIVCFGR5_PRIV16	(0x1u<<16)
#define	GTZC1_MPCBB6_PRIVCFGR5_PRIV15	(0x1u<<15)
#define	GTZC1_MPCBB6_PRIVCFGR5_PRIV14	(0x1u<<14)
#define	GTZC1_MPCBB6_PRIVCFGR5_PRIV13	(0x1u<<13)
#define	GTZC1_MPCBB6_PRIVCFGR5_PRIV12	(0x1u<<12)
#define	GTZC1_MPCBB6_PRIVCFGR5_PRIV11	(0x1u<<11)
#define	GTZC1_MPCBB6_PRIVCFGR5_PRIV10	(0x1u<<10)
#define	GTZC1_MPCBB6_PRIVCFGR5_PRIV9	(0x1u<<9)
#define	GTZC1_MPCBB6_PRIVCFGR5_PRIV8	(0x1u<<8)
#define	GTZC1_MPCBB6_PRIVCFGR5_PRIV7	(0x1u<<7)
#define	GTZC1_MPCBB6_PRIVCFGR5_PRIV6	(0x1u<<6)
#define	GTZC1_MPCBB6_PRIVCFGR5_PRIV5	(0x1u<<5)
#define	GTZC1_MPCBB6_PRIVCFGR5_PRIV4	(0x1u<<4)
#define	GTZC1_MPCBB6_PRIVCFGR5_PRIV3	(0x1u<<3)
#define	GTZC1_MPCBB6_PRIVCFGR5_PRIV2	(0x1u<<2)
#define	GTZC1_MPCBB6_PRIVCFGR5_PRIV1	(0x1u<<1)
#define	GTZC1_MPCBB6_PRIVCFGR5_PRIV0	(0x1u<<0)

// PRIVCFGR6 Configuration

