Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32U5G9/Includes/Registers/stm32U5Gx_gtzc1_mpcbb6.h
#define	GTZC1_MPCBB6_PRIVCFGR6_PRIV31	(0x1u<<31)
#define	GTZC1_MPCBB6_PRIVCFGR6_PRIV30	(0x1u<<30)
#define	GTZC1_MPCBB6_PRIVCFGR6_PRIV29	(0x1u<<29)
#define	GTZC1_MPCBB6_PRIVCFGR6_PRIV28	(0x1u<<28)
#define	GTZC1_MPCBB6_PRIVCFGR6_PRIV27	(0x1u<<27)
#define	GTZC1_MPCBB6_PRIVCFGR6_PRIV26	(0x1u<<26)
#define	GTZC1_MPCBB6_PRIVCFGR6_PRIV25	(0x1u<<25)
#define	GTZC1_MPCBB6_PRIVCFGR6_PRIV24	(0x1u<<24)
#define	GTZC1_MPCBB6_PRIVCFGR6_PRIV23	(0x1u<<23)
#define	GTZC1_MPCBB6_PRIVCFGR6_PRIV22	(0x1u<<22)
#define	GTZC1_MPCBB6_PRIVCFGR6_PRIV21	(0x1u<<21)
#define	GTZC1_MPCBB6_PRIVCFGR6_PRIV20	(0x1u<<20)
#define	GTZC1_MPCBB6_PRIVCFGR6_PRIV19	(0x1u<<19)
#define	GTZC1_MPCBB6_PRIVCFGR6_PRIV18	(0x1u<<18)
#define	GTZC1_MPCBB6_PRIVCFGR6_PRIV17	(0x1u<<17)
#define	GTZC1_MPCBB6_PRIVCFGR6_PRIV16	(0x1u<<16)
#define	GTZC1_MPCBB6_PRIVCFGR6_PRIV15	(0x1u<<15)
#define	GTZC1_MPCBB6_PRIVCFGR6_PRIV14	(0x1u<<14)
#define	GTZC1_MPCBB6_PRIVCFGR6_PRIV13	(0x1u<<13)
#define	GTZC1_MPCBB6_PRIVCFGR6_PRIV12	(0x1u<<12)
#define	GTZC1_MPCBB6_PRIVCFGR6_PRIV11	(0x1u<<11)
#define	GTZC1_MPCBB6_PRIVCFGR6_PRIV10	(0x1u<<10)
#define	GTZC1_MPCBB6_PRIVCFGR6_PRIV9	(0x1u<<9)
#define	GTZC1_MPCBB6_PRIVCFGR6_PRIV8	(0x1u<<8)
#define	GTZC1_MPCBB6_PRIVCFGR6_PRIV7	(0x1u<<7)
#define	GTZC1_MPCBB6_PRIVCFGR6_PRIV6	(0x1u<<6)
#define	GTZC1_MPCBB6_PRIVCFGR6_PRIV5	(0x1u<<5)
#define	GTZC1_MPCBB6_PRIVCFGR6_PRIV4	(0x1u<<4)
#define	GTZC1_MPCBB6_PRIVCFGR6_PRIV3	(0x1u<<3)
#define	GTZC1_MPCBB6_PRIVCFGR6_PRIV2	(0x1u<<2)
#define	GTZC1_MPCBB6_PRIVCFGR6_PRIV1	(0x1u<<1)
#define	GTZC1_MPCBB6_PRIVCFGR6_PRIV0	(0x1u<<0)

// PRIVCFGR7 Configuration

#define	GTZC1_MPCBB6_PRIVCFGR7_PRIV31	(0x1u<<31)
#define	GTZC1_MPCBB6_PRIVCFGR7_PRIV30	(0x1u<<30)
#define	GTZC1_MPCBB6_PRIVCFGR7_PRIV29	(0x1u<<29)
#define	GTZC1_MPCBB6_PRIVCFGR7_PRIV28	(0x1u<<28)
#define	GTZC1_MPCBB6_PRIVCFGR7_PRIV27	(0x1u<<27)
#define	GTZC1_MPCBB6_PRIVCFGR7_PRIV26	(0x1u<<26)
#define	GTZC1_MPCBB6_PRIVCFGR7_PRIV25	(0x1u<<25)
#define	GTZC1_MPCBB6_PRIVCFGR7_PRIV24	(0x1u<<24)
#define	GTZC1_MPCBB6_PRIVCFGR7_PRIV23	(0x1u<<23)
#define	GTZC1_MPCBB6_PRIVCFGR7_PRIV22	(0x1u<<22)
#define	GTZC1_MPCBB6_PRIVCFGR7_PRIV21	(0x1u<<21)
#define	GTZC1_MPCBB6_PRIVCFGR7_PRIV20	(0x1u<<20)
#define	GTZC1_MPCBB6_PRIVCFGR7_PRIV19	(0x1u<<19)
#define	GTZC1_MPCBB6_PRIVCFGR7_PRIV18	(0x1u<<18)
#define	GTZC1_MPCBB6_PRIVCFGR7_PRIV17	(0x1u<<17)
#define	GTZC1_MPCBB6_PRIVCFGR7_PRIV16	(0x1u<<16)
#define	GTZC1_MPCBB6_PRIVCFGR7_PRIV15	(0x1u<<15)
#define	GTZC1_MPCBB6_PRIVCFGR7_PRIV14	(0x1u<<14)
#define	GTZC1_MPCBB6_PRIVCFGR7_PRIV13	(0x1u<<13)
#define	GTZC1_MPCBB6_PRIVCFGR7_PRIV12	(0x1u<<12)
#define	GTZC1_MPCBB6_PRIVCFGR7_PRIV11	(0x1u<<11)
#define	GTZC1_MPCBB6_PRIVCFGR7_PRIV10	(0x1u<<10)
#define	GTZC1_MPCBB6_PRIVCFGR7_PRIV9	(0x1u<<9)
#define	GTZC1_MPCBB6_PRIVCFGR7_PRIV8	(0x1u<<8)
#define	GTZC1_MPCBB6_PRIVCFGR7_PRIV7	(0x1u<<7)
#define	GTZC1_MPCBB6_PRIVCFGR7_PRIV6	(0x1u<<6)
#define	GTZC1_MPCBB6_PRIVCFGR7_PRIV5	(0x1u<<5)
#define	GTZC1_MPCBB6_PRIVCFGR7_PRIV4	(0x1u<<4)
#define	GTZC1_MPCBB6_PRIVCFGR7_PRIV3	(0x1u<<3)
#define	GTZC1_MPCBB6_PRIVCFGR7_PRIV2	(0x1u<<2)
#define	GTZC1_MPCBB6_PRIVCFGR7_PRIV1	(0x1u<<1)
#define	GTZC1_MPCBB6_PRIVCFGR7_PRIV0	(0x1u<<0)

// PRIVCFGR8 Configuration

#define	GTZC1_MPCBB6_PRIVCFGR8_PRIV31	(0x1u<<31)
#define	GTZC1_MPCBB6_PRIVCFGR8_PRIV30	(0x1u<<30)
#define	GTZC1_MPCBB6_PRIVCFGR8_PRIV29	(0x1u<<29)
#define	GTZC1_MPCBB6_PRIVCFGR8_PRIV28	(0x1u<<28)
#define	GTZC1_MPCBB6_PRIVCFGR8_PRIV27	(0x1u<<27)
#define	GTZC1_MPCBB6_PRIVCFGR8_PRIV26	(0x1u<<26)
#define	GTZC1_MPCBB6_PRIVCFGR8_PRIV25	(0x1u<<25)
#define	GTZC1_MPCBB6_PRIVCFGR8_PRIV24	(0x1u<<24)
#define	GTZC1_MPCBB6_PRIVCFGR8_PRIV23	(0x1u<<23)
#define	GTZC1_MPCBB6_PRIVCFGR8_PRIV22	(0x1u<<22)
#define	GTZC1_MPCBB6_PRIVCFGR8_PRIV21	(0x1u<<21)
#define	GTZC1_MPCBB6_PRIVCFGR8_PRIV20	(0x1u<<20)
#define	GTZC1_MPCBB6_PRIVCFGR8_PRIV19	(0x1u<<19)
#define	GTZC1_MPCBB6_PRIVCFGR8_PRIV18	(0x1u<<18)
#define	GTZC1_MPCBB6_PRIVCFGR8_PRIV17	(0x1u<<17)
#define	GTZC1_MPCBB6_PRIVCFGR8_PRIV16	(0x1u<<16)
#define	GTZC1_MPCBB6_PRIVCFGR8_PRIV15	(0x1u<<15)
#define	GTZC1_MPCBB6_PRIVCFGR8_PRIV14	(0x1u<<14)
#define	GTZC1_MPCBB6_PRIVCFGR8_PRIV13	(0x1u<<13)
#define	GTZC1_MPCBB6_PRIVCFGR8_PRIV12	(0x1u<<12)
#define	GTZC1_MPCBB6_PRIVCFGR8_PRIV11	(0x1u<<11)
#define	GTZC1_MPCBB6_PRIVCFGR8_PRIV10	(0x1u<<10)
#define	GTZC1_MPCBB6_PRIVCFGR8_PRIV9	(0x1u<<9)
#define	GTZC1_MPCBB6_PRIVCFGR8_PRIV8	(0x1u<<8)
#define	GTZC1_MPCBB6_PRIVCFGR8_PRIV7	(0x1u<<7)
#define	GTZC1_MPCBB6_PRIVCFGR8_PRIV6	(0x1u<<6)
#define	GTZC1_MPCBB6_PRIVCFGR8_PRIV5	(0x1u<<5)
#define	GTZC1_MPCBB6_PRIVCFGR8_PRIV4	(0x1u<<4)
#define	GTZC1_MPCBB6_PRIVCFGR8_PRIV3	(0x1u<<3)
#define	GTZC1_MPCBB6_PRIVCFGR8_PRIV2	(0x1u<<2)
#define	GTZC1_MPCBB6_PRIVCFGR8_PRIV1	(0x1u<<1)
#define	GTZC1_MPCBB6_PRIVCFGR8_PRIV0	(0x1u<<0)

// PRIVCFGR9 Configuration

#define	GTZC1_MPCBB6_PRIVCFGR9_PRIV31	(0x1u<<31)
#define	GTZC1_MPCBB6_PRIVCFGR9_PRIV30	(0x1u<<30)
#define	GTZC1_MPCBB6_PRIVCFGR9_PRIV29	(0x1u<<29)
#define	GTZC1_MPCBB6_PRIVCFGR9_PRIV28	(0x1u<<28)
#define	GTZC1_MPCBB6_PRIVCFGR9_PRIV27	(0x1u<<27)
#define	GTZC1_MPCBB6_PRIVCFGR9_PRIV26	(0x1u<<26)
#define	GTZC1_MPCBB6_PRIVCFGR9_PRIV25	(0x1u<<25)
#define	GTZC1_MPCBB6_PRIVCFGR9_PRIV24	(0x1u<<24)
#define	GTZC1_MPCBB6_PRIVCFGR9_PRIV23	(0x1u<<23)
#define	GTZC1_MPCBB6_PRIVCFGR9_PRIV22	(0x1u<<22)
#define	GTZC1_MPCBB6_PRIVCFGR9_PRIV21	(0x1u<<21)
#define	GTZC1_MPCBB6_PRIVCFGR9_PRIV20	(0x1u<<20)
#define	GTZC1_MPCBB6_PRIVCFGR9_PRIV19	(0x1u<<19)
#define	GTZC1_MPCBB6_PRIVCFGR9_PRIV18	(0x1u<<18)
#define	GTZC1_MPCBB6_PRIVCFGR9_PRIV17	(0x1u<<17)
#define	GTZC1_MPCBB6_PRIVCFGR9_PRIV16	(0x1u<<16)
#define	GTZC1_MPCBB6_PRIVCFGR9_PRIV15	(0x1u<<15)
#define	GTZC1_MPCBB6_PRIVCFGR9_PRIV14	(0x1u<<14)
#define	GTZC1_MPCBB6_PRIVCFGR9_PRIV13	(0x1u<<13)
#define	GTZC1_MPCBB6_PRIVCFGR9_PRIV12	(0x1u<<12)
#define	GTZC1_MPCBB6_PRIVCFGR9_PRIV11	(0x1u<<11)
#define	GTZC1_MPCBB6_PRIVCFGR9_PRIV10	(0x1u<<10)
#define	GTZC1_MPCBB6_PRIVCFGR9_PRIV9	(0x1u<<9)
#define	GTZC1_MPCBB6_PRIVCFGR9_PRIV8	(0x1u<<8)
#define	GTZC1_MPCBB6_PRIVCFGR9_PRIV7	(0x1u<<7)
#define	GTZC1_MPCBB6_PRIVCFGR9_PRIV6	(0x1u<<6)
#define	GTZC1_MPCBB6_PRIVCFGR9_PRIV5	(0x1u<<5)
#define	GTZC1_MPCBB6_PRIVCFGR9_PRIV4	(0x1u<<4)
#define	GTZC1_MPCBB6_PRIVCFGR9_PRIV3	(0x1u<<3)
#define	GTZC1_MPCBB6_PRIVCFGR9_PRIV2	(0x1u<<2)
#define	GTZC1_MPCBB6_PRIVCFGR9_PRIV1	(0x1u<<1)
#define	GTZC1_MPCBB6_PRIVCFGR9_PRIV0	(0x1u<<0)

// PRIVCFGR10 Configuration

#define	GTZC1_MPCBB6_PRIVCFGR10_PRIV31	(0x1u<<31)
#define	GTZC1_MPCBB6_PRIVCFGR10_PRIV30	(0x1u<<30)
#define	GTZC1_MPCBB6_PRIVCFGR10_PRIV29	(0x1u<<29)
#define	GTZC1_MPCBB6_PRIVCFGR10_PRIV28	(0x1u<<28)
#define	GTZC1_MPCBB6_PRIVCFGR10_PRIV27	(0x1u<<27)
#define	GTZC1_MPCBB6_PRIVCFGR10_PRIV26	(0x1u<<26)
#define	GTZC1_MPCBB6_PRIVCFGR10_PRIV25	(0x1u<<25)
#define	GTZC1_MPCBB6_PRIVCFGR10_PRIV24	(0x1u<<24)
#define	GTZC1_MPCBB6_PRIVCFGR10_PRIV23	(0x1u<<23)
#define	GTZC1_MPCBB6_PRIVCFGR10_PRIV22	(0x1u<<22)
#define	GTZC1_MPCBB6_PRIVCFGR10_PRIV21	(0x1u<<21)
#define	GTZC1_MPCBB6_PRIVCFGR10_PRIV20	(0x1u<<20)
#define	GTZC1_MPCBB6_PRIVCFGR10_PRIV19	(0x1u<<19)
#define	GTZC1_MPCBB6_PRIVCFGR10_PRIV18	(0x1u<<18)
#define	GTZC1_MPCBB6_PRIVCFGR10_PRIV17	(0x1u<<17)
#define	GTZC1_MPCBB6_PRIVCFGR10_PRIV16	(0x1u<<16)
#define	GTZC1_MPCBB6_PRIVCFGR10_PRIV15	(0x1u<<15)
#define	GTZC1_MPCBB6_PRIVCFGR10_PRIV14	(0x1u<<14)
#define	GTZC1_MPCBB6_PRIVCFGR10_PRIV13	(0x1u<<13)
#define	GTZC1_MPCBB6_PRIVCFGR10_PRIV12	(0x1u<<12)
#define	GTZC1_MPCBB6_PRIVCFGR10_PRIV11	(0x1u<<11)
#define	GTZC1_MPCBB6_PRIVCFGR10_PRIV10	(0x1u<<10)
#define	GTZC1_MPCBB6_PRIVCFGR10_PRIV9	(0x1u<<9)
#define	GTZC1_MPCBB6_PRIVCFGR10_PRIV8	(0x1u<<8)
#define	GTZC1_MPCBB6_PRIVCFGR10_PRIV7	(0x1u<<7)
#define	GTZC1_MPCBB6_PRIVCFGR10_PRIV6	(0x1u<<6)
#define	GTZC1_MPCBB6_PRIVCFGR10_PRIV5	(0x1u<<5)
#define	GTZC1_MPCBB6_PRIVCFGR10_PRIV4	(0x1u<<4)
#define	GTZC1_MPCBB6_PRIVCFGR10_PRIV3	(0x1u<<3)
#define	GTZC1_MPCBB6_PRIVCFGR10_PRIV2	(0x1u<<2)
#define	GTZC1_MPCBB6_PRIVCFGR10_PRIV1	(0x1u<<1)
#define	GTZC1_MPCBB6_PRIVCFGR10_PRIV0	(0x1u<<0)

// PRIVCFGR11 Configuration

#define	GTZC1_MPCBB6_PRIVCFGR11_PRIV31	(0x1u<<31)
#define	GTZC1_MPCBB6_PRIVCFGR11_PRIV30	(0x1u<<30)
#define	GTZC1_MPCBB6_PRIVCFGR11_PRIV29	(0x1u<<29)
#define	GTZC1_MPCBB6_PRIVCFGR11_PRIV28	(0x1u<<28)
#define	GTZC1_MPCBB6_PRIVCFGR11_PRIV27	(0x1u<<27)
#define	GTZC1_MPCBB6_PRIVCFGR11_PRIV26	(0x1u<<26)
#define	GTZC1_MPCBB6_PRIVCFGR11_PRIV25	(0x1u<<25)
#define	GTZC1_MPCBB6_PRIVCFGR11_PRIV24	(0x1u<<24)
#define	GTZC1_MPCBB6_PRIVCFGR11_PRIV23	(0x1u<<23)
#define	GTZC1_MPCBB6_PRIVCFGR11_PRIV22	(0x1u<<22)
#define	GTZC1_MPCBB6_PRIVCFGR11_PRIV21	(0x1u<<21)
#define	GTZC1_MPCBB6_PRIVCFGR11_PRIV20	(0x1u<<20)
#define	GTZC1_MPCBB6_PRIVCFGR11_PRIV19	(0x1u<<19)
#define	GTZC1_MPCBB6_PRIVCFGR11_PRIV18	(0x1u<<18)
#define	GTZC1_MPCBB6_PRIVCFGR11_PRIV17	(0x1u<<17)
#define	GTZC1_MPCBB6_PRIVCFGR11_PRIV16	(0x1u<<16)
#define	GTZC1_MPCBB6_PRIVCFGR11_PRIV15	(0x1u<<15)
#define	GTZC1_MPCBB6_PRIVCFGR11_PRIV14	(0x1u<<14)
#define	GTZC1_MPCBB6_PRIVCFGR11_PRIV13	(0x1u<<13)
#define	GTZC1_MPCBB6_PRIVCFGR11_PRIV12	(0x1u<<12)
#define	GTZC1_MPCBB6_PRIVCFGR11_PRIV11	(0x1u<<11)
#define	GTZC1_MPCBB6_PRIVCFGR11_PRIV10	(0x1u<<10)
#define	GTZC1_MPCBB6_PRIVCFGR11_PRIV9	(0x1u<<9)
#define	GTZC1_MPCBB6_PRIVCFGR11_PRIV8	(0x1u<<8)
#define	GTZC1_MPCBB6_PRIVCFGR11_PRIV7	(0x1u<<7)
#define	GTZC1_MPCBB6_PRIVCFGR11_PRIV6	(0x1u<<6)
#define	GTZC1_MPCBB6_PRIVCFGR11_PRIV5	(0x1u<<5)
#define	GTZC1_MPCBB6_PRIVCFGR11_PRIV4	(0x1u<<4)
#define	GTZC1_MPCBB6_PRIVCFGR11_PRIV3	(0x1u<<3)
#define	GTZC1_MPCBB6_PRIVCFGR11_PRIV2	(0x1u<<2)
#define	GTZC1_MPCBB6_PRIVCFGR11_PRIV1	(0x1u<<1)
#define	GTZC1_MPCBB6_PRIVCFGR11_PRIV0	(0x1u<<0)

