Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32U5G9/Includes/Registers/stm32U5Gx_gtzc1_mpcbb6.h
// PRIVCFGR24 Configuration

#define	GTZC1_MPCBB6_PRIVCFGR24_PRIV31	(0x1u<<31)
#define	GTZC1_MPCBB6_PRIVCFGR24_PRIV30	(0x1u<<30)
#define	GTZC1_MPCBB6_PRIVCFGR24_PRIV29	(0x1u<<29)
#define	GTZC1_MPCBB6_PRIVCFGR24_PRIV28	(0x1u<<28)
#define	GTZC1_MPCBB6_PRIVCFGR24_PRIV27	(0x1u<<27)
#define	GTZC1_MPCBB6_PRIVCFGR24_PRIV26	(0x1u<<26)
#define	GTZC1_MPCBB6_PRIVCFGR24_PRIV25	(0x1u<<25)
#define	GTZC1_MPCBB6_PRIVCFGR24_PRIV24	(0x1u<<24)
#define	GTZC1_MPCBB6_PRIVCFGR24_PRIV23	(0x1u<<23)
#define	GTZC1_MPCBB6_PRIVCFGR24_PRIV22	(0x1u<<22)
#define	GTZC1_MPCBB6_PRIVCFGR24_PRIV21	(0x1u<<21)
#define	GTZC1_MPCBB6_PRIVCFGR24_PRIV20	(0x1u<<20)
#define	GTZC1_MPCBB6_PRIVCFGR24_PRIV19	(0x1u<<19)
#define	GTZC1_MPCBB6_PRIVCFGR24_PRIV18	(0x1u<<18)
#define	GTZC1_MPCBB6_PRIVCFGR24_PRIV17	(0x1u<<17)
#define	GTZC1_MPCBB6_PRIVCFGR24_PRIV16	(0x1u<<16)
#define	GTZC1_MPCBB6_PRIVCFGR24_PRIV15	(0x1u<<15)
#define	GTZC1_MPCBB6_PRIVCFGR24_PRIV14	(0x1u<<14)
#define	GTZC1_MPCBB6_PRIVCFGR24_PRIV13	(0x1u<<13)
#define	GTZC1_MPCBB6_PRIVCFGR24_PRIV12	(0x1u<<12)
#define	GTZC1_MPCBB6_PRIVCFGR24_PRIV11	(0x1u<<11)
#define	GTZC1_MPCBB6_PRIVCFGR24_PRIV10	(0x1u<<10)
#define	GTZC1_MPCBB6_PRIVCFGR24_PRIV9	(0x1u<<9)
#define	GTZC1_MPCBB6_PRIVCFGR24_PRIV8	(0x1u<<8)
#define	GTZC1_MPCBB6_PRIVCFGR24_PRIV7	(0x1u<<7)
#define	GTZC1_MPCBB6_PRIVCFGR24_PRIV6	(0x1u<<6)
#define	GTZC1_MPCBB6_PRIVCFGR24_PRIV5	(0x1u<<5)
#define	GTZC1_MPCBB6_PRIVCFGR24_PRIV4	(0x1u<<4)
#define	GTZC1_MPCBB6_PRIVCFGR24_PRIV3	(0x1u<<3)
#define	GTZC1_MPCBB6_PRIVCFGR24_PRIV2	(0x1u<<2)
#define	GTZC1_MPCBB6_PRIVCFGR24_PRIV1	(0x1u<<1)
#define	GTZC1_MPCBB6_PRIVCFGR24_PRIV0	(0x1u<<0)

// PRIVCFGR25 Configuration

#define	GTZC1_MPCBB6_PRIVCFGR25_PRIV31	(0x1u<<31)
#define	GTZC1_MPCBB6_PRIVCFGR25_PRIV30	(0x1u<<30)
#define	GTZC1_MPCBB6_PRIVCFGR25_PRIV29	(0x1u<<29)
#define	GTZC1_MPCBB6_PRIVCFGR25_PRIV28	(0x1u<<28)
#define	GTZC1_MPCBB6_PRIVCFGR25_PRIV27	(0x1u<<27)
#define	GTZC1_MPCBB6_PRIVCFGR25_PRIV26	(0x1u<<26)
#define	GTZC1_MPCBB6_PRIVCFGR25_PRIV25	(0x1u<<25)
#define	GTZC1_MPCBB6_PRIVCFGR25_PRIV24	(0x1u<<24)
#define	GTZC1_MPCBB6_PRIVCFGR25_PRIV23	(0x1u<<23)
#define	GTZC1_MPCBB6_PRIVCFGR25_PRIV22	(0x1u<<22)
#define	GTZC1_MPCBB6_PRIVCFGR25_PRIV21	(0x1u<<21)
#define	GTZC1_MPCBB6_PRIVCFGR25_PRIV20	(0x1u<<20)
#define	GTZC1_MPCBB6_PRIVCFGR25_PRIV19	(0x1u<<19)
#define	GTZC1_MPCBB6_PRIVCFGR25_PRIV18	(0x1u<<18)
#define	GTZC1_MPCBB6_PRIVCFGR25_PRIV17	(0x1u<<17)
#define	GTZC1_MPCBB6_PRIVCFGR25_PRIV16	(0x1u<<16)
#define	GTZC1_MPCBB6_PRIVCFGR25_PRIV15	(0x1u<<15)
#define	GTZC1_MPCBB6_PRIVCFGR25_PRIV14	(0x1u<<14)
#define	GTZC1_MPCBB6_PRIVCFGR25_PRIV13	(0x1u<<13)
#define	GTZC1_MPCBB6_PRIVCFGR25_PRIV12	(0x1u<<12)
#define	GTZC1_MPCBB6_PRIVCFGR25_PRIV11	(0x1u<<11)
#define	GTZC1_MPCBB6_PRIVCFGR25_PRIV10	(0x1u<<10)
#define	GTZC1_MPCBB6_PRIVCFGR25_PRIV9	(0x1u<<9)
#define	GTZC1_MPCBB6_PRIVCFGR25_PRIV8	(0x1u<<8)
#define	GTZC1_MPCBB6_PRIVCFGR25_PRIV7	(0x1u<<7)
#define	GTZC1_MPCBB6_PRIVCFGR25_PRIV6	(0x1u<<6)
#define	GTZC1_MPCBB6_PRIVCFGR25_PRIV5	(0x1u<<5)
#define	GTZC1_MPCBB6_PRIVCFGR25_PRIV4	(0x1u<<4)
#define	GTZC1_MPCBB6_PRIVCFGR25_PRIV3	(0x1u<<3)
#define	GTZC1_MPCBB6_PRIVCFGR25_PRIV2	(0x1u<<2)
#define	GTZC1_MPCBB6_PRIVCFGR25_PRIV1	(0x1u<<1)
#define	GTZC1_MPCBB6_PRIVCFGR25_PRIV0	(0x1u<<0)

// PRIVCFGR26 Configuration

#define	GTZC1_MPCBB6_PRIVCFGR26_PRIV31	(0x1u<<31)
#define	GTZC1_MPCBB6_PRIVCFGR26_PRIV30	(0x1u<<30)
#define	GTZC1_MPCBB6_PRIVCFGR26_PRIV29	(0x1u<<29)
#define	GTZC1_MPCBB6_PRIVCFGR26_PRIV28	(0x1u<<28)
#define	GTZC1_MPCBB6_PRIVCFGR26_PRIV27	(0x1u<<27)
#define	GTZC1_MPCBB6_PRIVCFGR26_PRIV26	(0x1u<<26)
#define	GTZC1_MPCBB6_PRIVCFGR26_PRIV25	(0x1u<<25)
#define	GTZC1_MPCBB6_PRIVCFGR26_PRIV24	(0x1u<<24)
#define	GTZC1_MPCBB6_PRIVCFGR26_PRIV23	(0x1u<<23)
#define	GTZC1_MPCBB6_PRIVCFGR26_PRIV22	(0x1u<<22)
#define	GTZC1_MPCBB6_PRIVCFGR26_PRIV21	(0x1u<<21)
#define	GTZC1_MPCBB6_PRIVCFGR26_PRIV20	(0x1u<<20)
#define	GTZC1_MPCBB6_PRIVCFGR26_PRIV19	(0x1u<<19)
#define	GTZC1_MPCBB6_PRIVCFGR26_PRIV18	(0x1u<<18)
#define	GTZC1_MPCBB6_PRIVCFGR26_PRIV17	(0x1u<<17)
#define	GTZC1_MPCBB6_PRIVCFGR26_PRIV16	(0x1u<<16)
#define	GTZC1_MPCBB6_PRIVCFGR26_PRIV15	(0x1u<<15)
#define	GTZC1_MPCBB6_PRIVCFGR26_PRIV14	(0x1u<<14)
#define	GTZC1_MPCBB6_PRIVCFGR26_PRIV13	(0x1u<<13)
#define	GTZC1_MPCBB6_PRIVCFGR26_PRIV12	(0x1u<<12)
#define	GTZC1_MPCBB6_PRIVCFGR26_PRIV11	(0x1u<<11)
#define	GTZC1_MPCBB6_PRIVCFGR26_PRIV10	(0x1u<<10)
#define	GTZC1_MPCBB6_PRIVCFGR26_PRIV9	(0x1u<<9)
#define	GTZC1_MPCBB6_PRIVCFGR26_PRIV8	(0x1u<<8)
#define	GTZC1_MPCBB6_PRIVCFGR26_PRIV7	(0x1u<<7)
#define	GTZC1_MPCBB6_PRIVCFGR26_PRIV6	(0x1u<<6)
#define	GTZC1_MPCBB6_PRIVCFGR26_PRIV5	(0x1u<<5)
#define	GTZC1_MPCBB6_PRIVCFGR26_PRIV4	(0x1u<<4)
#define	GTZC1_MPCBB6_PRIVCFGR26_PRIV3	(0x1u<<3)
#define	GTZC1_MPCBB6_PRIVCFGR26_PRIV2	(0x1u<<2)
#define	GTZC1_MPCBB6_PRIVCFGR26_PRIV1	(0x1u<<1)
#define	GTZC1_MPCBB6_PRIVCFGR26_PRIV0	(0x1u<<0)

// PRIVCFGR27 Configuration

#define	GTZC1_MPCBB6_PRIVCFGR27_PRIV31	(0x1u<<31)
#define	GTZC1_MPCBB6_PRIVCFGR27_PRIV30	(0x1u<<30)
#define	GTZC1_MPCBB6_PRIVCFGR27_PRIV29	(0x1u<<29)
#define	GTZC1_MPCBB6_PRIVCFGR27_PRIV28	(0x1u<<28)
#define	GTZC1_MPCBB6_PRIVCFGR27_PRIV27	(0x1u<<27)
#define	GTZC1_MPCBB6_PRIVCFGR27_PRIV26	(0x1u<<26)
#define	GTZC1_MPCBB6_PRIVCFGR27_PRIV25	(0x1u<<25)
#define	GTZC1_MPCBB6_PRIVCFGR27_PRIV24	(0x1u<<24)
#define	GTZC1_MPCBB6_PRIVCFGR27_PRIV23	(0x1u<<23)
#define	GTZC1_MPCBB6_PRIVCFGR27_PRIV22	(0x1u<<22)
#define	GTZC1_MPCBB6_PRIVCFGR27_PRIV21	(0x1u<<21)
#define	GTZC1_MPCBB6_PRIVCFGR27_PRIV20	(0x1u<<20)
#define	GTZC1_MPCBB6_PRIVCFGR27_PRIV19	(0x1u<<19)
#define	GTZC1_MPCBB6_PRIVCFGR27_PRIV18	(0x1u<<18)
#define	GTZC1_MPCBB6_PRIVCFGR27_PRIV17	(0x1u<<17)
#define	GTZC1_MPCBB6_PRIVCFGR27_PRIV16	(0x1u<<16)
#define	GTZC1_MPCBB6_PRIVCFGR27_PRIV15	(0x1u<<15)
#define	GTZC1_MPCBB6_PRIVCFGR27_PRIV14	(0x1u<<14)
#define	GTZC1_MPCBB6_PRIVCFGR27_PRIV13	(0x1u<<13)
#define	GTZC1_MPCBB6_PRIVCFGR27_PRIV12	(0x1u<<12)
#define	GTZC1_MPCBB6_PRIVCFGR27_PRIV11	(0x1u<<11)
#define	GTZC1_MPCBB6_PRIVCFGR27_PRIV10	(0x1u<<10)
#define	GTZC1_MPCBB6_PRIVCFGR27_PRIV9	(0x1u<<9)
#define	GTZC1_MPCBB6_PRIVCFGR27_PRIV8	(0x1u<<8)
#define	GTZC1_MPCBB6_PRIVCFGR27_PRIV7	(0x1u<<7)
#define	GTZC1_MPCBB6_PRIVCFGR27_PRIV6	(0x1u<<6)
#define	GTZC1_MPCBB6_PRIVCFGR27_PRIV5	(0x1u<<5)
#define	GTZC1_MPCBB6_PRIVCFGR27_PRIV4	(0x1u<<4)
#define	GTZC1_MPCBB6_PRIVCFGR27_PRIV3	(0x1u<<3)
#define	GTZC1_MPCBB6_PRIVCFGR27_PRIV2	(0x1u<<2)
#define	GTZC1_MPCBB6_PRIVCFGR27_PRIV1	(0x1u<<1)
#define	GTZC1_MPCBB6_PRIVCFGR27_PRIV0	(0x1u<<0)

