Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32U5G9/Includes/Registers/stm32U5Gx_gtzc1_mpcbb6.h
// PRIVCFGR28 Configuration

#define	GTZC1_MPCBB6_PRIVCFGR28_PRIV31	(0x1u<<31)
#define	GTZC1_MPCBB6_PRIVCFGR28_PRIV30	(0x1u<<30)
#define	GTZC1_MPCBB6_PRIVCFGR28_PRIV29	(0x1u<<29)
#define	GTZC1_MPCBB6_PRIVCFGR28_PRIV28	(0x1u<<28)
#define	GTZC1_MPCBB6_PRIVCFGR28_PRIV27	(0x1u<<27)
#define	GTZC1_MPCBB6_PRIVCFGR28_PRIV26	(0x1u<<26)
#define	GTZC1_MPCBB6_PRIVCFGR28_PRIV25	(0x1u<<25)
#define	GTZC1_MPCBB6_PRIVCFGR28_PRIV24	(0x1u<<24)
#define	GTZC1_MPCBB6_PRIVCFGR28_PRIV23	(0x1u<<23)
#define	GTZC1_MPCBB6_PRIVCFGR28_PRIV22	(0x1u<<22)
#define	GTZC1_MPCBB6_PRIVCFGR28_PRIV21	(0x1u<<21)
#define	GTZC1_MPCBB6_PRIVCFGR28_PRIV20	(0x1u<<20)
#define	GTZC1_MPCBB6_PRIVCFGR28_PRIV19	(0x1u<<19)
#define	GTZC1_MPCBB6_PRIVCFGR28_PRIV18	(0x1u<<18)
#define	GTZC1_MPCBB6_PRIVCFGR28_PRIV17	(0x1u<<17)
#define	GTZC1_MPCBB6_PRIVCFGR28_PRIV16	(0x1u<<16)
#define	GTZC1_MPCBB6_PRIVCFGR28_PRIV15	(0x1u<<15)
#define	GTZC1_MPCBB6_PRIVCFGR28_PRIV14	(0x1u<<14)
#define	GTZC1_MPCBB6_PRIVCFGR28_PRIV13	(0x1u<<13)
#define	GTZC1_MPCBB6_PRIVCFGR28_PRIV12	(0x1u<<12)
#define	GTZC1_MPCBB6_PRIVCFGR28_PRIV11	(0x1u<<11)
#define	GTZC1_MPCBB6_PRIVCFGR28_PRIV10	(0x1u<<10)
#define	GTZC1_MPCBB6_PRIVCFGR28_PRIV9	(0x1u<<9)
#define	GTZC1_MPCBB6_PRIVCFGR28_PRIV8	(0x1u<<8)
#define	GTZC1_MPCBB6_PRIVCFGR28_PRIV7	(0x1u<<7)
#define	GTZC1_MPCBB6_PRIVCFGR28_PRIV6	(0x1u<<6)
#define	GTZC1_MPCBB6_PRIVCFGR28_PRIV5	(0x1u<<5)
#define	GTZC1_MPCBB6_PRIVCFGR28_PRIV4	(0x1u<<4)
#define	GTZC1_MPCBB6_PRIVCFGR28_PRIV3	(0x1u<<3)
#define	GTZC1_MPCBB6_PRIVCFGR28_PRIV2	(0x1u<<2)
#define	GTZC1_MPCBB6_PRIVCFGR28_PRIV1	(0x1u<<1)
#define	GTZC1_MPCBB6_PRIVCFGR28_PRIV0	(0x1u<<0)

// PRIVCFGR29 Configuration

#define	GTZC1_MPCBB6_PRIVCFGR29_PRIV31	(0x1u<<31)
#define	GTZC1_MPCBB6_PRIVCFGR29_PRIV30	(0x1u<<30)
#define	GTZC1_MPCBB6_PRIVCFGR29_PRIV29	(0x1u<<29)
#define	GTZC1_MPCBB6_PRIVCFGR29_PRIV28	(0x1u<<28)
#define	GTZC1_MPCBB6_PRIVCFGR29_PRIV27	(0x1u<<27)
#define	GTZC1_MPCBB6_PRIVCFGR29_PRIV26	(0x1u<<26)
#define	GTZC1_MPCBB6_PRIVCFGR29_PRIV25	(0x1u<<25)
#define	GTZC1_MPCBB6_PRIVCFGR29_PRIV24	(0x1u<<24)
#define	GTZC1_MPCBB6_PRIVCFGR29_PRIV23	(0x1u<<23)
#define	GTZC1_MPCBB6_PRIVCFGR29_PRIV22	(0x1u<<22)
#define	GTZC1_MPCBB6_PRIVCFGR29_PRIV21	(0x1u<<21)
#define	GTZC1_MPCBB6_PRIVCFGR29_PRIV20	(0x1u<<20)
#define	GTZC1_MPCBB6_PRIVCFGR29_PRIV19	(0x1u<<19)
#define	GTZC1_MPCBB6_PRIVCFGR29_PRIV18	(0x1u<<18)
#define	GTZC1_MPCBB6_PRIVCFGR29_PRIV17	(0x1u<<17)
#define	GTZC1_MPCBB6_PRIVCFGR29_PRIV16	(0x1u<<16)
#define	GTZC1_MPCBB6_PRIVCFGR29_PRIV15	(0x1u<<15)
#define	GTZC1_MPCBB6_PRIVCFGR29_PRIV14	(0x1u<<14)
#define	GTZC1_MPCBB6_PRIVCFGR29_PRIV13	(0x1u<<13)
#define	GTZC1_MPCBB6_PRIVCFGR29_PRIV12	(0x1u<<12)
#define	GTZC1_MPCBB6_PRIVCFGR29_PRIV11	(0x1u<<11)
#define	GTZC1_MPCBB6_PRIVCFGR29_PRIV10	(0x1u<<10)
#define	GTZC1_MPCBB6_PRIVCFGR29_PRIV9	(0x1u<<9)
#define	GTZC1_MPCBB6_PRIVCFGR29_PRIV8	(0x1u<<8)
#define	GTZC1_MPCBB6_PRIVCFGR29_PRIV7	(0x1u<<7)
#define	GTZC1_MPCBB6_PRIVCFGR29_PRIV6	(0x1u<<6)
#define	GTZC1_MPCBB6_PRIVCFGR29_PRIV5	(0x1u<<5)
#define	GTZC1_MPCBB6_PRIVCFGR29_PRIV4	(0x1u<<4)
#define	GTZC1_MPCBB6_PRIVCFGR29_PRIV3	(0x1u<<3)
#define	GTZC1_MPCBB6_PRIVCFGR29_PRIV2	(0x1u<<2)
#define	GTZC1_MPCBB6_PRIVCFGR29_PRIV1	(0x1u<<1)
#define	GTZC1_MPCBB6_PRIVCFGR29_PRIV0	(0x1u<<0)

// PRIVCFGR30 Configuration

#define	GTZC1_MPCBB6_PRIVCFGR30_PRIV31	(0x1u<<31)
#define	GTZC1_MPCBB6_PRIVCFGR30_PRIV30	(0x1u<<30)
#define	GTZC1_MPCBB6_PRIVCFGR30_PRIV29	(0x1u<<29)
#define	GTZC1_MPCBB6_PRIVCFGR30_PRIV28	(0x1u<<28)
#define	GTZC1_MPCBB6_PRIVCFGR30_PRIV27	(0x1u<<27)
#define	GTZC1_MPCBB6_PRIVCFGR30_PRIV26	(0x1u<<26)
#define	GTZC1_MPCBB6_PRIVCFGR30_PRIV25	(0x1u<<25)
#define	GTZC1_MPCBB6_PRIVCFGR30_PRIV24	(0x1u<<24)
#define	GTZC1_MPCBB6_PRIVCFGR30_PRIV23	(0x1u<<23)
#define	GTZC1_MPCBB6_PRIVCFGR30_PRIV22	(0x1u<<22)
#define	GTZC1_MPCBB6_PRIVCFGR30_PRIV21	(0x1u<<21)
#define	GTZC1_MPCBB6_PRIVCFGR30_PRIV20	(0x1u<<20)
#define	GTZC1_MPCBB6_PRIVCFGR30_PRIV19	(0x1u<<19)
#define	GTZC1_MPCBB6_PRIVCFGR30_PRIV18	(0x1u<<18)
#define	GTZC1_MPCBB6_PRIVCFGR30_PRIV17	(0x1u<<17)
#define	GTZC1_MPCBB6_PRIVCFGR30_PRIV16	(0x1u<<16)
#define	GTZC1_MPCBB6_PRIVCFGR30_PRIV15	(0x1u<<15)
#define	GTZC1_MPCBB6_PRIVCFGR30_PRIV14	(0x1u<<14)
#define	GTZC1_MPCBB6_PRIVCFGR30_PRIV13	(0x1u<<13)
#define	GTZC1_MPCBB6_PRIVCFGR30_PRIV12	(0x1u<<12)
#define	GTZC1_MPCBB6_PRIVCFGR30_PRIV11	(0x1u<<11)
#define	GTZC1_MPCBB6_PRIVCFGR30_PRIV10	(0x1u<<10)
#define	GTZC1_MPCBB6_PRIVCFGR30_PRIV9	(0x1u<<9)
#define	GTZC1_MPCBB6_PRIVCFGR30_PRIV8	(0x1u<<8)
#define	GTZC1_MPCBB6_PRIVCFGR30_PRIV7	(0x1u<<7)
#define	GTZC1_MPCBB6_PRIVCFGR30_PRIV6	(0x1u<<6)
#define	GTZC1_MPCBB6_PRIVCFGR30_PRIV5	(0x1u<<5)
#define	GTZC1_MPCBB6_PRIVCFGR30_PRIV4	(0x1u<<4)
#define	GTZC1_MPCBB6_PRIVCFGR30_PRIV3	(0x1u<<3)
#define	GTZC1_MPCBB6_PRIVCFGR30_PRIV2	(0x1u<<2)
#define	GTZC1_MPCBB6_PRIVCFGR30_PRIV1	(0x1u<<1)
#define	GTZC1_MPCBB6_PRIVCFGR30_PRIV0	(0x1u<<0)

// PRIVCFGR31 Configuration

#define	GTZC1_MPCBB6_PRIVCFGR31_PRIV31	(0x1u<<31)
#define	GTZC1_MPCBB6_PRIVCFGR31_PRIV30	(0x1u<<30)
#define	GTZC1_MPCBB6_PRIVCFGR31_PRIV29	(0x1u<<29)
#define	GTZC1_MPCBB6_PRIVCFGR31_PRIV28	(0x1u<<28)
#define	GTZC1_MPCBB6_PRIVCFGR31_PRIV27	(0x1u<<27)
#define	GTZC1_MPCBB6_PRIVCFGR31_PRIV26	(0x1u<<26)
#define	GTZC1_MPCBB6_PRIVCFGR31_PRIV25	(0x1u<<25)
#define	GTZC1_MPCBB6_PRIVCFGR31_PRIV24	(0x1u<<24)
#define	GTZC1_MPCBB6_PRIVCFGR31_PRIV23	(0x1u<<23)
#define	GTZC1_MPCBB6_PRIVCFGR31_PRIV22	(0x1u<<22)
#define	GTZC1_MPCBB6_PRIVCFGR31_PRIV21	(0x1u<<21)
#define	GTZC1_MPCBB6_PRIVCFGR31_PRIV20	(0x1u<<20)
#define	GTZC1_MPCBB6_PRIVCFGR31_PRIV19	(0x1u<<19)
#define	GTZC1_MPCBB6_PRIVCFGR31_PRIV18	(0x1u<<18)
#define	GTZC1_MPCBB6_PRIVCFGR31_PRIV17	(0x1u<<17)
#define	GTZC1_MPCBB6_PRIVCFGR31_PRIV16	(0x1u<<16)
#define	GTZC1_MPCBB6_PRIVCFGR31_PRIV15	(0x1u<<15)
#define	GTZC1_MPCBB6_PRIVCFGR31_PRIV14	(0x1u<<14)
#define	GTZC1_MPCBB6_PRIVCFGR31_PRIV13	(0x1u<<13)
#define	GTZC1_MPCBB6_PRIVCFGR31_PRIV12	(0x1u<<12)
#define	GTZC1_MPCBB6_PRIVCFGR31_PRIV11	(0x1u<<11)
#define	GTZC1_MPCBB6_PRIVCFGR31_PRIV10	(0x1u<<10)
#define	GTZC1_MPCBB6_PRIVCFGR31_PRIV9	(0x1u<<9)
#define	GTZC1_MPCBB6_PRIVCFGR31_PRIV8	(0x1u<<8)
#define	GTZC1_MPCBB6_PRIVCFGR31_PRIV7	(0x1u<<7)
#define	GTZC1_MPCBB6_PRIVCFGR31_PRIV6	(0x1u<<6)
#define	GTZC1_MPCBB6_PRIVCFGR31_PRIV5	(0x1u<<5)
#define	GTZC1_MPCBB6_PRIVCFGR31_PRIV4	(0x1u<<4)
#define	GTZC1_MPCBB6_PRIVCFGR31_PRIV3	(0x1u<<3)
#define	GTZC1_MPCBB6_PRIVCFGR31_PRIV2	(0x1u<<2)
#define	GTZC1_MPCBB6_PRIVCFGR31_PRIV1	(0x1u<<1)
#define	GTZC1_MPCBB6_PRIVCFGR31_PRIV0	(0x1u<<0)

// PRIVCFGR32 Configuration

