Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32U5G9/Includes/Registers/stm32U5Gx_gtzc1_mpcbb6.h
#define	GTZC1_MPCBB6_PRIVCFGR32_PRIV31	(0x1u<<31)
#define	GTZC1_MPCBB6_PRIVCFGR32_PRIV30	(0x1u<<30)
#define	GTZC1_MPCBB6_PRIVCFGR32_PRIV29	(0x1u<<29)
#define	GTZC1_MPCBB6_PRIVCFGR32_PRIV28	(0x1u<<28)
#define	GTZC1_MPCBB6_PRIVCFGR32_PRIV27	(0x1u<<27)
#define	GTZC1_MPCBB6_PRIVCFGR32_PRIV26	(0x1u<<26)
#define	GTZC1_MPCBB6_PRIVCFGR32_PRIV25	(0x1u<<25)
#define	GTZC1_MPCBB6_PRIVCFGR32_PRIV24	(0x1u<<24)
#define	GTZC1_MPCBB6_PRIVCFGR32_PRIV23	(0x1u<<23)
#define	GTZC1_MPCBB6_PRIVCFGR32_PRIV22	(0x1u<<22)
#define	GTZC1_MPCBB6_PRIVCFGR32_PRIV21	(0x1u<<21)
#define	GTZC1_MPCBB6_PRIVCFGR32_PRIV20	(0x1u<<20)
#define	GTZC1_MPCBB6_PRIVCFGR32_PRIV19	(0x1u<<19)
#define	GTZC1_MPCBB6_PRIVCFGR32_PRIV18	(0x1u<<18)
#define	GTZC1_MPCBB6_PRIVCFGR32_PRIV17	(0x1u<<17)
#define	GTZC1_MPCBB6_PRIVCFGR32_PRIV16	(0x1u<<16)
#define	GTZC1_MPCBB6_PRIVCFGR32_PRIV15	(0x1u<<15)
#define	GTZC1_MPCBB6_PRIVCFGR32_PRIV14	(0x1u<<14)
#define	GTZC1_MPCBB6_PRIVCFGR32_PRIV13	(0x1u<<13)
#define	GTZC1_MPCBB6_PRIVCFGR32_PRIV12	(0x1u<<12)
#define	GTZC1_MPCBB6_PRIVCFGR32_PRIV11	(0x1u<<11)
#define	GTZC1_MPCBB6_PRIVCFGR32_PRIV10	(0x1u<<10)
#define	GTZC1_MPCBB6_PRIVCFGR32_PRIV9	(0x1u<<9)
#define	GTZC1_MPCBB6_PRIVCFGR32_PRIV8	(0x1u<<8)
#define	GTZC1_MPCBB6_PRIVCFGR32_PRIV7	(0x1u<<7)
#define	GTZC1_MPCBB6_PRIVCFGR32_PRIV6	(0x1u<<6)
#define	GTZC1_MPCBB6_PRIVCFGR32_PRIV5	(0x1u<<5)
#define	GTZC1_MPCBB6_PRIVCFGR32_PRIV4	(0x1u<<4)
#define	GTZC1_MPCBB6_PRIVCFGR32_PRIV3	(0x1u<<3)
#define	GTZC1_MPCBB6_PRIVCFGR32_PRIV2	(0x1u<<2)
#define	GTZC1_MPCBB6_PRIVCFGR32_PRIV1	(0x1u<<1)
#define	GTZC1_MPCBB6_PRIVCFGR32_PRIV0	(0x1u<<0)

// PRIVCFGR33 Configuration

#define	GTZC1_MPCBB6_PRIVCFGR33_PRIV31	(0x1u<<31)
#define	GTZC1_MPCBB6_PRIVCFGR33_PRIV30	(0x1u<<30)
#define	GTZC1_MPCBB6_PRIVCFGR33_PRIV29	(0x1u<<29)
#define	GTZC1_MPCBB6_PRIVCFGR33_PRIV28	(0x1u<<28)
#define	GTZC1_MPCBB6_PRIVCFGR33_PRIV27	(0x1u<<27)
#define	GTZC1_MPCBB6_PRIVCFGR33_PRIV26	(0x1u<<26)
#define	GTZC1_MPCBB6_PRIVCFGR33_PRIV25	(0x1u<<25)
#define	GTZC1_MPCBB6_PRIVCFGR33_PRIV24	(0x1u<<24)
#define	GTZC1_MPCBB6_PRIVCFGR33_PRIV23	(0x1u<<23)
#define	GTZC1_MPCBB6_PRIVCFGR33_PRIV22	(0x1u<<22)
#define	GTZC1_MPCBB6_PRIVCFGR33_PRIV21	(0x1u<<21)
#define	GTZC1_MPCBB6_PRIVCFGR33_PRIV20	(0x1u<<20)
#define	GTZC1_MPCBB6_PRIVCFGR33_PRIV19	(0x1u<<19)
#define	GTZC1_MPCBB6_PRIVCFGR33_PRIV18	(0x1u<<18)
#define	GTZC1_MPCBB6_PRIVCFGR33_PRIV17	(0x1u<<17)
#define	GTZC1_MPCBB6_PRIVCFGR33_PRIV16	(0x1u<<16)
#define	GTZC1_MPCBB6_PRIVCFGR33_PRIV15	(0x1u<<15)
#define	GTZC1_MPCBB6_PRIVCFGR33_PRIV14	(0x1u<<14)
#define	GTZC1_MPCBB6_PRIVCFGR33_PRIV13	(0x1u<<13)
#define	GTZC1_MPCBB6_PRIVCFGR33_PRIV12	(0x1u<<12)
#define	GTZC1_MPCBB6_PRIVCFGR33_PRIV11	(0x1u<<11)
#define	GTZC1_MPCBB6_PRIVCFGR33_PRIV10	(0x1u<<10)
#define	GTZC1_MPCBB6_PRIVCFGR33_PRIV9	(0x1u<<9)
#define	GTZC1_MPCBB6_PRIVCFGR33_PRIV8	(0x1u<<8)
#define	GTZC1_MPCBB6_PRIVCFGR33_PRIV7	(0x1u<<7)
#define	GTZC1_MPCBB6_PRIVCFGR33_PRIV6	(0x1u<<6)
#define	GTZC1_MPCBB6_PRIVCFGR33_PRIV5	(0x1u<<5)
#define	GTZC1_MPCBB6_PRIVCFGR33_PRIV4	(0x1u<<4)
#define	GTZC1_MPCBB6_PRIVCFGR33_PRIV3	(0x1u<<3)
#define	GTZC1_MPCBB6_PRIVCFGR33_PRIV2	(0x1u<<2)
#define	GTZC1_MPCBB6_PRIVCFGR33_PRIV1	(0x1u<<1)
#define	GTZC1_MPCBB6_PRIVCFGR33_PRIV0	(0x1u<<0)

// PRIVCFGR34 Configuration

#define	GTZC1_MPCBB6_PRIVCFGR34_PRIV31	(0x1u<<31)
#define	GTZC1_MPCBB6_PRIVCFGR34_PRIV30	(0x1u<<30)
#define	GTZC1_MPCBB6_PRIVCFGR34_PRIV29	(0x1u<<29)
#define	GTZC1_MPCBB6_PRIVCFGR34_PRIV28	(0x1u<<28)
#define	GTZC1_MPCBB6_PRIVCFGR34_PRIV27	(0x1u<<27)
#define	GTZC1_MPCBB6_PRIVCFGR34_PRIV26	(0x1u<<26)
#define	GTZC1_MPCBB6_PRIVCFGR34_PRIV25	(0x1u<<25)
#define	GTZC1_MPCBB6_PRIVCFGR34_PRIV24	(0x1u<<24)
#define	GTZC1_MPCBB6_PRIVCFGR34_PRIV23	(0x1u<<23)
#define	GTZC1_MPCBB6_PRIVCFGR34_PRIV22	(0x1u<<22)
#define	GTZC1_MPCBB6_PRIVCFGR34_PRIV21	(0x1u<<21)
#define	GTZC1_MPCBB6_PRIVCFGR34_PRIV20	(0x1u<<20)
#define	GTZC1_MPCBB6_PRIVCFGR34_PRIV19	(0x1u<<19)
#define	GTZC1_MPCBB6_PRIVCFGR34_PRIV18	(0x1u<<18)
#define	GTZC1_MPCBB6_PRIVCFGR34_PRIV17	(0x1u<<17)
#define	GTZC1_MPCBB6_PRIVCFGR34_PRIV16	(0x1u<<16)
#define	GTZC1_MPCBB6_PRIVCFGR34_PRIV15	(0x1u<<15)
#define	GTZC1_MPCBB6_PRIVCFGR34_PRIV14	(0x1u<<14)
#define	GTZC1_MPCBB6_PRIVCFGR34_PRIV13	(0x1u<<13)
#define	GTZC1_MPCBB6_PRIVCFGR34_PRIV12	(0x1u<<12)
#define	GTZC1_MPCBB6_PRIVCFGR34_PRIV11	(0x1u<<11)
#define	GTZC1_MPCBB6_PRIVCFGR34_PRIV10	(0x1u<<10)
#define	GTZC1_MPCBB6_PRIVCFGR34_PRIV9	(0x1u<<9)
#define	GTZC1_MPCBB6_PRIVCFGR34_PRIV8	(0x1u<<8)
#define	GTZC1_MPCBB6_PRIVCFGR34_PRIV7	(0x1u<<7)
#define	GTZC1_MPCBB6_PRIVCFGR34_PRIV6	(0x1u<<6)
#define	GTZC1_MPCBB6_PRIVCFGR34_PRIV5	(0x1u<<5)
#define	GTZC1_MPCBB6_PRIVCFGR34_PRIV4	(0x1u<<4)
#define	GTZC1_MPCBB6_PRIVCFGR34_PRIV3	(0x1u<<3)
#define	GTZC1_MPCBB6_PRIVCFGR34_PRIV2	(0x1u<<2)
#define	GTZC1_MPCBB6_PRIVCFGR34_PRIV1	(0x1u<<1)
#define	GTZC1_MPCBB6_PRIVCFGR34_PRIV0	(0x1u<<0)

// PRIVCFGR35 Configuration

#define	GTZC1_MPCBB6_PRIVCFGR35_PRIV31	(0x1u<<31)
#define	GTZC1_MPCBB6_PRIVCFGR35_PRIV30	(0x1u<<30)
#define	GTZC1_MPCBB6_PRIVCFGR35_PRIV29	(0x1u<<29)
#define	GTZC1_MPCBB6_PRIVCFGR35_PRIV28	(0x1u<<28)
#define	GTZC1_MPCBB6_PRIVCFGR35_PRIV27	(0x1u<<27)
#define	GTZC1_MPCBB6_PRIVCFGR35_PRIV26	(0x1u<<26)
#define	GTZC1_MPCBB6_PRIVCFGR35_PRIV25	(0x1u<<25)
#define	GTZC1_MPCBB6_PRIVCFGR35_PRIV24	(0x1u<<24)
#define	GTZC1_MPCBB6_PRIVCFGR35_PRIV23	(0x1u<<23)
#define	GTZC1_MPCBB6_PRIVCFGR35_PRIV22	(0x1u<<22)
#define	GTZC1_MPCBB6_PRIVCFGR35_PRIV21	(0x1u<<21)
#define	GTZC1_MPCBB6_PRIVCFGR35_PRIV20	(0x1u<<20)
#define	GTZC1_MPCBB6_PRIVCFGR35_PRIV19	(0x1u<<19)
#define	GTZC1_MPCBB6_PRIVCFGR35_PRIV18	(0x1u<<18)
#define	GTZC1_MPCBB6_PRIVCFGR35_PRIV17	(0x1u<<17)
#define	GTZC1_MPCBB6_PRIVCFGR35_PRIV16	(0x1u<<16)
#define	GTZC1_MPCBB6_PRIVCFGR35_PRIV15	(0x1u<<15)
#define	GTZC1_MPCBB6_PRIVCFGR35_PRIV14	(0x1u<<14)
#define	GTZC1_MPCBB6_PRIVCFGR35_PRIV13	(0x1u<<13)
#define	GTZC1_MPCBB6_PRIVCFGR35_PRIV12	(0x1u<<12)
#define	GTZC1_MPCBB6_PRIVCFGR35_PRIV11	(0x1u<<11)
#define	GTZC1_MPCBB6_PRIVCFGR35_PRIV10	(0x1u<<10)
#define	GTZC1_MPCBB6_PRIVCFGR35_PRIV9	(0x1u<<9)
#define	GTZC1_MPCBB6_PRIVCFGR35_PRIV8	(0x1u<<8)
#define	GTZC1_MPCBB6_PRIVCFGR35_PRIV7	(0x1u<<7)
#define	GTZC1_MPCBB6_PRIVCFGR35_PRIV6	(0x1u<<6)
#define	GTZC1_MPCBB6_PRIVCFGR35_PRIV5	(0x1u<<5)
#define	GTZC1_MPCBB6_PRIVCFGR35_PRIV4	(0x1u<<4)
#define	GTZC1_MPCBB6_PRIVCFGR35_PRIV3	(0x1u<<3)
#define	GTZC1_MPCBB6_PRIVCFGR35_PRIV2	(0x1u<<2)
#define	GTZC1_MPCBB6_PRIVCFGR35_PRIV1	(0x1u<<1)
#define	GTZC1_MPCBB6_PRIVCFGR35_PRIV0	(0x1u<<0)

