Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32U5G9/Includes/Registers/stm32U5Gx_gtzc1_mpcbb6.h
// PRIVCFGR44 Configuration

#define	GTZC1_MPCBB6_PRIVCFGR44_PRIV31	(0x1u<<31)
#define	GTZC1_MPCBB6_PRIVCFGR44_PRIV30	(0x1u<<30)
#define	GTZC1_MPCBB6_PRIVCFGR44_PRIV29	(0x1u<<29)
#define	GTZC1_MPCBB6_PRIVCFGR44_PRIV28	(0x1u<<28)
#define	GTZC1_MPCBB6_PRIVCFGR44_PRIV27	(0x1u<<27)
#define	GTZC1_MPCBB6_PRIVCFGR44_PRIV26	(0x1u<<26)
#define	GTZC1_MPCBB6_PRIVCFGR44_PRIV25	(0x1u<<25)
#define	GTZC1_MPCBB6_PRIVCFGR44_PRIV24	(0x1u<<24)
#define	GTZC1_MPCBB6_PRIVCFGR44_PRIV23	(0x1u<<23)
#define	GTZC1_MPCBB6_PRIVCFGR44_PRIV22	(0x1u<<22)
#define	GTZC1_MPCBB6_PRIVCFGR44_PRIV21	(0x1u<<21)
#define	GTZC1_MPCBB6_PRIVCFGR44_PRIV20	(0x1u<<20)
#define	GTZC1_MPCBB6_PRIVCFGR44_PRIV19	(0x1u<<19)
#define	GTZC1_MPCBB6_PRIVCFGR44_PRIV18	(0x1u<<18)
#define	GTZC1_MPCBB6_PRIVCFGR44_PRIV17	(0x1u<<17)
#define	GTZC1_MPCBB6_PRIVCFGR44_PRIV16	(0x1u<<16)
#define	GTZC1_MPCBB6_PRIVCFGR44_PRIV15	(0x1u<<15)
#define	GTZC1_MPCBB6_PRIVCFGR44_PRIV14	(0x1u<<14)
#define	GTZC1_MPCBB6_PRIVCFGR44_PRIV13	(0x1u<<13)
#define	GTZC1_MPCBB6_PRIVCFGR44_PRIV12	(0x1u<<12)
#define	GTZC1_MPCBB6_PRIVCFGR44_PRIV11	(0x1u<<11)
#define	GTZC1_MPCBB6_PRIVCFGR44_PRIV10	(0x1u<<10)
#define	GTZC1_MPCBB6_PRIVCFGR44_PRIV9	(0x1u<<9)
#define	GTZC1_MPCBB6_PRIVCFGR44_PRIV8	(0x1u<<8)
#define	GTZC1_MPCBB6_PRIVCFGR44_PRIV7	(0x1u<<7)
#define	GTZC1_MPCBB6_PRIVCFGR44_PRIV6	(0x1u<<6)
#define	GTZC1_MPCBB6_PRIVCFGR44_PRIV5	(0x1u<<5)
#define	GTZC1_MPCBB6_PRIVCFGR44_PRIV4	(0x1u<<4)
#define	GTZC1_MPCBB6_PRIVCFGR44_PRIV3	(0x1u<<3)
#define	GTZC1_MPCBB6_PRIVCFGR44_PRIV2	(0x1u<<2)
#define	GTZC1_MPCBB6_PRIVCFGR44_PRIV1	(0x1u<<1)
#define	GTZC1_MPCBB6_PRIVCFGR44_PRIV0	(0x1u<<0)

// PRIVCFGR45 Configuration

#define	GTZC1_MPCBB6_PRIVCFGR45_PRIV31	(0x1u<<31)
#define	GTZC1_MPCBB6_PRIVCFGR45_PRIV30	(0x1u<<30)
#define	GTZC1_MPCBB6_PRIVCFGR45_PRIV29	(0x1u<<29)
#define	GTZC1_MPCBB6_PRIVCFGR45_PRIV28	(0x1u<<28)
#define	GTZC1_MPCBB6_PRIVCFGR45_PRIV27	(0x1u<<27)
#define	GTZC1_MPCBB6_PRIVCFGR45_PRIV26	(0x1u<<26)
#define	GTZC1_MPCBB6_PRIVCFGR45_PRIV25	(0x1u<<25)
#define	GTZC1_MPCBB6_PRIVCFGR45_PRIV24	(0x1u<<24)
#define	GTZC1_MPCBB6_PRIVCFGR45_PRIV23	(0x1u<<23)
#define	GTZC1_MPCBB6_PRIVCFGR45_PRIV22	(0x1u<<22)
#define	GTZC1_MPCBB6_PRIVCFGR45_PRIV21	(0x1u<<21)
#define	GTZC1_MPCBB6_PRIVCFGR45_PRIV20	(0x1u<<20)
#define	GTZC1_MPCBB6_PRIVCFGR45_PRIV19	(0x1u<<19)
#define	GTZC1_MPCBB6_PRIVCFGR45_PRIV18	(0x1u<<18)
#define	GTZC1_MPCBB6_PRIVCFGR45_PRIV17	(0x1u<<17)
#define	GTZC1_MPCBB6_PRIVCFGR45_PRIV16	(0x1u<<16)
#define	GTZC1_MPCBB6_PRIVCFGR45_PRIV15	(0x1u<<15)
#define	GTZC1_MPCBB6_PRIVCFGR45_PRIV14	(0x1u<<14)
#define	GTZC1_MPCBB6_PRIVCFGR45_PRIV13	(0x1u<<13)
#define	GTZC1_MPCBB6_PRIVCFGR45_PRIV12	(0x1u<<12)
#define	GTZC1_MPCBB6_PRIVCFGR45_PRIV11	(0x1u<<11)
#define	GTZC1_MPCBB6_PRIVCFGR45_PRIV10	(0x1u<<10)
#define	GTZC1_MPCBB6_PRIVCFGR45_PRIV9	(0x1u<<9)
#define	GTZC1_MPCBB6_PRIVCFGR45_PRIV8	(0x1u<<8)
#define	GTZC1_MPCBB6_PRIVCFGR45_PRIV7	(0x1u<<7)
#define	GTZC1_MPCBB6_PRIVCFGR45_PRIV6	(0x1u<<6)
#define	GTZC1_MPCBB6_PRIVCFGR45_PRIV5	(0x1u<<5)
#define	GTZC1_MPCBB6_PRIVCFGR45_PRIV4	(0x1u<<4)
#define	GTZC1_MPCBB6_PRIVCFGR45_PRIV3	(0x1u<<3)
#define	GTZC1_MPCBB6_PRIVCFGR45_PRIV2	(0x1u<<2)
#define	GTZC1_MPCBB6_PRIVCFGR45_PRIV1	(0x1u<<1)
#define	GTZC1_MPCBB6_PRIVCFGR45_PRIV0	(0x1u<<0)

// PRIVCFGR46 Configuration

#define	GTZC1_MPCBB6_PRIVCFGR46_PRIV31	(0x1u<<31)
#define	GTZC1_MPCBB6_PRIVCFGR46_PRIV30	(0x1u<<30)
#define	GTZC1_MPCBB6_PRIVCFGR46_PRIV29	(0x1u<<29)
#define	GTZC1_MPCBB6_PRIVCFGR46_PRIV28	(0x1u<<28)
#define	GTZC1_MPCBB6_PRIVCFGR46_PRIV27	(0x1u<<27)
#define	GTZC1_MPCBB6_PRIVCFGR46_PRIV26	(0x1u<<26)
#define	GTZC1_MPCBB6_PRIVCFGR46_PRIV25	(0x1u<<25)
#define	GTZC1_MPCBB6_PRIVCFGR46_PRIV24	(0x1u<<24)
#define	GTZC1_MPCBB6_PRIVCFGR46_PRIV23	(0x1u<<23)
#define	GTZC1_MPCBB6_PRIVCFGR46_PRIV22	(0x1u<<22)
#define	GTZC1_MPCBB6_PRIVCFGR46_PRIV21	(0x1u<<21)
#define	GTZC1_MPCBB6_PRIVCFGR46_PRIV20	(0x1u<<20)
#define	GTZC1_MPCBB6_PRIVCFGR46_PRIV19	(0x1u<<19)
#define	GTZC1_MPCBB6_PRIVCFGR46_PRIV18	(0x1u<<18)
#define	GTZC1_MPCBB6_PRIVCFGR46_PRIV17	(0x1u<<17)
#define	GTZC1_MPCBB6_PRIVCFGR46_PRIV16	(0x1u<<16)
#define	GTZC1_MPCBB6_PRIVCFGR46_PRIV15	(0x1u<<15)
#define	GTZC1_MPCBB6_PRIVCFGR46_PRIV14	(0x1u<<14)
#define	GTZC1_MPCBB6_PRIVCFGR46_PRIV13	(0x1u<<13)
#define	GTZC1_MPCBB6_PRIVCFGR46_PRIV12	(0x1u<<12)
#define	GTZC1_MPCBB6_PRIVCFGR46_PRIV11	(0x1u<<11)
#define	GTZC1_MPCBB6_PRIVCFGR46_PRIV10	(0x1u<<10)
#define	GTZC1_MPCBB6_PRIVCFGR46_PRIV9	(0x1u<<9)
#define	GTZC1_MPCBB6_PRIVCFGR46_PRIV8	(0x1u<<8)
#define	GTZC1_MPCBB6_PRIVCFGR46_PRIV7	(0x1u<<7)
#define	GTZC1_MPCBB6_PRIVCFGR46_PRIV6	(0x1u<<6)
#define	GTZC1_MPCBB6_PRIVCFGR46_PRIV5	(0x1u<<5)
#define	GTZC1_MPCBB6_PRIVCFGR46_PRIV4	(0x1u<<4)
#define	GTZC1_MPCBB6_PRIVCFGR46_PRIV3	(0x1u<<3)
#define	GTZC1_MPCBB6_PRIVCFGR46_PRIV2	(0x1u<<2)
#define	GTZC1_MPCBB6_PRIVCFGR46_PRIV1	(0x1u<<1)
#define	GTZC1_MPCBB6_PRIVCFGR46_PRIV0	(0x1u<<0)

// PRIVCFGR47 Configuration

#define	GTZC1_MPCBB6_PRIVCFGR47_PRIV31	(0x1u<<31)
#define	GTZC1_MPCBB6_PRIVCFGR47_PRIV30	(0x1u<<30)
#define	GTZC1_MPCBB6_PRIVCFGR47_PRIV29	(0x1u<<29)
#define	GTZC1_MPCBB6_PRIVCFGR47_PRIV28	(0x1u<<28)
#define	GTZC1_MPCBB6_PRIVCFGR47_PRIV27	(0x1u<<27)
#define	GTZC1_MPCBB6_PRIVCFGR47_PRIV26	(0x1u<<26)
#define	GTZC1_MPCBB6_PRIVCFGR47_PRIV25	(0x1u<<25)
#define	GTZC1_MPCBB6_PRIVCFGR47_PRIV24	(0x1u<<24)
#define	GTZC1_MPCBB6_PRIVCFGR47_PRIV23	(0x1u<<23)
#define	GTZC1_MPCBB6_PRIVCFGR47_PRIV22	(0x1u<<22)
#define	GTZC1_MPCBB6_PRIVCFGR47_PRIV21	(0x1u<<21)
#define	GTZC1_MPCBB6_PRIVCFGR47_PRIV20	(0x1u<<20)
#define	GTZC1_MPCBB6_PRIVCFGR47_PRIV19	(0x1u<<19)
#define	GTZC1_MPCBB6_PRIVCFGR47_PRIV18	(0x1u<<18)
#define	GTZC1_MPCBB6_PRIVCFGR47_PRIV17	(0x1u<<17)
#define	GTZC1_MPCBB6_PRIVCFGR47_PRIV16	(0x1u<<16)
#define	GTZC1_MPCBB6_PRIVCFGR47_PRIV15	(0x1u<<15)
#define	GTZC1_MPCBB6_PRIVCFGR47_PRIV14	(0x1u<<14)
#define	GTZC1_MPCBB6_PRIVCFGR47_PRIV13	(0x1u<<13)
#define	GTZC1_MPCBB6_PRIVCFGR47_PRIV12	(0x1u<<12)
#define	GTZC1_MPCBB6_PRIVCFGR47_PRIV11	(0x1u<<11)
#define	GTZC1_MPCBB6_PRIVCFGR47_PRIV10	(0x1u<<10)
#define	GTZC1_MPCBB6_PRIVCFGR47_PRIV9	(0x1u<<9)
#define	GTZC1_MPCBB6_PRIVCFGR47_PRIV8	(0x1u<<8)
#define	GTZC1_MPCBB6_PRIVCFGR47_PRIV7	(0x1u<<7)
#define	GTZC1_MPCBB6_PRIVCFGR47_PRIV6	(0x1u<<6)
#define	GTZC1_MPCBB6_PRIVCFGR47_PRIV5	(0x1u<<5)
#define	GTZC1_MPCBB6_PRIVCFGR47_PRIV4	(0x1u<<4)
#define	GTZC1_MPCBB6_PRIVCFGR47_PRIV3	(0x1u<<3)
#define	GTZC1_MPCBB6_PRIVCFGR47_PRIV2	(0x1u<<2)
#define	GTZC1_MPCBB6_PRIVCFGR47_PRIV1	(0x1u<<1)
#define	GTZC1_MPCBB6_PRIVCFGR47_PRIV0	(0x1u<<0)

