Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32U5G9/Includes/Registers/stm32U5Gx_gtzc1_mpcbb6.h
// PRIVCFGR48 Configuration

#define	GTZC1_MPCBB6_PRIVCFGR48_PRIV31	(0x1u<<31)
#define	GTZC1_MPCBB6_PRIVCFGR48_PRIV30	(0x1u<<30)
#define	GTZC1_MPCBB6_PRIVCFGR48_PRIV29	(0x1u<<29)
#define	GTZC1_MPCBB6_PRIVCFGR48_PRIV28	(0x1u<<28)
#define	GTZC1_MPCBB6_PRIVCFGR48_PRIV27	(0x1u<<27)
#define	GTZC1_MPCBB6_PRIVCFGR48_PRIV26	(0x1u<<26)
#define	GTZC1_MPCBB6_PRIVCFGR48_PRIV25	(0x1u<<25)
#define	GTZC1_MPCBB6_PRIVCFGR48_PRIV24	(0x1u<<24)
#define	GTZC1_MPCBB6_PRIVCFGR48_PRIV23	(0x1u<<23)
#define	GTZC1_MPCBB6_PRIVCFGR48_PRIV22	(0x1u<<22)
#define	GTZC1_MPCBB6_PRIVCFGR48_PRIV21	(0x1u<<21)
#define	GTZC1_MPCBB6_PRIVCFGR48_PRIV20	(0x1u<<20)
#define	GTZC1_MPCBB6_PRIVCFGR48_PRIV19	(0x1u<<19)
#define	GTZC1_MPCBB6_PRIVCFGR48_PRIV18	(0x1u<<18)
#define	GTZC1_MPCBB6_PRIVCFGR48_PRIV17	(0x1u<<17)
#define	GTZC1_MPCBB6_PRIVCFGR48_PRIV16	(0x1u<<16)
#define	GTZC1_MPCBB6_PRIVCFGR48_PRIV15	(0x1u<<15)
#define	GTZC1_MPCBB6_PRIVCFGR48_PRIV14	(0x1u<<14)
#define	GTZC1_MPCBB6_PRIVCFGR48_PRIV13	(0x1u<<13)
#define	GTZC1_MPCBB6_PRIVCFGR48_PRIV12	(0x1u<<12)
#define	GTZC1_MPCBB6_PRIVCFGR48_PRIV11	(0x1u<<11)
#define	GTZC1_MPCBB6_PRIVCFGR48_PRIV10	(0x1u<<10)
#define	GTZC1_MPCBB6_PRIVCFGR48_PRIV9	(0x1u<<9)
#define	GTZC1_MPCBB6_PRIVCFGR48_PRIV8	(0x1u<<8)
#define	GTZC1_MPCBB6_PRIVCFGR48_PRIV7	(0x1u<<7)
#define	GTZC1_MPCBB6_PRIVCFGR48_PRIV6	(0x1u<<6)
#define	GTZC1_MPCBB6_PRIVCFGR48_PRIV5	(0x1u<<5)
#define	GTZC1_MPCBB6_PRIVCFGR48_PRIV4	(0x1u<<4)
#define	GTZC1_MPCBB6_PRIVCFGR48_PRIV3	(0x1u<<3)
#define	GTZC1_MPCBB6_PRIVCFGR48_PRIV2	(0x1u<<2)
#define	GTZC1_MPCBB6_PRIVCFGR48_PRIV1	(0x1u<<1)
#define	GTZC1_MPCBB6_PRIVCFGR48_PRIV0	(0x1u<<0)

// PRIVCFGR49 Configuration

#define	GTZC1_MPCBB6_PRIVCFGR49_PRIV31	(0x1u<<31)
#define	GTZC1_MPCBB6_PRIVCFGR49_PRIV30	(0x1u<<30)
#define	GTZC1_MPCBB6_PRIVCFGR49_PRIV29	(0x1u<<29)
#define	GTZC1_MPCBB6_PRIVCFGR49_PRIV28	(0x1u<<28)
#define	GTZC1_MPCBB6_PRIVCFGR49_PRIV27	(0x1u<<27)
#define	GTZC1_MPCBB6_PRIVCFGR49_PRIV26	(0x1u<<26)
#define	GTZC1_MPCBB6_PRIVCFGR49_PRIV25	(0x1u<<25)
#define	GTZC1_MPCBB6_PRIVCFGR49_PRIV24	(0x1u<<24)
#define	GTZC1_MPCBB6_PRIVCFGR49_PRIV23	(0x1u<<23)
#define	GTZC1_MPCBB6_PRIVCFGR49_PRIV22	(0x1u<<22)
#define	GTZC1_MPCBB6_PRIVCFGR49_PRIV21	(0x1u<<21)
#define	GTZC1_MPCBB6_PRIVCFGR49_PRIV20	(0x1u<<20)
#define	GTZC1_MPCBB6_PRIVCFGR49_PRIV19	(0x1u<<19)
#define	GTZC1_MPCBB6_PRIVCFGR49_PRIV18	(0x1u<<18)
#define	GTZC1_MPCBB6_PRIVCFGR49_PRIV17	(0x1u<<17)
#define	GTZC1_MPCBB6_PRIVCFGR49_PRIV16	(0x1u<<16)
#define	GTZC1_MPCBB6_PRIVCFGR49_PRIV15	(0x1u<<15)
#define	GTZC1_MPCBB6_PRIVCFGR49_PRIV14	(0x1u<<14)
#define	GTZC1_MPCBB6_PRIVCFGR49_PRIV13	(0x1u<<13)
#define	GTZC1_MPCBB6_PRIVCFGR49_PRIV12	(0x1u<<12)
#define	GTZC1_MPCBB6_PRIVCFGR49_PRIV11	(0x1u<<11)
#define	GTZC1_MPCBB6_PRIVCFGR49_PRIV10	(0x1u<<10)
#define	GTZC1_MPCBB6_PRIVCFGR49_PRIV9	(0x1u<<9)
#define	GTZC1_MPCBB6_PRIVCFGR49_PRIV8	(0x1u<<8)
#define	GTZC1_MPCBB6_PRIVCFGR49_PRIV7	(0x1u<<7)
#define	GTZC1_MPCBB6_PRIVCFGR49_PRIV6	(0x1u<<6)
#define	GTZC1_MPCBB6_PRIVCFGR49_PRIV5	(0x1u<<5)
#define	GTZC1_MPCBB6_PRIVCFGR49_PRIV4	(0x1u<<4)
#define	GTZC1_MPCBB6_PRIVCFGR49_PRIV3	(0x1u<<3)
#define	GTZC1_MPCBB6_PRIVCFGR49_PRIV2	(0x1u<<2)
#define	GTZC1_MPCBB6_PRIVCFGR49_PRIV1	(0x1u<<1)
#define	GTZC1_MPCBB6_PRIVCFGR49_PRIV0	(0x1u<<0)

// PRIVCFGR50 Configuration

#define	GTZC1_MPCBB6_PRIVCFGR50_PRIV31	(0x1u<<31)
#define	GTZC1_MPCBB6_PRIVCFGR50_PRIV30	(0x1u<<30)
#define	GTZC1_MPCBB6_PRIVCFGR50_PRIV29	(0x1u<<29)
#define	GTZC1_MPCBB6_PRIVCFGR50_PRIV28	(0x1u<<28)
#define	GTZC1_MPCBB6_PRIVCFGR50_PRIV27	(0x1u<<27)
#define	GTZC1_MPCBB6_PRIVCFGR50_PRIV26	(0x1u<<26)
#define	GTZC1_MPCBB6_PRIVCFGR50_PRIV25	(0x1u<<25)
#define	GTZC1_MPCBB6_PRIVCFGR50_PRIV24	(0x1u<<24)
#define	GTZC1_MPCBB6_PRIVCFGR50_PRIV23	(0x1u<<23)
#define	GTZC1_MPCBB6_PRIVCFGR50_PRIV22	(0x1u<<22)
#define	GTZC1_MPCBB6_PRIVCFGR50_PRIV21	(0x1u<<21)
#define	GTZC1_MPCBB6_PRIVCFGR50_PRIV20	(0x1u<<20)
#define	GTZC1_MPCBB6_PRIVCFGR50_PRIV19	(0x1u<<19)
#define	GTZC1_MPCBB6_PRIVCFGR50_PRIV18	(0x1u<<18)
#define	GTZC1_MPCBB6_PRIVCFGR50_PRIV17	(0x1u<<17)
#define	GTZC1_MPCBB6_PRIVCFGR50_PRIV16	(0x1u<<16)
#define	GTZC1_MPCBB6_PRIVCFGR50_PRIV15	(0x1u<<15)
#define	GTZC1_MPCBB6_PRIVCFGR50_PRIV14	(0x1u<<14)
#define	GTZC1_MPCBB6_PRIVCFGR50_PRIV13	(0x1u<<13)
#define	GTZC1_MPCBB6_PRIVCFGR50_PRIV12	(0x1u<<12)
#define	GTZC1_MPCBB6_PRIVCFGR50_PRIV11	(0x1u<<11)
#define	GTZC1_MPCBB6_PRIVCFGR50_PRIV10	(0x1u<<10)
#define	GTZC1_MPCBB6_PRIVCFGR50_PRIV9	(0x1u<<9)
#define	GTZC1_MPCBB6_PRIVCFGR50_PRIV8	(0x1u<<8)
#define	GTZC1_MPCBB6_PRIVCFGR50_PRIV7	(0x1u<<7)
#define	GTZC1_MPCBB6_PRIVCFGR50_PRIV6	(0x1u<<6)
#define	GTZC1_MPCBB6_PRIVCFGR50_PRIV5	(0x1u<<5)
#define	GTZC1_MPCBB6_PRIVCFGR50_PRIV4	(0x1u<<4)
#define	GTZC1_MPCBB6_PRIVCFGR50_PRIV3	(0x1u<<3)
#define	GTZC1_MPCBB6_PRIVCFGR50_PRIV2	(0x1u<<2)
#define	GTZC1_MPCBB6_PRIVCFGR50_PRIV1	(0x1u<<1)
#define	GTZC1_MPCBB6_PRIVCFGR50_PRIV0	(0x1u<<0)

// PRIVCFGR51 Configuration

#define	GTZC1_MPCBB6_PRIVCFGR51_PRIV31	(0x1u<<31)
#define	GTZC1_MPCBB6_PRIVCFGR51_PRIV30	(0x1u<<30)
#define	GTZC1_MPCBB6_PRIVCFGR51_PRIV29	(0x1u<<29)
#define	GTZC1_MPCBB6_PRIVCFGR51_PRIV28	(0x1u<<28)
#define	GTZC1_MPCBB6_PRIVCFGR51_PRIV27	(0x1u<<27)
#define	GTZC1_MPCBB6_PRIVCFGR51_PRIV26	(0x1u<<26)
#define	GTZC1_MPCBB6_PRIVCFGR51_PRIV25	(0x1u<<25)
#define	GTZC1_MPCBB6_PRIVCFGR51_PRIV24	(0x1u<<24)
#define	GTZC1_MPCBB6_PRIVCFGR51_PRIV23	(0x1u<<23)
#define	GTZC1_MPCBB6_PRIVCFGR51_PRIV22	(0x1u<<22)
#define	GTZC1_MPCBB6_PRIVCFGR51_PRIV21	(0x1u<<21)
#define	GTZC1_MPCBB6_PRIVCFGR51_PRIV20	(0x1u<<20)
#define	GTZC1_MPCBB6_PRIVCFGR51_PRIV19	(0x1u<<19)
#define	GTZC1_MPCBB6_PRIVCFGR51_PRIV18	(0x1u<<18)
#define	GTZC1_MPCBB6_PRIVCFGR51_PRIV17	(0x1u<<17)
#define	GTZC1_MPCBB6_PRIVCFGR51_PRIV16	(0x1u<<16)
#define	GTZC1_MPCBB6_PRIVCFGR51_PRIV15	(0x1u<<15)
#define	GTZC1_MPCBB6_PRIVCFGR51_PRIV14	(0x1u<<14)
#define	GTZC1_MPCBB6_PRIVCFGR51_PRIV13	(0x1u<<13)
#define	GTZC1_MPCBB6_PRIVCFGR51_PRIV12	(0x1u<<12)
#define	GTZC1_MPCBB6_PRIVCFGR51_PRIV11	(0x1u<<11)
#define	GTZC1_MPCBB6_PRIVCFGR51_PRIV10	(0x1u<<10)
#define	GTZC1_MPCBB6_PRIVCFGR51_PRIV9	(0x1u<<9)
#define	GTZC1_MPCBB6_PRIVCFGR51_PRIV8	(0x1u<<8)
#define	GTZC1_MPCBB6_PRIVCFGR51_PRIV7	(0x1u<<7)
#define	GTZC1_MPCBB6_PRIVCFGR51_PRIV6	(0x1u<<6)
#define	GTZC1_MPCBB6_PRIVCFGR51_PRIV5	(0x1u<<5)
#define	GTZC1_MPCBB6_PRIVCFGR51_PRIV4	(0x1u<<4)
#define	GTZC1_MPCBB6_PRIVCFGR51_PRIV3	(0x1u<<3)
#define	GTZC1_MPCBB6_PRIVCFGR51_PRIV2	(0x1u<<2)
#define	GTZC1_MPCBB6_PRIVCFGR51_PRIV1	(0x1u<<1)
#define	GTZC1_MPCBB6_PRIVCFGR51_PRIV0	(0x1u<<0)
